{
  "title": "Thrills and Bills",
  "instructions": "You are going to read a magazine article about some successful children and their mothers. For Questions 23–35, choose from the people (A–F).",
  "texts": [
    {
      "title": "",
      "content": "A — Annika Reeder, 15, gymnast. Her coach tells her she must take care of her physical condition. She works every day and says she keeps going even when tired. She has set a specific goal to compete at the British Juniors.",
      "evidence": [
        { "statementIndex": 0, "text": "my coach gives me a chat to 'not neglect my condition'" },
        { "statementIndex": 5, "text": "when I feel very tired... I carry on" },
        { "statementIndex": 10, "text": "My goal this year is to qualify" }
      ]
    },
    {
      "title": "",
      "content": "B — Annika’s mother. She realises parents cannot force children to perform. She has seen parents make mistakes by pushing too hard. She mentions financial sacrifices such as travel and time off work.",
      "evidence": [
        { "statementIndex": 2, "text": "you can't force children to perform" },
        { "statementIndex": 4, "text": "I've seen some parents push their children" },
        { "statementIndex": 6, "text": "I take time off work... it's expensive" }
      ]
    },
    {
      "title": "",
      "content": "C — Sarah Stokes, show-jumper. Guided by her parents. Loves the atmosphere at competitions and the show-jumping world.",
      "evidence": [
        { "statementIndex": 0, "text": "Mum and Dad have supported me from the start" },
        { "statementIndex": 8, "text": "I love the whole scene" }
      ]
    },
    {
      "title": "",
      "content": "D — Sarah’s mother. Says Sarah must keep fit and exercise her pony. She is pleased at how Sarah’s confidence and personality have improved.",
      "evidence": [
        { "statementIndex": 0, "text": "to exercise her pony and keep fit" },
        { "statementIndex": 7, "text": "Sarah is so much more happy now" }
      ]
    },
    {
      "title": "",
      "content": "E — Jane McShane, chess player. Admits she doesn’t always concentrate and should pay attention more. Has set goals to become Under-14 champion.",
      "evidence": [
        { "statementIndex": 1, "text": "I don't concentrate... I should pay attention more" },
        { "statementIndex": 10, "text": "I want to become Britain's Under-14 champion" }
      ]
    },
    {
      "title": "",
      "content": "F — Jane’s mother. Does not share her daughter’s enthusiasm for the activity. Expresses doubt about her gift and potential.",
      "evidence": [
        { "statementIndex": 11, "text": "I'm not sure she has this gift" }
      ]
    }
  ],
  "statements": [
    { "text": "says she must not neglect her physical condition?", "answer": ["A", "D"] },
    { "text": "doesn't feel the need to pay attention all the time?", "answer": "E" },
    { "text": "realises people can’t be forced to do what they don’t want to?", "answer": "B" },
    { "text": "realises people can’t be forced to do what they don’t want to?", "answer": "B" },
    { "text": "recognises the mistakes some parents make?", "answer": "B" },
    { "text": "has to make an effort when she doesn’t want to?", "answer": "A" },
    { "text": "mentions the financial sacrifices necessary?", "answer": "B" },
    { "text": "is pleased by the way her daughter’s character has developed?", "answer": "D" },
    { "text": "likes the atmosphere at competitions?", "answer": "C" },
    { "text": "likes the atmosphere at competitions?", "answer": "C" },
    { "text": "has set herself specific goals in her activity?", "answer": ["A", "E"] },
    { "text": "has set herself specific goals in her activity?", "answer": ["A", "E"] },
    { "text": "doesn’t share her daughter’s enthusiasm for the activity?", "answer": "F" }
  ]
}

