{
  "title": "Speak Easy",
  "instructions": "You are going to read an article containing advice about speaking in public. For questions 22–35, choose from the sections (A–F). The sections may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "We have all sat through somebody mumbling a series of disconnected thoughts and wondered when it was going to end. It is important to remember how you felt for the person doing the talk. Most probably, you sympathised with them and were relieved for them when they had ‘got through’ it. This is important because your audience will also want the best for you. Visualise yourself delivering a witty, clever and informative presentation with the audience hanging on every word. If you are not realising it, there will be a tendency to retreat from the audience or you may sway from side to side. Therefore, think of ways to counteract this when rehearsing (e.g. imagine you are wearing heavy lead shoes on your feet so that they are keeping your body still). Try not to lean on tables or get your arms too close to your body, as this will limit your gestures. Relying too much on written notes obscures your voice. Although it may help you feel more relaxed, reading written notes at length will be distracting for the audience.",
      "evidence": [
        { "statementIndex": 0, "text": "Relying too much on written notes" },
        { "statementIndex": 1, "text": "sway from side to side" },
        { "statementIndex": 3, "text": "your audience will also want the best for you" },
        { "statementIndex": 5, "text": "Visualise yourself delivering" }
      ]
    },
    {
      "title": "",
      "content": "‘Nobody plans to fail; they simply fail to plan’. Nowhere is this more true than in the arena of public speaking. The classic format for any talk has a beginning, a middle and an end. Think about what you want them to take away and plan the content of the talk to last an appropriate amount of time. Also think about your audience: the style you take in approaching the topic of your talk is important and the level of information must be correct. Don’t rely too much on your written notes as well; small cards are quite good as they can be discreet and frequently are unnoticeable, compared to large sheets of paper.",
      "evidence": [
        { "statementIndex": 2, "text": "the level of information must be correct" },
        { "statementIndex": 4, "text": "classic format for any talk has a beginning, a middle and an end" },
        { "statementIndex": 6, "text": "Don’t rely too much on your written notes" }
      ]
    },
    {
      "title": "",
      "content": "Whenever possible, make sure you know the venue of your talk and check to ensure people can see you and you can see your audience clearly. Adjust your position accordingly so you can be seen and heard. Some of this depends on the size of the room and the lighting. These small differences encourage a feeling of sincerity and help your audience understand you better.",
      "evidence": [
        { "statementIndex": 9, "text": "ensure people can see you and you can see your audience" }
      ]
    },
    {
      "title": "",
      "content": "It is important that you stand on the floor but slightly apart. Without realising it, you may sway from side to side or retreat from the audience. Keep an eye on unconscious movements and avoid habits which can distract the audience. Try not to lean on tables or hold your arms too tightly to your body. These unconscious habits may make you appear nervous.",
      "evidence": [
        { "statementIndex": 5, "text": "unconscious movements" }
      ]
    },
    {
      "title": "",
      "content": "As with any skill, practice is vital. The more you practise, the more confident you will be. Try not to simply read out what you have prepared, but present knowledgeably about your subject. Rehearsing will help you feel more confident and achieve a more natural presentation style. Most learners find they feel positive after practising several times.",
      "evidence": [
        { "statementIndex": 10, "text": "The more you practise, the more confident you will be" }
      ]
    },
    {
      "title": "",
      "content": "Despite the fact that we all feel shy or nervous when talking to a large group, the reality is it only takes a moment to gather yourself and gain control. But remember that the audience must be comfortable. Ensure they have a good view of you and that you are standing in a comfortable spot. Be aware of your breathing and the speed and clarity of your voice. Try not to rush. Breathing exercises and voice projection techniques will all help.",
      "evidence": [
        { "statementIndex": 11, "text": "speed and clarity of your voice" },
        { "statementIndex": 12, "text": "Ensure they have a good view of you" }
      ]
    }
  ],
  "statements": [
    { "text": "not using lengthy written notes?", "answer": "A" },
    { "text": "an action that may cause listeners to lose concentration?", "answer": "A" },
    { "text": "the need to ensure that a talk is at the right level?", "answer": "B" },
    { "text": "the fact that audiences tend to be supportive towards a speaker?", "answer": "A" },
    { "text": "a technique used by well-known entertainers?", "answer": "A" },
    { "text": "unconscious movements that speakers may make?", "answer": "D" },
    { "text": "the need to avoid being dependent on written notes?", "answer": "B" },
    { "text": "the standard structure of a talk?", "answer": "B" },
    { "text": "the physical distance between a speaker and an audience?", "answer": "C" },
    { "text": "imagining yourself as a good speaker?", "answer": "A" },
    { "text": "the personal benefit gained from repeated rehearsals?", "answer": "E" },
    { "text": "the need to be aware of the speed at which a talk is delivered?", "answer": "F" },
    { "text": "the fact that an audience should have a good view?", "answer": "F" }
  ]
}

