{
  "title": "Train Journeys",
  "instructions": "You are going to read five short descriptions about people’s train journeys. For questions 22–35, choose from the people (A–E). The people may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "I fell in love with the south of France a long time ago and try to get back there as often as I can. There’s a local train from Cannes along the coast which crosses the border with Italy. It takes you past some of the most amazing seascapes. It never matters what the weather is like, or what time of year it is, it is always enchanting. Out of the other window are some of the best back gardens and residences in the whole of France. You feel like someone peering into the property of the rich and famous. The travellers themselves are interesting people and locals, all with different itineraries but all admirers of the breathtaking journey.",
      "evidence": [
        { "statementIndex": 1, "text": "most amazing seascapes" },
        { "statementIndex": 3, "text": "enchanting" },
        { "statementIndex": 10, "text": "crosses the border with Italy" },
        { "statementIndex": 12, "text": "the travellers themselves are interesting people" }
      ]
    },
    {
      "title": "",
      "content": "I have enjoyed so many rail journeys through the years, but if I had to pick a favourite it would be the Nile Valley Express, which runs across the desert of northern Sudan. The one sadness was that, when I was young, growing up in South Africa, I was missing out on a family train journey from Cape Town to the Kruger National Park. I was regarded as being too young to be included, and was sent off to an aunt. I remember the hurt of that. I’ve learnt details from the line from my research and from those I’ve met who travelled often. And Waterloo station still gives me a thrill when I enter because of all the memories.",
      "evidence": [
        { "statementIndex": 7, "text": "Nile Valley Express" },
        { "statementIndex": 8, "text": "I was missing out on a family train journey" },
        { "statementIndex": 9, "text": "I’ve learnt details from the line" }
      ]
    },
    {
      "title": "",
      "content": "I am indebted to one train in particular: the Blue Train, which took my husband and me on our honeymoon across a route that I thought was gone. They didn’t think I was old enough to travel by myself on it when I was younger, and although that seems amusing now, the train has been part of my life for so long that I feel a real gratitude for how it broadened my horizons. There was a kind stranger who told me a piece of history about how the line had been looked after by volunteers without pay, and that always stayed with me. However, I remember about the journey itself how I thought it would be dull, but the opposite was true: it brought me peace after all the wedding preparations.",
      "evidence": [
        { "statementIndex": 11, "text": "volunteers without pay" },
        { "statementIndex": 12, "text": "didn’t think I was old enough" },
        { "statementIndex": 6, "text": "I am indebted to one train in particular" }
      ]
    },
    {
      "title": "",
      "content": "We were working on a series of articles based around a north-African trip. We travelled to a desert in an off-road car and waited for the train. We’d been told, so the story went, that the driver would do as he pleased. We couldn’t be sure of the schedule, but the views of the desert were extraordinary, and we also heard that, in any case, the driver would probably not stop at the places he should. When we appeared, there was a sudden change of weather and the harshness of people in charge of the line in previous years caused the man to stop the train and allowed the travel to be restored. During that long ride, the landscape I saw across the morning was a dream, like travelling across the moon.",
      "evidence": [
        { "statementIndex": 0, "text": "we couldn’t be sure of the schedule" },
        { "statementIndex": 1, "text": "the views of the desert were extraordinary" }
      ]
    },
    {
      "title": "",
      "content": "I imagine most people’s favourite memories are of travelling with friends, but my memories of the railways are very different. Most cases I was on my own in Singapore or travelling across Thailand, or even by night to Bangkok. There was such a nice feeling in the atmosphere of these trains, and the mix of people who joined the train always made the experience better for me. I made a film of these journeys, which I like to watch. I loved the gentle rocking of the carriages. Most of the journeys were memorable and relaxing, and I was never disappointed. The people on the train were always relaxed, and although I was often alone, the feeling was warm, and I always enjoyed the company of others. That’s why, even if the train arrived late, I felt the same, even among the toys found on the station platform!",
      "evidence": [
        { "statementIndex": 2, "text": "the mix of people who joined the train always made the experience better" },
        { "statementIndex": 3, "text": "gentle rocking of the carriages" },
        { "statementIndex": 4, "text": "I was never disappointed" },
        { "statementIndex": 13, "text": "enjoyed the company of others" }
      ]
    }
  ],
  "statements": [
    { "text": "was unable to count on the train service", "answer": "D" },
    { "text": "enjoyed the company of fellow passengers", "answer": "E" },
    { "text": "found the views from the train dramatic", "answer": "A" },
    { "text": "welcomed a chance to relax on the trip", "answer": "E" },
    { "text": "was never disappointed by the journey", "answer": "E" },
    { "text": "has a reason for feeling grateful to one special train", "answer": "C" },
    { "text": "travelled on a railway which is no longer in regular service", "answer": "B" },
    { "text": "regretted not going on a particular train trip", "answer": "B" },
    { "text": "used to travel on the railway whenever possible", "answer": "A" },
    { "text": "learnt an interesting piece of information on a train journey", "answer": "B" },
    { "text": "took a train which travelled from one country to another", "answer": "A" },
    { "text": "says that the railway had been looked after by unpaid helpers", "answer": "C" },
    { "text": "was once considered not old enough to travel by train", "answer": "C" }
  ]
}

