{
  "title": "The Joys of Orienteering",
  "instructions": "You are going to read an article about the sport of orienteering. For questions 22–35, choose from the people (A–D). The people may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "Anna Peirce, ten years old and out of breath, is lost. Admittedly, her mother is standing only a metre away, but Anna has to find her on her own and master the skills she must use. The Peirces took up orienteering three years ago at the suggestion of a friend. Now the family attends events each weekend, anything up to 150 kilometres away. 'It’s such fun,' says Anna. ‘And the best thing is trying not to get bored when playing with other kids my age. Now I want to be as good as the top competitors.’",
      "evidence": [
        { "statementIndex": 6, "text": "The Peirces took up orienteering three years ago at the suggestion of a friend" },
        { "statementIndex": 7, "text": "I want to be as good as the top competitors" }
      ]
    },
    {
      "title": "",
      "content": "‘It is as much a competition against the course, yourself and your judgment, as it is against other people,’ says Jerry Newcombe, vice-chairman of Southampton Orienteering Club and organiser of the meeting this morning. ‘The great thing is that people of every age can enjoy it. A plodder can get just as much fun as someone who covers the course within minutes. A couple of kilometres with poor path visibility is quite difficult to negotiate. It is more demanding than walking but still pleasant. And bad conditions are part of the fun,’ he says. ‘This sport is growing fast, attracting more and more families.’",
      "evidence": [
        { "statementIndex": 1, "text": "vice-chairman of Southampton Orienteering Club" },
        { "statementIndex": 4, "text": "people of every age can enjoy it" },
        { "statementIndex": 10, "text": "more demanding than walking" },
        { "statementIndex": 11, "text": "attracting more and more families" },
        { "statementIndex": 9, "text": "bad conditions are part of the fun" }
      ]
    },
    {
      "title": "",
      "content": "A year ago, Julia Wigley had no intention of competing. ‘I’d never even heard of it,’ she says. She began taking her 11-year-old daughter to local events. ‘But I got bored standing watching, so I had a go myself,’ she says. ‘You’re always getting wet and muddy as you race with the youngsters. It takes more skill than going for a run.’ Julia says she likes the fact that competitors of all ages work together, and she enjoys the social side as she runs under the finishing tape.",
      "evidence": [
        { "statementIndex": 2, "text": "wet and muddy" },
        { "statementIndex": 12, "text": "I got bored standing watching" },
        { "statementIndex": 5, "text": "competitors of all ages work together" }
      ]
    },
    {
      "title": "",
      "content": "Ian Diamond, a tall, strong-looking professor at Southampton University, talks about the sport in which a competitor has to read a map, interpret terrain and beat a 12-minute kilometre. ‘Feeling cold, wet or tired is all part of the fun, and this is a great way to stay fit,’ he says. He runs with the club regularly and enjoys the company of others. ‘The scenery is beautiful and I’d rather be doing nothing else on a Sunday,’ he adds.",
      "evidence": [
        { "statementIndex": 13, "text": "The scenery is beautiful" },
        { "statementIndex": 0, "text": "I'd rather be doing nothing else on a Sunday" }
      ]
    }
  ],
  "statements": [
    { "text": "prefers orienteering to being with friends?", "answer": "D" },
    { "text": "is involved with the administrative side of the sport?", "answer": "B" },
    { "text": "admits that sometimes the experience is unpleasant?", "answer": "C" },
    { "text": "is still gaining the necessary skills?", "answer": "C" },
    { "text": "finds the sport as suitable for beginners as for experts?", "answer": "B" },
    { "text": "likes the competition between people of different ages?", "answer": "C" },
    { "text": "was introduced to the sport by another member of the family?", "answer": "A" },
    { "text": "wants to become an expert?", "answer": "A" },
    { "text": "is modest about their achievements in the sport?", "answer": "D" },
    { "text": "thinks bad conditions are part of the fun?", "answer": "B" },
    { "text": "finds the sport more demanding than simply walking?", "answer": "B" },
    { "text": "says the sport is attracting more and more families?", "answer": "B" },
    { "text": "found it boring to be just a spectator?", "answer": "C" },
    { "text": "says the scenery is an enjoyable part of the sport?", "answer": "D" }
  ]
}

