{
  "title": "Perfect Pictures",
  "instructions": "You are going to read a magazine article about the winners of a wildlife photography competition. For questions 21–35, choose from the photographers (A–F). The people may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "Carol, a school student, won the 15–17 age group category with her picture of wild dogs. She took some 40–50 pictures of them—breaking with her normal practice of waiting until she is completely happy and then taking just a few shots. ‘On this occasion, I was worried about missing the shot,’ says Carol. ‘It was difficult to keep the camera still with people moving around in the vehicle. I was taking the photos from inside to avoid getting too close.’ She believes in keeping things simple by sticking with natural lighting. ‘I also try not to bother the animals by getting too close,’ she says.",
      "evidence": [
        { "statementIndex": 13, "text": "I also try not to bother the animals" }
      ]
    },
    {
      "title": "",
      "content": "Peter was runner-up in ‘The World in Our Hands’ category with his picture of a dead bird covered in oil from a tanker accident. Peter has been freelance since 1997 and now specialises in marine wildlife and underwater photography. He believes there is nothing to beat getting out there and learning from experience. In addition, he says advances in underwater technology and cameras have made a huge difference to what you can now do.",
      "evidence": [
        { "statementIndex": 1, "text": "covered in oil from a tanker accident" },
        { "statementIndex": 7, "text": "advances in underwater technology" }
      ]
    },
    {
      "title": "",
      "content": "Chris has won ‘The World in Our Hands’ category for four years in a row. ‘The stillness of the animals is remarkable,’ he says. ‘For me, it's all about waiting for the perfect moment. I often spend hours waiting in the same spot.’ Chris’s experience in conservation work means he takes a lot of time ensuring his work does not disturb the wildlife. Because his normal camera is not waterproof, he had to borrow special waterproof gear for this shoot. He prefers shots that are as natural as possible and encourages people to protect the natural world.",
      "evidence": [
        { "statementIndex": 2, "text": "spend hours waiting" },
        { "statementIndex": 11, "text": "had to borrow special waterproof gear" },
        { "statementIndex": 6, "text": "as natural as possible" }
      ]
    },
    {
      "title": "",
      "content": "Frank took his winning picture in the Antarctic after a snowstorm. ‘As the weather calmed, the light began to produce amazing new opportunities,’ he says. ‘Before I went to photograph, I had done plenty of planning, especially finding a camera which would work at very low temperatures.’ What advice would Frank give to beginners? ‘The best place to start is to find a subject you feel passionate about and really get to know it.’ He also says that a good idea is to begin with something modest to move to more ambitious items. Try to see the world through the animal’s eyes.",
      "evidence": [
        { "statementIndex": 3, "text": "done plenty of planning" },
        { "statementIndex": 7, "text": "finding a camera which would work at very low temperatures" }
      ]
    },
    {
      "title": "",
      "content": "Terence travels the world as a professional outdoor and travel photographer, and he won the ‘Plants’ category with his picture of trees in the desert. He works full-time as a teacher and spends his holidays photographing wildlife. He believes practice is more important than theory, as it is the only way to understand how animals behave. He also feels it is important to record the less attractive aspects of nature, as they tell the truth about the environment. The more honest the picture, the more appealing it is, he says.",
      "evidence": [
        { "statementIndex": 4, "text": "works full-time as a teacher" },
        { "statementIndex": 5, "text": "practice is more important than theory" },
        { "statementIndex": 8, "text": "important to record the less attractive aspects" }
      ]
    },
    {
      "title": "",
      "content": "David’s shot of a baby duckling won the ‘Bird Behaviour’ category. David is actually a fire safety consultant, but photography is still a big part of his life. Bad weather meant the lighting was wrong and the camera kept blurring the subject, but he waited until the moment he saw the fish approach the duckling. ‘I knew this was the shot,’ he says. ‘I rushed to get the photo before it moved out of frame.’ David says he had to take multiple shots to be sure his idea had worked.",
      "evidence": [
        { "statementIndex": 9, "text": "lighting was wrong and the camera kept blurring" }
      ]
    }
  ],
  "statements": [
    { "text": "took a photo after an environmental disaster?", "answer": "B" },
    { "text": "needed a great deal of patience to get their winning shots?", "answer": "C" },
    { "text": "do some research before taking photos?", "answer": "D" },
    { "text": "works full-time in an unrelated profession?", "answer": "E" },
    { "text": "says practice is more important than theory?", "answer": "E" },
    { "text": "prefers photos with little detail?", "answer": "C" },
    { "text": "talk about improvements in the tools they use?", "answer": "D" },
    { "text": "thinks it's important to record unpleasant images?", "answer": "E" },
    { "text": "had technical problems during the shooting of their photos?", "answer": "F" },
    { "text": "had to change the tools they normally use?", "answer": "C" },
    { "text": "doesn't like to upset the wildlife?", "answer": "A" }
  ]
}

