{
  "title": "First-time Inventors",
  "instructions": "You are going to read four extracts from an article about people who have invented things. For questions 23–35, choose from the people (A–D). The people may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "John Coathupe is the inventor of the ‘Garden Vac’, a machine that vacuums up leaves, grass cuttings and other garden litter. ‘I have a lively mind – I’m an engineer by training – but I’d never done anything like this before.’ One wet November night, he decided to experiment. It took him quite a while to develop the idea, but he wanted to work on it alone. ‘I knew what had to be done, but I didn’t expect it to become as popular as it has.’ He keeps a notebook of ideas but finds it difficult to sit down and work on them, so he works alone and tries to improve the design whenever possible.",
      "evidence": [
        { "statementIndex": 0, "text": "wanted to work on it alone" },
        { "statementIndex": 1, "text": "didn't expect it to become as popular as it has" }
      ]
    },
    {
      "title": "",
      "content": "Mandy Haberman is the inventor of the ‘Anyway-Up Cup’, a child’s cup that does not spill liquids. ‘I used my own money to make prototypes. We took them to exhibitions. We took £100,000 of orders. It then took eight years before the cup really sold.’ She adds, ‘Engineering companies stole my ideas and made their own products. I didn’t make a lot of money for years.’ She believes her invention is helpful, but financially it has been a long road.",
      "evidence": [
        { "statementIndex": 5, "text": "didn't make a lot of money for years" },
        { "statementIndex": 10, "text": "companies stole my ideas" }
      ]
    },
    {
      "title": "",
      "content": "Jeff Wolf is the inventor of ‘MicroMap’. He created a small map system that can be reduced to the size of a credit card. Jeff says, ‘I didn’t doubt for a moment that it could work.’ He showed designs to companies and was surprised by the interest. But the work affected his personal life: ‘My girlfriend left me because I worked too much.’ Later, international companies produced his maps and he says he can no longer make the product himself. ‘The experience has left me bruised, but now I feel more positive than ever.’",
      "evidence": [
        { "statementIndex": 4, "text": "surprised by the interest" },
        { "statementIndex": 2, "text": "experience has left me bruised, but now I feel more positive" },
        { "statementIndex": 3, "text": "interested" },
        { "statementIndex": 8, "text": "I didn't doubt for a moment that it could work" },
        { "statementIndex": 12, "text": "can no longer make the product myself" },
        { "statementIndex": 0, "text": "my girlfriend left me" }
      ]
    },
    {
      "title": "",
      "content": "Angela Dawson is the inventor of the ‘Superduster’, a household tool. ‘I like things to be clean,’ she says. ‘Fingerprints on my table annoy me. That’s how I got the idea.’ She won a competition and used the prize money to develop a prototype. This is the first invention she has ever worked on, and she says her life has not changed at all as a result.",
      "evidence": [
        { "statementIndex": 6, "text": "Fingerprints on my table annoy me" },
        { "statementIndex": 7, "text": "used the prize money" },
        { "statementIndex": 8, "text": "not changed at all" },
        { "statementIndex": 11, "text": "first invention she has ever worked on" }
      ]
    }
  ],
  "statements": [
    { "text": "a decision to make their product without the help of other people?", "answer": "A" },
    { "text": "being surprised at the commercial success of their invention?", "answer": "A" },
    { "text": "how the experience of inventing something has changed their outlook on life?", "answer": "C" },
    { "text": "another person's positive reaction to their invention?", "answer": "C" },
    { "text": "reacting to personal irritation?", "answer": "D" },
    { "text": "not having made a lot of money from their invention to date?", "answer": "B" },
    { "text": "being convinced that their invention would work?", "answer": "C" },
    { "text": "using a prize to help with their invention?", "answer": "D" },
    { "text": "having no intention of changing their lifestyle?", "answer": "D" },
    { "text": "the things that they had to give up?", "answer": "" },
    { "text": "being let down by other people's decisions?", "answer": "B" },
    { "text": "their invention being the first one they had ever actually worked on?", "answer": "D" },
    { "text": "no longer being able to make their product on their own?", "answer": "C" }
  ]
}

