{
  "title": "Join the Class",
  "instructions": "You are going to read a newspaper article about four women who turned a hobby into a way of making a living. For questions 22–35, choose from the women (A–D). The women may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "It was Alison Bardfield’s artistic leaning which first led her to flower-arranging classes. Then, with the support of the course tutor, she went on to set up her own flower-arranging business, converting her garage into a workshop. Despite its success, it was too time-consuming for the money it made, so when she saw a notice in a London department store advertising for interior designers, she applied. They were looking for people from creative backgrounds with a feel for design, which was an extension of what I was doing in my spare time. ‘Flower-arranging gave me an eye for colour and patterns’, she explains. Alison later studied for a diploma in interior design, and has been holding home-decor classes. ‘I still go to exhibitions to keep up to date. It doesn’t earn a huge salary but it pays the bills.’",
      "evidence": [
        { "statementIndex": 1, "text": "doesn’t earn a huge salary" },
        { "statementIndex": 2, "text": "she saw a notice... advertising for interior designers" },
        { "statementIndex": 3, "text": "looking for people from creative backgrounds" },
        { "statementIndex": 4, "text": "set up her own flower-arranging business" },
        { "statementIndex": 10, "text": "I still go to exhibitions to keep up to date" },
        { "statementIndex": 11, "text": "diploma in interior design" }
      ]
    },
    {
      "title": "",
      "content": "I’ve always been arty and good at putting things together, but never imagined it as my career,’ says Brenda Ashdon. Her former landlady, who likes high-quality furniture in an antique style, recommended her to a couple of friends, and before long Brenda found herself making pieces for families and retailers. She gets ideas in magazines, and her workshop is full of bright colours for children’s pieces. Brenda works on commissions that range from small items to larger pieces, and her work has been featured in magazines. She did not need any formal qualifications for this line of work.",
      "evidence": [
        { "statementIndex": 6, "text": "gets ideas in magazines" },
        { "statementIndex": 8, "text": "for children’s pieces" },
        { "statementIndex": 7, "text": "making pieces for families and retailers" }
      ]
    },
    {
      "title": "",
      "content": "Cecilia Howlett is the daughter of a house builder and seems blessed with a natural feel for home-making through colour and design. Her first main job was decorating a neighbour’s house and from this she found more work through word of mouth. ‘It all grew by itself,’ she explains. ‘It was tough with two young children so I had to find something that not only fitted into that time but also brought in a steady income.’ She studied pottery and sold her work in a local shop in London and also South Africa before taking on larger orders. The courses are popular and already going well. The orders now come in from abroad and she often welcomes work from houses starting to refit.",
      "evidence": [
        { "statementIndex": 2, "text": "found more work through word of mouth" },
        { "statementIndex": 7, "text": "steady income" },
        { "statementIndex": 11, "text": "orders now come in from abroad" }
      ]
    },
    {
      "title": "",
      "content": "Back in 1995, when Debbie Easton bought an old furniture shop using her redundancy money, she enjoyed designing and restoring furniture. But she soon found that the business was not profitable enough, so she took a course in antiques restoration. She developed her skills further and now holds evening classes. Her new shop, on the other hand, is a huge success. Debbie still likes the relaxed approach to getting new information, visiting museums and exhibitions. Recently she started a photography class and is now using this new skill in her work.",
      "evidence": [
        { "statementIndex": 1, "text": "was not profitable enough" },
        { "statementIndex": 11, "text": "took a course in antiques restoration" },
        { "statementIndex": 12, "text": "relaxed approach" },
        { "statementIndex": 13, "text": "started a photography class" }
      ]
    }
  ],
  "statements": [
    { "text": "found one line of work was not profitable enough?", "answer": "D" },
    { "text": "responded to an advertisement for a course?", "answer": "A" },
    { "text": "found a lot of work through personal recommendations?", "answer": "A" },
    { "text": "has plans to set up her own company?", "answer": "A" },
    { "text": "enjoys the comments she receives while working?", "answer": "D" },
    { "text": "got ideas by looking in various publications?", "answer": "B" },
    { "text": "developed a skill out of financial necessity?", "answer": "C" },
    { "text": "regularly takes control of large-scale projects?", "answer": "B" },
    { "text": "likes to produce things for a specific age group?", "answer": "B" },
    { "text": "says she feels it's important to continue learning?", "answer": "A" },
    { "text": "has found an export market for her work?", "answer": "C" },
    { "text": "was required to get a qualification?", "answer": "D" },
    { "text": "took a relaxed approach to finding out about her subject?", "answer": "D" },
    { "text": "has recently developed a new skill?", "answer": "D" }
  ]
}

