{
  "title": "Mountain Walks",
  "instructions": "You are going to read reviews of five books that describe walking in the English Lake District. For questions 22-35, choose from the books (A–E). The books may be chosen more than once.",
  "texts": [
    {
      "title": "",
      "content": "This is a well-organised book of 30 walks with detailed route directions, each starting with a map, and some small colour photographs. The author, John Mitchell, gives accurate statistics with distances and the total height you climb—is this a first for this series, I wonder? If anything, the routes are over-detailed, with background information at the start and helpful pointers along the walk. The routes are designed to visit less-used walker routes, sometimes missing out the ever-popular central mountains, with most on the old favourite walks, the maps in the book are good enough to follow on the ground, which could be an irritation, but it does encourage the user. Overall, for most, this can be a big help when choosing the route.",
      "evidence": []
    },
    {
      "title": "",
      "content": "This book is written with the day tripper in mind, as every walk is circular, starting and finishing at a recommended parking area. In some cases, the author explains why parking is limited or awkward in the Lake District. The author explains that the walks take no more than half a day, so are ideal for the casual walker, and although a little large for the pocket, the book is easy to use, with large-scale (generally excellent) maps, with detailed gradient indications, as the feel of the ground is very important to the casual walker. The maps include parking places, picnic areas, pubs, and tearooms. Large-format maps and helpful photos make this book easy to use, and the background helps walkers enjoy their surroundings and countryside.",
      "evidence": []
    },
    {
      "title": "",
      "content": "The wealth of information in this book about the mountains reflects the 30 years that Paul Black, the writer, has spent in the area. True to the title, this is a circular tour of the Lake District in a single day, in a car. It is accepted that walkers need three to five stops, with walking between them, if the weather is good; and an alternative route, for this reason, is a low-level route, stressed that this high-level option is not possible afterwards if the weather is bad. The book also includes a number of colour photographs providing good views, and descriptions highlighting what you see from the route. Overall, this book is essential to get you back home again.",
      "evidence": []
    },
    {
      "title": "",
      "content": "This useful little pocket-sized book, although for the serious climber, is a pleasure to read. Even if you’ve never climbed a mountain in your life, the instructions are useful, as much as the layout in the comfort of your armchair. At the top of the page there are brief technical comments, and then the text explains the route in terms of length and time. You have a day’s work ahead of you, in need. Each mountain has three routes—one easy, one medium, one strenuous—highlighting the work needed. You don’t have to get there by bike, your competent travel information is provided for the non-driver.",
      "evidence": []
    },
    {
      "title": "",
      "content": "It is a little book. If I were a distance walker in the Lake District, or someone who wanted to visit all the best views, it would be my go-to. The book is written very carefully to follow its routes with a helpful map and appropriate directions. This is one of the few small books that does give the reader good views of the route. It gives factual information, with helpful notes and information for the inexperienced, and allows you to choose the best walking route. The factual notes help plan the day. It’s a book for anyone who wants to find out more about the Lake District.",
      "evidence": []
    }
  ],
  "statements": [
    { "text": "offers information on driving routes", "answer": "C" },
    { "text": "is only of use before starting the walk", "answer": "C" },
    { "text": "includes inadequate maps for walkers", "answer": "A" },
    { "text": "provides a map before the description of each walk", "answer": "A" },
    { "text": "is useful if you are not feeling full of energy", "answer": "D" },
    { "text": "is praised for its illustrations", "answer": "C" },
    { "text": "includes information for an experienced mountain walker", "answer": "D" },
    { "text": "gives help with accommodation", "answer": "E" },
    { "text": "is useful for those who want to drive to the starting point", "answer": "B" },
    { "text": "is criticised for the quantity of illustrations", "answer": "A" },
    { "text": "gives walkers information about the condition of the footpaths", "answer": "B" },
    { "text": "includes a choice of walking routes to take account of the climate", "answer": "C" },
    { "text": "is criticised for giving too much information", "answer": "A" },
    { "text": "contains material that is visually unattractive", "answer": "E" }
  ]
}

