{
  "samples": [
    {
      "id": 1,
      "topic": "Documentary",
      "steps": [
        {
          "text": "In my opinion, the documentary was absolutely fascinating.",
          "type": "opinion+topic"
        },
        {
          "text": "In my opinion, the documentary was absolutely fascinating. It explored topics I'd never considered before, from deep-sea creatures to ocean conservation.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "In my opinion, the documentary was absolutely fascinating. It explored topics I'd never considered before, from deep-sea creatures to ocean conservation. For instance, the episode about coral reefs showed how these ecosystems are connected to global climate.",
          "type": "opinion+topic+explain+example"
        },
        {
          "text": "In my opinion, the documentary was absolutely fascinating. It explored topics I'd never considered before, from deep-sea creatures to ocean conservation. For instance, the episode about coral reefs showed how these ecosystems are connected to global climate. As a result, I've completely changed my attitude toward single-use plastic.",
          "type": "full"
        }
      ]
    },
    {
      "id": 2,
      "topic": "Concert",
      "steps": [
        {
          "text": "I would definitely recommend this concert because it exceeded all my expectations.",
          "type": "opinion+topic"
        },
        {
          "text": "I would definitely recommend this concert because it exceeded all my expectations. The performance showcased the artist's incredible talent and stage presence.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "I would definitely recommend this concert because it exceeded all my expectations. The performance showcased the artist's incredible talent and stage presence. For example, when Ed Sheeran performed 'Photograph,' ninety thousand people sang along in perfect harmony.",
          "type": "opinion+topic+explain+example"
        },
        {
          "text": "I would definitely recommend this concert because it exceeded all my expectations. The performance showcased the artist's incredible talent and stage presence. For example, when Ed Sheeran performed 'Photograph,' ninety thousand people sang along in perfect harmony. Compared to other concerts I've attended, this felt incredibly intimate despite the huge venue.",
          "type": "full"
        }
      ]
    },
    {
      "id": 3,
      "topic": "Restaurant",
      "steps": [
        {
          "text": "Without a doubt, the restaurant's food was exceptional.",
          "type": "opinion+topic"
        },
        {
          "text": "Without a doubt, the restaurant's food was exceptional. Every dish demonstrated careful preparation and attention to detail.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "Without a doubt, the restaurant's food was exceptional. Every dish demonstrated careful preparation and attention to detail. The chef obviously has years of experience and genuine passion for Italian cuisine.",
          "type": "opinion+topic+explain+reason"
        },
        {
          "text": "Without a doubt, the restaurant's food was exceptional. Every dish demonstrated careful preparation and attention to detail. The chef obviously has years of experience and genuine passion for Italian cuisine. For instance, the seafood linguine had pasta so fresh it was like silk.",
          "type": "full"
        }
      ]
    },
    {
      "id": 4,
      "topic": "Surf Camp",
      "steps": [
        {
          "text": "From my experience, the surf camp was brilliantly organized.",
          "type": "opinion+topic"
        },
        {
          "text": "From my experience, the surf camp was brilliantly organized. Every aspect of the week was planned to maximize learning and enjoyment.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "From my experience, the surf camp was brilliantly organized. Every aspect of the week was planned to maximize learning and enjoyment. For example, morning lessons coincided with the best wave conditions.",
          "type": "opinion+topic+explain+example"
        },
        {
          "text": "From my experience, the surf camp was brilliantly organized. Every aspect of the week was planned to maximize learning and enjoyment. For example, morning lessons coincided with the best wave conditions. As a result, everyone in my group made visible progress throughout the week.",
          "type": "full"
        }
      ]
    },
    {
      "id": 5,
      "topic": "Guidebook",
      "steps": [
        {
          "text": "It's worth mentioning that the guidebook proved invaluable during my trip.",
          "type": "opinion+topic"
        },
        {
          "text": "It's worth mentioning that the guidebook proved invaluable during my trip. It contained practical information I couldn't find online.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "It's worth mentioning that the guidebook proved invaluable during my trip. It contained practical information I couldn't find online. Unlike websites full of sponsored content, this guidebook was genuinely independent.",
          "type": "opinion+topic+explain+reason"
        },
        {
          "text": "It's worth mentioning that the guidebook proved invaluable during my trip. It contained practical information I couldn't find online. Unlike websites full of sponsored content, this guidebook was genuinely independent. For instance, it recommended a tiny tapas bar in Seville that became my favorite meal.",
          "type": "full"
        }
      ]
    },
    {
      "id": 6,
      "topic": "Book",
      "steps": [
        {
          "text": "What struck me most was how the book completely changed my approach to productivity.",
          "type": "opinion+topic"
        },
        {
          "text": "What struck me most was how the book completely changed my approach to productivity. It presented practical strategies backed by scientific research.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "What struck me most was how the book completely changed my approach to productivity. It presented practical strategies backed by scientific research. The author explained exactly why certain habits form and how to change them.",
          "type": "opinion+topic+explain+reason"
        },
        {
          "text": "What struck me most was how the book completely changed my approach to productivity. It presented practical strategies backed by scientific research. The author explained exactly why certain habits form and how to change them. As a result, my study habits have improved dramatically.",
          "type": "full"
        }
      ]
    },
    {
      "id": 7,
      "topic": "App",
      "steps": [
        {
          "text": "To be honest, the app made language learning genuinely enjoyable.",
          "type": "opinion+topic"
        },
        {
          "text": "To be honest, the app made language learning genuinely enjoyable. It turned studying into something that felt more like playing a game.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "To be honest, the app made language learning genuinely enjoyable. It turned studying into something that felt more like playing a game. For instance, I could practice during my commute or while waiting for appointments.",
          "type": "opinion+topic+explain+example"
        },
        {
          "text": "To be honest, the app made language learning genuinely enjoyable. It turned studying into something that felt more like playing a game. For instance, I could practice during my commute or while waiting for appointments. Compared to traditional language classes, this was far more convenient.",
          "type": "full"
        }
      ]
    },
    {
      "id": 8,
      "topic": "Film",
      "steps": [
        {
          "text": "Personally, I found the film's main character behaved unexpectedly throughout.",
          "type": "opinion+topic"
        },
        {
          "text": "Personally, I found the film's main character behaved unexpectedly throughout. Rather than following typical age-related stereotypes, he challenged every assumption.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "Personally, I found the film's main character behaved unexpectedly throughout. Rather than following typical age-related stereotypes, he challenged every assumption. Robert De Niro brought dignity and warmth to what could have been a caricature.",
          "type": "opinion+topic+explain+reason"
        },
        {
          "text": "Personally, I found the film's main character behaved unexpectedly throughout. Rather than following typical age-related stereotypes, he challenged every assumption. Robert De Niro brought dignity and warmth to what could have been a caricature. As a result, I reconsidered my own ageist assumptions.",
          "type": "full"
        }
      ]
    },
    {
      "id": 9,
      "topic": "Game",
      "steps": [
        {
          "text": "Surprisingly, the game became surprisingly addictive.",
          "type": "opinion+topic"
        },
        {
          "text": "Surprisingly, the game became surprisingly addictive. Simple mechanics hid remarkable depth and endless possibilities.",
          "type": "opinion+topic+explain"
        },
        {
          "text": "Surprisingly, the game became surprisingly addictive. Simple mechanics hid remarkable depth and endless possibilities. The freedom to play at your own pace without pressure was refreshing.",
          "type": "opinion+topic+explain+reason"
        },
        {
          "text": "Surprisingly, the game became surprisingly addictive. Simple mechanics hid remarkable depth and endless possibilities. The freedom to play at your own pace without pressure was refreshing. However, some people might find the slow pace boring initially.",
          "type": "full"
        }
      ]
    }
  ]
}
