[
  {
    "id": "work-situations",
    "question": "Compare the two photographs and say what might be difficult for the people in these situations.",
    "photo1": {
      "id": "office-meeting",
      "title": "Office Meeting",
      "image": "https://images.unsplash.com/photo-1542744173-8e7e53415bb0?w=800"
    },
    "photo2": {
      "id": "coffee-shop-work",
      "title": "Working in Café",
      "image": "https://images.unsplash.com/photo-1554118811-1e0d58224f24?w=800"
    },
    "model_comparison": [
      {
        "step": "similarities",
        "text": "Both photographs show people in working environments. In the first photo, we can see a formal office meeting with colleagues gathered around a conference table, while in the second image, there's someone working in what appears to be a café or coffee shop. In both situations, people seem to be focused on their tasks.",
        "vocabulary": [
          { "phrase": "Both photographs show", "usage": "Starting comparison" },
          { "phrase": "while in the second", "usage": "Contrasting images" },
          { "phrase": "In both situations", "usage": "Finding commonality" }
        ]
      },
      {
        "step": "differences",
        "text": "However, there are significant differences between these working environments. The office meeting looks quite formal and structured, whereas the café setting appears much more casual and independent. The first situation involves collaboration and teamwork, while the second shows someone working alone in a public space.",
        "vocabulary": [
          { "phrase": "However, there are", "usage": "Introducing contrast" },
          { "phrase": "whereas", "usage": "Showing difference" },
          { "phrase": "while the second", "usage": "Comparing contrast" }
        ]
      },
      {
        "step": "answer_question",
        "text": "Regarding what might be difficult, I'd say that in the office meeting, the challenge could be managing different opinions and reaching consensus as a group. There might also be pressure to perform in front of colleagues. In the café situation, the main difficulty would probably be the distractions - background noise, people moving around, and the general lack of privacy. It might also be hard to stay motivated without the structure of an office environment.",
        "vocabulary": [
          { "phrase": "Regarding what might be", "usage": "Addressing question" },
          { "phrase": "I'd say that", "usage": "Giving opinion" },
          { "phrase": "would probably be", "usage": "Speculation" },
          { "phrase": "It might also be", "usage": "Additional point" }
        ]
      }
    ]
  },
  {
    "id": "outdoor-activities",
    "question": "Compare the two photographs and say why the people might have decided to spend their time in these ways.",
    "photo1": {
      "id": "beach-sunset",
      "title": "Beach at Sunset",
      "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800"
    },
    "photo2": {
      "id": "mountain-hiking",
      "title": "Mountain Hiking",
      "image": "https://images.unsplash.com/photo-1551632811-561732d1e306?w=800"
    },
    "model_comparison": [
      {
        "step": "similarities",
        "text": "Both photographs show people enjoying outdoor activities in natural settings. The first image captures a stunning tropical beach scene, while the second shows someone hiking in the mountains. In both cases, people have chosen to spend time in beautiful, peaceful natural environments away from urban areas.",
        "vocabulary": [
          { "phrase": "Both photographs show", "usage": "Opening comparison" },
          { "phrase": "while the second shows", "usage": "Contrasting element" },
          { "phrase": "In both cases", "usage": "Common feature" }
        ]
      },
      {
        "step": "differences",
        "text": "The main difference is the type of nature experience. The beach setting offers relaxation and tranquility - it's the kind of place where you'd go to unwind completely. On the other hand, the mountain hiking scenario is much more active and challenging, requiring physical effort and stamina. The beach seems accessible and comfortable, whereas the mountain requires preparation and determination.",
        "vocabulary": [
          { "phrase": "The main difference is", "usage": "Key contrast" },
          { "phrase": "On the other hand", "usage": "Showing contrast" },
          { "phrase": "whereas", "usage": "Direct comparison" }
        ]
      },
      {
        "step": "answer_question",
        "text": "As for why people chose these activities, I imagine the beach-goers wanted to escape stress and simply relax in a warm, beautiful location. They probably needed a break from their busy lives and wanted somewhere peaceful. The mountain hiker, however, likely chose this activity for the challenge and sense of achievement. Some people prefer active holidays where they can push themselves physically and mentally. The incredible views from high altitude would also be a major motivation - it's the kind of experience that makes you feel really alive.",
        "vocabulary": [
          { "phrase": "As for why", "usage": "Answering the question" },
          { "phrase": "I imagine", "usage": "Speculation" },
          { "phrase": "however, likely chose", "usage": "Contrasting motivation" },
          { "phrase": "would also be", "usage": "Additional reason" }
        ]
      }
    ]
  },
  {
    "id": "learning-situations",
    "question": "Compare the two photographs and say what the people might be learning from these experiences.",
    "photo1": {
      "id": "students-library",
      "title": "Students Studying",
      "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800"
    },
    "photo2": {
      "id": "family-home",
      "title": "Family at Home",
      "image": "https://images.unsplash.com/photo-1476703993599-0035a21b17a9?w=800"
    },
    "model_comparison": [
      {
        "step": "similarities",
        "text": "Both photographs show learning situations, though they're quite different in nature. The first image shows university students collaborating on academic work in a library, while the second depicts a parent with young children at home using a tablet. In both cases, people are engaged with technology and focused on some form of educational activity.",
        "vocabulary": [
          { "phrase": "Both photographs show", "usage": "Starting comparison" },
          { "phrase": "though they're quite different", "usage": "Acknowledging contrast" },
          { "phrase": "In both cases", "usage": "Commonality" }
        ]
      },
      {
        "step": "differences",
        "text": "The key difference lies in the type and purpose of learning. The students appear to be working on formal academic subjects, probably preparing for exams or completing assignments. This is structured, goal-oriented learning. In contrast, the children at home seem to be learning through play or educational apps, which is much more informal and age-appropriate. The university students are learning independently, whereas the young children need parental guidance.",
        "vocabulary": [
          { "phrase": "The key difference lies in", "usage": "Main contrast" },
          { "phrase": "In contrast", "usage": "Showing difference" },
          { "phrase": "whereas", "usage": "Direct comparison" }
        ]
      },
      {
        "step": "answer_question",
        "text": "Regarding what they're learning, the university students are obviously developing academic knowledge in their field of study. But beyond that, they're probably also learning valuable skills like teamwork, time management, and how to explain complex ideas to others. The young children, on the other hand, might be learning basic skills like numbers, colors, or language through interactive games. They're also learning important things like how to concentrate and follow instructions. Additionally, they're experiencing quality time with their parent, which teaches them about family relationships and security.",
        "vocabulary": [
          { "phrase": "Regarding what they're learning", "usage": "Addressing question" },
          { "phrase": "But beyond that", "usage": "Going deeper" },
          { "phrase": "on the other hand", "usage": "Contrasting group" },
          { "phrase": "Additionally", "usage": "Adding point" }
        ]
      }
    ]
  },
  {
    "id": "social-situations",
    "question": "Compare the two photographs and say how the people might be feeling in these situations.",
    "photo1": {
      "id": "city-night",
      "title": "City at Night",
      "image": "https://images.unsplash.com/photo-1514565131-fce0801e5785?w=800"
    },
    "photo2": {
      "id": "students-library",
      "title": "Students Studying",
      "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800"
    },
    "model_comparison": [
      {
        "step": "similarities",
        "text": "Both photographs show people in social settings surrounded by others. The first image captures a crowded city street at night with many pedestrians, while the second shows students working together in what looks like a library or study space. In both situations, people are sharing physical spaces with others.",
        "vocabulary": [
          { "phrase": "Both photographs show", "usage": "Opening" },
          { "phrase": "while the second shows", "usage": "Contrasting image" },
          { "phrase": "In both situations", "usage": "Common element" }
        ]
      },
      {
        "step": "differences",
        "text": "However, the nature of these social interactions is completely different. The city street scene shows anonymous crowds where people don't necessarily know each other - it's a public, impersonal environment. In contrast, the students are clearly working together as a group, collaborating and communicating directly with people they know. The urban setting is about individual movement through shared space, whereas the study group is about genuine collaboration.",
        "vocabulary": [
          { "phrase": "However, the nature", "usage": "Introducing contrast" },
          { "phrase": "In contrast", "usage": "Showing difference" },
          { "phrase": "whereas", "usage": "Direct comparison" }
        ]
      },
      {
        "step": "answer_question",
        "text": "In terms of how people might be feeling, those in the busy city street could be experiencing mixed emotions. Some might feel energized by the vibrant atmosphere and bright lights, while others could feel overwhelmed or even isolated despite being surrounded by so many people. There's probably a sense of purpose - people heading somewhere specific. The students, on the other hand, likely feel a combination of stress about their work but also comfort from having supportive friends around them. Group study can reduce anxiety because you're not alone in your challenges. They might also feel motivated and focused, especially if they're working toward a shared goal.",
        "vocabulary": [
          { "phrase": "In terms of", "usage": "Addressing question" },
          { "phrase": "could be experiencing", "usage": "Speculation" },
          { "phrase": "on the other hand", "usage": "Contrasting feeling" },
          { "phrase": "might also feel", "usage": "Additional emotion" }
        ]
      }
    ]
  }
]
