[
  {
    "id": "work-situations",
    "question": "Compare the two photographs and say what might be difficult for the people in these situations.",
    "photo1": {
      "id": "office-meeting",
      "title": "Office Meeting",
      "image": "https://images.unsplash.com/photo-1542744173-8e7e53415bb0?w=800"
    },
    "photo2": {
      "id": "coffee-shop-work",
      "title": "Working in Café",
      "image": "https://images.unsplash.com/photo-1554118811-1e0d58224f24?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people working. In the first one, there's a meeting in an office with people sitting around a table. In the second photo, someone is working in a café. In both situations, people are trying to get work done.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Starting comparison", "alternatives": [
              { "level": "Alternative 1", "phrase": "These two pictures both show", "usage": "Slight variation" },
              { "level": "Alternative 2", "phrase": "What we can see in both images is", "usage": "More sophisticated opening" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But there are some big differences. The office looks really formal - everyone's in a proper meeting. But the café is much more relaxed and casual. Also, in the office they're working as a team, while in the café the person is on their own.",
          "vocabulary": [
            { "phrase": "But there are some big differences", "usage": "Introducing contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, they're quite different", "usage": "Softer transition" },
              { "level": "Alternative 2", "phrase": "The main difference is", "usage": "Direct contrast" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "So what might be difficult? Well, in the office meeting, I think the hard part is probably dealing with different opinions. Everyone has their own ideas and you have to agree on something. Plus, you might feel nervous speaking in front of your colleagues. In the café, the main problem would be all the noise and people walking around. It's really hard to concentrate when there's so much going on. Also, you don't have anyone to help you if you get stuck.",
          "vocabulary": [
            { "phrase": "I think the hard part is probably", "usage": "Speculation", "alternatives": [
              { "level": "Alternative 1", "phrase": "I'd say the challenge is", "usage": "Confident opinion" },
              { "level": "Alternative 2", "phrase": "The difficulty would likely be", "usage": "Formal speculation" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two images both show people in working environments. The first photograph shows a formal office meeting with colleagues gathered around a conference table. In the second image, someone is working independently in what appears to be a café. What they share is that both situations involve people focused on completing tasks.",
          "vocabulary": [
            { "phrase": "These two images both show", "usage": "Starting comparison", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simpler opening" },
              { "level": "Alternative 2", "phrase": "Both photographs illustrate", "usage": "More formal" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, there are significant differences between these working environments. The office meeting appears quite formal and structured, whereas the café setting is considerably more casual. The first situation involves collaboration and teamwork, by contrast the second shows someone working alone in a public space.",
          "vocabulary": [
            { "phrase": "However, there are significant differences", "usage": "Introducing contrast", "alternatives": [
              { "level": "Base", "phrase": "But there are some big differences", "usage": "Natural style" },
              { "level": "Alternative 2", "phrase": "Having said that, what distinguishes them is", "usage": "Sophisticated" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the difficulties, I'd say that in the office meeting, the challenge is likely managing different opinions and reaching consensus. There might also be pressure to perform effectively in front of colleagues. In the café situation, the main difficulty would probably be the distractions - background noise, people moving around, and the lack of privacy. Additionally, without colleagues present, there's no immediate support if problems arise.",
          "vocabulary": [
            { "phrase": "I'd say that", "usage": "Giving opinion", "alternatives": [
              { "level": "Base", "phrase": "I think", "usage": "Simple opinion" },
              { "level": "Alternative 2", "phrase": "One could reasonably infer", "usage": "Formal analysis" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs illustrate professional work scenarios. The first image depicts a formal corporate meeting with multiple participants engaged in collaborative discussion. The second portrays an individual working independently in a café environment. What unites these images is the common theme of professional task completion in distinct settings.",
          "vocabulary": [
            { "phrase": "Both photographs illustrate", "usage": "Starting comparison", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Natural opening" },
              { "level": "Alternative 1", "phrase": "These two images both show", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "Notwithstanding these similarities, fundamental distinctions exist. The office environment represents a structured, collaborative setting with clear professional protocols. Conversely, the café scenario embodies independent work in a less formal context. Where they diverge significantly is in the social dynamic - the former requires group interaction and consensus-building, whereas the latter involves solitary focus.",
          "vocabulary": [
            { "phrase": "Notwithstanding these similarities", "usage": "Conceding similarity", "alternatives": [
              { "level": "Base", "phrase": "But there are differences", "usage": "Simple contrast" },
              { "level": "Alternative 1", "phrase": "However, there are significant differences", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the potential challenges, one could reasonably infer that the office scenario presents interpersonal complexities - navigating divergent viewpoints and achieving collective agreement. The presence of colleagues may also generate performance anxiety. In the café setting, environmental factors likely pose difficulties - ambient noise, movement, and the absence of a contained workspace. Furthermore, the lack of immediate collegial support could prove challenging when obstacles emerge.",
          "vocabulary": [
            { "phrase": "one could reasonably infer", "usage": "Formal speculation", "alternatives": [
              { "level": "Base", "phrase": "I think", "usage": "Simple guess" },
              { "level": "Alternative 1", "phrase": "I'd say that", "usage": "Confident opinion" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "outdoor-activities",
    "question": "Compare the two photographs and say why the people might have decided to spend their time in these ways.",
    "photo1": {
      "id": "beach-sunset",
      "title": "Beach at Sunset",
      "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800"
    },
    "photo2": {
      "id": "mountain-hiking",
      "title": "Mountain Hiking",
      "image": "https://images.unsplash.com/photo-1551632811-561732d1e306?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people enjoying nature. The first picture is of a beautiful beach, and the second one shows someone hiking in the mountains. In both cases, people have chosen to spend time outside in really nice places.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening comparison", "alternatives": [
              { "level": "Alternative 1", "phrase": "These images both present", "usage": "Slight variation" },
              { "level": "Alternative 2", "phrase": "What's evident in both is", "usage": "Observation-based" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But they're very different activities. The beach is all about relaxing - you just sit there and chill out. The mountain hiking is completely different - it's active and you need to be quite fit. The beach is easy to get to, but going up a mountain needs proper planning.",
          "vocabulary": [
            { "phrase": "But they're very different", "usage": "Showing contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, the activities differ significantly", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "The fundamental distinction lies in", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "So why did they choose these activities? I think the people at the beach probably wanted to escape from their busy lives and just relax. Maybe they were feeling stressed and needed somewhere quiet and peaceful. The mountain hiker is different - they probably chose this because they like a challenge. Some people prefer doing something active where they push themselves. Plus, the views from the top of a mountain are amazing - that's a pretty good reason to climb up there!",
          "vocabulary": [
            { "phrase": "I think the people", "usage": "Speculation", "alternatives": [
              { "level": "Alternative 1", "phrase": "I would imagine", "usage": "Thoughtful guess" },
              { "level": "Alternative 2", "phrase": "One could reasonably infer", "usage": "Formal" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both present people engaging with natural environments. The first depicts a stunning beach setting, while the latter shows someone hiking through mountainous terrain. What unites them is that both individuals have opted to spend time outdoors in scenic locations.",
          "vocabulary": [
            { "phrase": "These images both present", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Both photographs capture", "usage": "Sophisticated" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, the activities differ significantly. The beach experience centers on relaxation and passive enjoyment. In comparison, mountain hiking represents an active pursuit requiring physical fitness and stamina. Additionally, beach access is typically straightforward, whereas mountain expeditions necessitate careful preparation.",
          "vocabulary": [
            { "phrase": "the activities differ significantly", "usage": "Contrast", "alternatives": [
              { "level": "Base", "phrase": "they're very different", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "the activities are fundamentally distinct", "usage": "Formal" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for their motivations, I would imagine the beach-goers sought to alleviate stress through peaceful surroundings. They likely needed respite from demanding schedules. By contrast, the mountain hiker probably chose this activity for the physical and mental challenge it provides. Some individuals prefer active pursuits that test their capabilities. Additionally, the spectacular vistas from elevated positions constitute a compelling motivation.",
          "vocabulary": [
            { "phrase": "I would imagine", "usage": "Speculation", "alternatives": [
              { "level": "Base", "phrase": "I think", "usage": "Simple guess" },
              { "level": "Alternative 2", "phrase": "One might reasonably speculate", "usage": "Academic" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs capture individuals immersed in natural settings. The first portrays a pristine coastal environment, while the second depicts a mountainous landscape traversed by a solitary hiker. The unifying element is the deliberate choice to engage with nature in its unmediated form.",
          "vocabulary": [
            { "phrase": "Both photographs capture", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "These images both present", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The fundamental distinction lies in the nature of engagement. The beach scenario embodies passive recreation and contemplative repose. Conversely, the mountaineering endeavor represents an active challenge demanding considerable physical exertion and mental fortitude. Furthermore, accessibility considerations differ substantially - coastal areas typically afford easy access, whereas alpine environments necessitate thorough logistical preparation.",
          "vocabulary": [
            { "phrase": "The fundamental distinction lies in", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "The main difference is", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "The key difference concerns", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding motivations, one might reasonably speculate that the beach visitors sought psychological restoration through tranquil immersion in a calming environment. Their decision presumably stems from accumulated stress requiring mitigation. In stark contrast, the mountaineer's motivation likely centers on the pursuit of physical achievement and the psychological rewards of overcoming adversity. Certain personality types gravitate toward challenges that test their limits. Moreover, the exceptional panoramic views attainable at altitude constitute a significant incentive for the arduous ascent.",
          "vocabulary": [
            { "phrase": "one might reasonably speculate", "usage": "Formal speculation", "alternatives": [
              { "level": "Base", "phrase": "I think", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "I would imagine", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "learning-situations",
    "question": "Compare the two photographs and say what the people might be learning from these experiences.",
    "photo1": {
      "id": "students-library",
      "title": "Students Studying",
      "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800"
    },
    "photo2": {
      "id": "family-home",
      "title": "Family at Home",
      "image": "https://images.unsplash.com/photo-1476703993599-0035a21b17a9?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both pictures show people learning something, but in different ways. In the first photo, there are university students studying together in a library. In the second one, there's a parent at home with young children using a tablet. They're all focused on learning.",
          "vocabulary": [
            { "phrase": "Both pictures show", "usage": "Starting comparison", "alternatives": [
              { "level": "Alternative 1", "phrase": "These images both illustrate", "usage": "Formal opening" },
              { "level": "Alternative 2", "phrase": "What we observe in both photos is", "usage": "Analytical start" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The big difference is what kind of learning it is. The students are doing serious study - probably for exams or assignments. It's formal and organized. But the children at home are learning through games and fun activities. It's much more relaxed. Also, the students work together as a group, but the little kids need their parent to help them.",
          "vocabulary": [
            { "phrase": "The big difference is", "usage": "Main contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "What sets them apart is", "usage": "Clear distinction" },
              { "level": "Alternative 2", "phrase": "The key distinction concerns", "usage": "Academic precision" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "So what are they learning? The university students are obviously learning their subjects - history, science, whatever they're studying. But they're also learning how to work with other people and how to manage their time. The young children are probably learning basic things like numbers, colors, or new words. They're also learning important skills like how to pay attention and follow instructions. And spending time with their parent teaches them they're loved and safe.",
          "vocabulary": [
            { "phrase": "So what are they learning?", "usage": "Addressing question", "alternatives": [
              { "level": "Alternative 1", "phrase": "As for the learning outcomes", "usage": "Formal framing" },
              { "level": "Alternative 2", "phrase": "Regarding what they gain", "usage": "Academic approach" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both illustrate learning scenarios in contrasting environments. The first shows university students engaged in collaborative study within a library setting. The second depicts a parent guiding young children through educational activities at home using digital technology. What unites them is the common focus on knowledge acquisition.",
          "vocabulary": [
            { "phrase": "These images both illustrate", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both pictures show", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "What both photographs present is", "usage": "Formal" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "What sets them apart is the nature and context of learning. The university environment involves structured academic study, likely in preparation for assessments. By comparison, the home scenario represents informal, play-based learning appropriate for early childhood development. Additionally, the students operate as an independent peer group, whereas the young children require direct parental guidance.",
          "vocabulary": [
            { "phrase": "What sets them apart", "usage": "Introducing difference", "alternatives": [
              { "level": "Base", "phrase": "The big difference is", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "The fundamental distinction lies in", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the learning outcomes, the university students are clearly developing subject-specific knowledge in their academic disciplines. Beyond content, they're acquiring collaborative skills and time management abilities essential for higher education. The young children, on the other hand, are building foundational competencies - basic literacy, numeracy, and cognitive skills. Perhaps more importantly, they're developing concentration, following instructions, and experiencing secure attachment through quality time with their caregiver.",
          "vocabulary": [
            { "phrase": "As for the learning outcomes", "usage": "Addressing topic", "alternatives": [
              { "level": "Base", "phrase": "So what are they learning?", "usage": "Direct question" },
              { "level": "Alternative 2", "phrase": "With respect to educational gains", "usage": "Formal" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs present educational contexts, albeit at vastly different developmental stages. The first depicts tertiary-level students engaged in academic collaboration within an institutional learning environment. The second portrays early childhood education facilitated by a parent in a domestic setting utilizing educational technology. The unifying thread is the intentional pursuit of knowledge and skill development.",
          "vocabulary": [
            { "phrase": "Both photographs present", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both pictures show", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "These images both illustrate", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The fundamental distinction lies in the pedagogical approach and cognitive complexity. The university scenario embodies formal, discipline-specific academic instruction preparing students for professional competence. Conversely, the home environment exemplifies informal, developmentally-appropriate learning through play and exploration. Furthermore, the tertiary students demonstrate autonomous collaborative learning, whereas the preschool children require scaffolded instruction from an adult facilitator.",
          "vocabulary": [
            { "phrase": "The fundamental distinction lies in", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "The big difference is", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "What sets them apart is", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "With respect to educational gains, the university cohort is acquiring specialized disciplinary knowledge alongside metacognitive skills - critical thinking, academic collaboration, and autonomous learning strategies. These competencies constitute preparation for professional roles. The young children, conversely, are developing foundational cognitive architecture - pre-literacy skills, basic numeracy, and executive function. Beyond academic content, they're internalizing attachment security and social-emotional competence through responsive caregiving interactions.",
          "vocabulary": [
            { "phrase": "With respect to educational gains", "usage": "Topic introduction", "alternatives": [
              { "level": "Base", "phrase": "So what are they learning?", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "As for the learning outcomes", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "social-situations",
    "question": "Compare the two photographs and say how the people might be feeling in these situations.",
    "photo1": {
      "id": "city-night",
      "title": "City at Night",
      "image": "https://images.unsplash.com/photo-1514565131-fce0801e5785?w=800"
    },
    "photo2": {
      "id": "study-group",
      "title": "Study Group",
      "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people in places with lots of other people around. The first one shows a busy city street at night with crowds everywhere. The second photo shows students working together in a library. In both situations, people are sharing the same space.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening", "alternatives": [
              { "level": "Alternative 1", "phrase": "These two images depict", "usage": "Formal opening" },
              { "level": "Alternative 2", "phrase": "What's evident in both is", "usage": "Observation-based start" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But the social situations are totally different. In the city, nobody really knows each other - it's just random people walking past. It's quite impersonal. But the students are clearly friends working together. They're talking and helping each other. The city is about being alone even though you're with people, but the library is about real connection.",
          "vocabulary": [
            { "phrase": "But the social situations are totally different", "usage": "Introducing contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, the nature of interaction differs", "usage": "Formal transition" },
              { "level": "Alternative 2", "phrase": "The essence of social engagement varies fundamentally", "usage": "Academic style" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "How might people be feeling? In the busy city, I think it's mixed. Some people probably feel excited by all the lights and energy. But others might feel overwhelmed or even lonely even though there are so many people around. Everyone's just going somewhere and not really connecting. The students probably feel quite different - maybe a bit stressed about their work, but they also feel supported because they have friends there. Studying in a group makes you feel less alone when things are difficult.",
          "vocabulary": [
            { "phrase": "I think it's mixed", "usage": "Speculation", "alternatives": [
              { "level": "Alternative 1", "phrase": "I'd say there are varied emotions", "usage": "Thoughtful assessment" },
              { "level": "Alternative 2", "phrase": "The feelings are likely complex", "usage": "Sophisticated analysis" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two images depict people in shared social spaces, though the contexts differ markedly. The first presents an urban nightscape with numerous pedestrians navigating a busy street. The second shows a collaborative study session with students gathered around a table. Both scenarios involve proximity to others in a communal environment.",
          "vocabulary": [
            { "phrase": "These two images depict", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Both photographs capture", "usage": "Sophisticated" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, the nature of social interaction differs considerably. The urban setting represents anonymous coexistence - individuals sharing physical space without meaningful connection. In contrast, the study group embodies intentional collaboration and mutual support among peers with established relationships. The former exemplifies isolation within crowds, whilst the latter demonstrates genuine social cohesion.",
          "vocabulary": [
            { "phrase": "However, the nature of interaction differs", "usage": "Contrast", "alternatives": [
              { "level": "Base", "phrase": "But the social situations are totally different", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "The fundamental character of engagement diverges", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for their emotional states, I'd say there are varied emotions in the urban scene. Some individuals likely experience stimulation from the vibrant atmosphere, whilst others may feel overwhelmed by sensory input or experience loneliness despite the crowd. The transient nature precludes meaningful connection. The study group, conversely, probably experiences a mixture of academic pressure and social support. The collaborative environment provides emotional reassurance during challenging intellectual work.",
          "vocabulary": [
            { "phrase": "I'd say there are varied emotions", "usage": "Analyzing feelings", "alternatives": [
              { "level": "Base", "phrase": "I think it's mixed", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "The emotional landscape is multifaceted", "usage": "Sophisticated" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs capture human beings in populated environments, though the social dynamics differ profoundly. The first presents an urban thoroughfare teeming with anonymous pedestrians navigating nocturnal city life. The second depicts an intimate academic collaboration among peers in a structured learning environment. The commonality resides in the shared physical proximity to others.",
          "vocabulary": [
            { "phrase": "Both photographs capture", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "These two images depict", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The fundamental distinction concerns the quality and intentionality of social engagement. The metropolitan scenario exemplifies what sociologists term 'social atomization' - physical proximity devoid of interpersonal connection or shared purpose. Conversely, the academic setting embodies purposeful collaboration characterized by reciprocal support and shared goals. The former represents transient anonymity, whereas the latter demonstrates sustained relational bonding.",
          "vocabulary": [
            { "phrase": "The fundamental distinction concerns", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "The main difference is", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "What primarily differs is", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding emotional states, the urban environment likely elicits diverse responses - some individuals may experience urban vitality as energizing, whilst others perceive it as alienating or anxiety-inducing. The paradox of urban loneliness amidst crowds reflects the absence of authentic connection. The academic cohort, by contrast, experiences a complex emotional admixture - academic stress tempered by social support and collective efficacy. The collaborative framework provides psychological buffering against performance anxiety through shared endeavor.",
          "vocabulary": [
            { "phrase": "Regarding emotional states", "usage": "Topic introduction", "alternatives": [
              { "level": "Base", "phrase": "How might people be feeling?", "usage": "Direct question" },
              { "level": "Alternative 1", "phrase": "As for their feelings", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "entertainment-choices",
    "question": "Compare the two photographs and say why the people might have chosen to spend their time in these ways.",
    "photo1": {
      "id": "cinema",
      "title": "Cinema",
      "image": "https://images.unsplash.com/photo-1489599849927-2ee91cede3ba?w=800"
    },
    "photo2": {
      "id": "board-games",
      "title": "Board Games",
      "image": "https://images.unsplash.com/photo-1610890716171-6b1bb98ffd09?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people having fun and relaxing. In the first one, people are watching a movie at the cinema. In the second picture, a family is playing board games at home. In both cases, people are choosing entertainment to enjoy their free time.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening", "alternatives": [
              { "level": "Alternative 1", "phrase": "These images both show", "usage": "Slight variation" },
              { "level": "Alternative 2", "phrase": "Both photographs depict", "usage": "Formal opening" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But they're quite different types of entertainment. The cinema is a public place where you watch something that's been made for you. You're passive - you just sit and watch. Board games at home are totally different - you're active and you have to think and make decisions. Also, at the cinema you're with strangers, while board games are usually with family or close friends.",
          "vocabulary": [
            { "phrase": "But they're quite different", "usage": "Introducing contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, they represent distinct forms", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "The modes of engagement differ fundamentally", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "So why might they have chosen these? I think people go to the cinema because they want to escape into a story and forget about their own lives for a couple of hours. The big screen and sound system make it really immersive. It's a special experience you can't get at home. The family playing board games probably chose this because they wanted to spend quality time together. Board games make you interact and talk with each other. Plus it's much cheaper than going out, and you can pause whenever you want.",
          "vocabulary": [
            { "phrase": "I think people go", "usage": "Speculation about motivation", "alternatives": [
              { "level": "Alternative 1", "phrase": "People likely choose the cinema", "usage": "More confident" },
              { "level": "Alternative 2", "phrase": "Cinema attendance presumably stems from", "usage": "Formal analysis" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both show people engaged in leisure activities during their free time. The first depicts cinema-goers experiencing a film in a public venue. The second portrays a family enjoying board games in their home environment. What they share is the common purpose of entertainment and recreation.",
          "vocabulary": [
            { "phrase": "These images both show", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Both photographs illustrate", "usage": "Formal" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, they represent distinct forms of entertainment. The cinema experience is characterized by passive consumption of professional media in a public setting among strangers. By comparison, board gaming involves active participation and strategic thinking in an intimate domestic environment. The former provides visual spectacle, whilst the latter emphasizes social interaction and mental engagement.",
          "vocabulary": [
            { "phrase": "However, they represent distinct forms", "usage": "Showing contrast", "alternatives": [
              { "level": "Base", "phrase": "But they're quite different", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "The fundamental nature of engagement diverges", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for their motivations, cinema-goers likely seek immersive escapism through high-quality audiovisual storytelling unavailable at home. The theatrical experience offers temporary disconnection from daily concerns. The family choosing board games, on the other hand, probably prioritizes meaningful face-to-face interaction and relationship building. This option offers flexibility, economy, and genuine connection through shared activity.",
          "vocabulary": [
            { "phrase": "As for their motivations", "usage": "Addressing question", "alternatives": [
              { "level": "Base", "phrase": "So why might they have chosen these?", "usage": "Direct" },
              { "level": "Alternative 2", "phrase": "Regarding the rationale for these choices", "usage": "Formal" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs illustrate recreational pursuits undertaken during leisure hours. The first captures the cinema-going experience - passive consumption of cinematic media within a commercial entertainment venue. The second portrays domestic board gaming - interactive play within the familial sphere. The commonality resides in the intentional allocation of discretionary time toward pleasurable activities.",
          "vocabulary": [
            { "phrase": "Both photographs illustrate", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "These images both show", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The fundamental nature of engagement diverges considerably. The cinematic experience constitutes passive spectatorship - recipients consume professionally-produced narrative content in a darkened auditorium alongside anonymous others. Conversely, board gaming embodies active participation requiring strategic cognition, decision-making, and interpersonal negotiation within an intimate relational context. The former emphasizes sensory immersion, whereas the latter prioritizes social interaction and cognitive engagement.",
          "vocabulary": [
            { "phrase": "The fundamental nature of engagement diverges", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "They're quite different", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "They represent distinct forms", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the rationale for these choices, cinema attendance presumably stems from desires for narrative transportation and aesthetic experience unattainable through domestic media consumption. The theatrical environment provides technological immersion and temporary psychological escape from quotidian concerns. The familial board gaming selection, conversely, likely reflects prioritization of relational capital - strengthening interpersonal bonds through collaborative play. This modality offers economic efficiency, temporal flexibility, and authentic social connection absent from commercialized entertainment venues.",
          "vocabulary": [
            { "phrase": "Regarding the rationale for these choices", "usage": "Topic introduction", "alternatives": [
              { "level": "Base", "phrase": "So why might they choose these?", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "As for their motivations", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "shopping-experiences",
    "question": "Compare the two photographs and say what might be enjoyable or frustrating about shopping in these places.",
    "photo1": {
      "id": "shopping-mall",
      "title": "Shopping Mall",
      "image": "https://images.unsplash.com/photo-1519197924294-4ba991a11128?w=800"
    },
    "photo2": {
      "id": "local-market",
      "title": "Local Market",
      "image": "https://images.unsplash.com/photo-1555939594-58d7cb561ad1?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show places where people go shopping. The first one is a big modern shopping mall with lots of stores. The second picture shows a local market with individual stalls. In both situations, people are buying things they need or want.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening", "alternatives": [
              { "level": "Alternative 1", "phrase": "These images both depict", "usage": "Formal" },
              { "level": "Alternative 2", "phrase": "Both photographs present", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But the shopping experiences are completely different. The mall is modern, clean, and organized with big chain stores. Everything has a fixed price and you can use your card. The market is much more traditional and authentic. It looks a bit messy and chaotic, with fresh produce and small vendors. You probably need cash and might have to bargain over prices.",
          "vocabulary": [
            { "phrase": "But the shopping experiences are completely different", "usage": "Main contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, these retail environments differ significantly", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "The commercial contexts diverge fundamentally", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "What might be enjoyable or frustrating? In the mall, the good thing is it's convenient - everything's in one place, it's air-conditioned, and it's easy to find what you want. But it can feel impersonal and crowded, plus everything is quite expensive. At the market, the enjoyable part is the atmosphere - it's lively and you get fresh, local products. You can talk to the vendors and get a better deal. But it might be frustrating if it's too hot, crowded, or if you don't speak the language well enough to negotiate.",
          "vocabulary": [
            { "phrase": "the good thing is", "usage": "Identifying positive", "alternatives": [
              { "level": "Alternative 1", "phrase": "the advantage is", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "the merit lies in", "usage": "Academic" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both depict commercial spaces where consumers engage in retail transactions. The first presents a contemporary shopping mall characterized by corporate retailers and modern infrastructure. The second portrays a traditional market featuring independent vendors and fresh produce. Both environments serve the fundamental function of facilitating commerce.",
          "vocabulary": [
            { "phrase": "These images both depict", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Both photographs exemplify", "usage": "Sophisticated" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, these retail environments differ significantly. The mall represents standardized, climate-controlled commercial space dominated by chain retailers with fixed pricing structures. In contrast, the market embodies traditional, open-air commerce characterized by individual artisans, fresh produce, and negotiable pricing. The former emphasizes convenience and predictability, whilst the latter offers authenticity and cultural experience.",
          "vocabulary": [
            { "phrase": "However, these retail environments differ", "usage": "Contrast", "alternatives": [
              { "level": "Base", "phrase": "But the shopping experiences are different", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "The commercial paradigms diverge", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the advantages and drawbacks, the mall offers undeniable convenience - centralized shopping, climate control, and streamlined transactions. However, the experience can feel sterile and impersonal, with premium pricing. The market, conversely, provides sensory richness and cultural immersion, with opportunities for fresher products and price negotiation. Potential frustrations include environmental discomfort, navigation challenges, and communication barriers for non-native speakers.",
          "vocabulary": [
            { "phrase": "As for the advantages and drawbacks", "usage": "Addressing question", "alternatives": [
              { "level": "Base", "phrase": "What might be good or bad?", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Regarding the merits and limitations", "usage": "Formal" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs exemplify retail environments facilitating commercial exchange between vendors and consumers. The first depicts a contemporary shopping complex characterized by corporate merchandising and architectural modernity. The second portrays a traditional marketplace featuring artisanal vendors and perishable goods. The unifying element is their function as loci of economic transaction and consumer acquisition.",
          "vocabulary": [
            { "phrase": "Both photographs exemplify", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "These images both depict", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The commercial paradigms diverge fundamentally. The mall embodies globalized consumer capitalism - standardized retail experiences within climate-controlled environments featuring corporate franchises and algorithmic pricing. Conversely, the market represents traditional bazaar commerce - informal economic structures characterized by direct producer-consumer relationships, negotiable valuations, and cultural embeddedness. The former prioritizes transactional efficiency, whereas the latter emphasizes relational exchange and sensory authenticity.",
          "vocabulary": [
            { "phrase": "The commercial paradigms diverge", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "They're completely different", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "These retail environments differ", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the merits and limitations, the mall environment offers logistical optimization - consolidated retail access, environmental regulation, and frictionless payment systems. However, this convenience entails aesthetic homogenization, social atomization, and premium pricing structures. The traditional market, by contrast, provides multisensory cultural immersion, product freshness, and opportunities for price negotiation through interpersonal dialogue. Counterbalancing these advantages are potential environmental discomfort, spatial disorientation, and linguistic barriers complicating transactional negotiation for cultural outsiders.",
          "vocabulary": [
            { "phrase": "Regarding the merits and limitations", "usage": "Topic introduction", "alternatives": [
              { "level": "Base", "phrase": "What's good or bad?", "usage": "Direct" },
              { "level": "Alternative 1", "phrase": "As for advantages and drawbacks", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "exercise-activities",
    "question": "Compare the two photographs and say what the benefits might be of exercising in these different ways.",
    "photo1": {
      "id": "gym",
      "title": "Gym Exercise",
      "image": "https://images.unsplash.com/photo-1534438327276-14e5300c3a48?w=800"
    },
    "photo2": {
      "id": "outdoor-yoga",
      "title": "Outdoor Yoga",
      "image": "https://images.unsplash.com/photo-1544367567-0f2fcb009e0b?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people exercising and being active. In the first one, someone is working out at a gym using machines. In the second photo, people are doing yoga outside in a park. In both cases, people are taking care of their health and fitness.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening", "alternatives": [
              { "level": "Alternative 1", "phrase": "These images both present", "usage": "Slight variation" },
              { "level": "Alternative 2", "phrase": "Both photographs depict", "usage": "Formal opening" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But they're very different types of exercise. The gym workout is indoors and uses equipment - it's probably focused on building strength or losing weight. It looks intense and individual. The outdoor yoga is gentle and relaxing, done in nature with a group. One is about pushing your body hard, while the other is about flexibility and calmness.",
          "vocabulary": [
            { "phrase": "But they're very different types", "usage": "Introducing contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, these exercise modalities differ", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "The approaches to physical activity diverge", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "So what are the benefits? The gym is great for specific fitness goals - you can target certain muscles, track your progress, and work out whatever the weather. Plus there's usually a trainer who can help you. But it can be expensive and a bit boring. Outdoor yoga gives you fresh air and connection with nature, which is really good for mental health. It's also more social - you're part of a class. The downside is you can't do it when it's raining, and it might not give you the intense workout some people want.",
          "vocabulary": [
            { "phrase": "So what are the benefits?", "usage": "Addressing question", "alternatives": [
              { "level": "Alternative 1", "phrase": "As for the advantages", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "Regarding the respective merits", "usage": "Academic approach" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both present individuals engaged in physical fitness activities. The first depicts indoor gym training utilizing mechanical equipment for resistance exercise. The second portrays outdoor yoga practice conducted in a natural setting with multiple participants. What unites them is the shared commitment to physical wellbeing through structured exercise.",
          "vocabulary": [
            { "phrase": "These images both present", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Both photographs illustrate", "usage": "Formal" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, these exercise modalities differ substantially. The gym environment emphasizes high-intensity, equipment-based training aimed at muscular development and cardiovascular conditioning. This represents an individual pursuit in a controlled indoor setting. By comparison, outdoor yoga prioritizes flexibility, mindfulness, and gentle movement within a natural environment and group context. The former targets physical intensity, whilst the latter emphasizes mind-body integration.",
          "vocabulary": [
            { "phrase": "However, these exercise modalities differ", "usage": "Showing contrast", "alternatives": [
              { "level": "Base", "phrase": "But they're very different", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "The fitness paradigms diverge", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the advantages, gym training offers measurable progress toward specific fitness objectives through targeted exercises and professional guidance, regardless of weather conditions. However, it typically requires financial investment and can become monotonous. Outdoor yoga, conversely, provides psychological benefits through nature exposure and social connection, alongside physical flexibility gains. The limitations include weather dependency and potentially insufficient intensity for those seeking vigorous cardiovascular exercise.",
          "vocabulary": [
            { "phrase": "As for the advantages", "usage": "Addressing question", "alternatives": [
              { "level": "Base", "phrase": "So what are the benefits?", "usage": "Direct" },
              { "level": "Alternative 2", "phrase": "Regarding the respective merits", "usage": "Formal" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs illustrate deliberate engagement in physical activity for health optimization. The first presents resistance training within a gymnasium environment utilizing specialized equipment for muscular conditioning. The second depicts yogic practice conducted outdoors in a verdant setting with collective participation. The commonality lies in intentional physical exertion directed toward wellness enhancement.",
          "vocabulary": [
            { "phrase": "Both photographs illustrate", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "These images both present", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The fitness paradigms diverge fundamentally. Gymnasium training embodies high-intensity, equipment-mediated exercise emphasizing muscular hypertrophy and metabolic conditioning through isolated movements. This represents an individualized, goal-oriented approach within climate-controlled infrastructure. Conversely, outdoor yoga exemplifies holistic, low-impact practice integrating physical postures with breath work and meditation in natural surroundings with communal participation. The former prioritizes measurable physical outcomes, whereas the latter emphasizes psychosomatic integration.",
          "vocabulary": [
            { "phrase": "The fitness paradigms diverge", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "They're very different", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "These exercise modalities differ", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the respective merits, gymnasium training facilitates quantifiable progress toward specific physiological objectives through progressive overload principles and professional instruction, with environmental independence. However, this modality entails financial barriers and potential experiential tedium. Outdoor yogic practice, conversely, confers psychological dividends through biophilic exposure and social solidarity, alongside proprioceptive development and flexibility enhancement. Counterbalancing these advantages are meteorological constraints and potentially inadequate cardiovascular stimulus for individuals seeking high-intensity aerobic conditioning.",
          "vocabulary": [
            { "phrase": "Regarding the respective merits", "usage": "Topic introduction", "alternatives": [
              { "level": "Base", "phrase": "So what are the benefits?", "usage": "Direct" },
              { "level": "Alternative 1", "phrase": "As for the advantages", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  },
  {
    "id": "eating-situations",
    "question": "Compare the two photographs and say what the experience might be like for the people in these situations.",
    "photo1": {
      "id": "restaurant-dining",
      "title": "Restaurant Dining",
      "image": "https://images.unsplash.com/photo-1517248135467-4c7edcad34c4?w=800"
    },
    "photo2": {
      "id": "street-food",
      "title": "Street Food",
      "image": "https://images.unsplash.com/photo-1555939594-58d7cb561ad1?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people eating food in public places. In the first one, people are dining at a nice restaurant with tables and waiters. In the second picture, someone is getting street food from a market stall. In both situations, people are enjoying meals outside their homes.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening", "alternatives": [
              { "level": "Alternative 1", "phrase": "These images both depict", "usage": "Slight variation" },
              { "level": "Alternative 2", "phrase": "Both photographs present", "usage": "Formal opening" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But the dining experiences are completely different. The restaurant looks formal and expensive - you sit down, order from a menu, and get proper service. It's calm and sophisticated. The street food is much more casual and quick - you just grab something and eat it standing up or walking around. One is a full meal experience, while the other is more like a snack on the go.",
          "vocabulary": [
            { "phrase": "But the dining experiences are completely different", "usage": "Main contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, these culinary contexts differ significantly", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "The gastronomic experiences diverge fundamentally", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "What might the experience be like? At the restaurant, people probably feel quite special and relaxed. It's a treat - maybe celebrating something or on a date. The atmosphere is nice, the food is presented beautifully, and you can take your time. But it's expensive and quite formal. With street food, the experience is much more authentic and spontaneous. You get to try local flavors, it's really cheap, and it's exciting. But it might not be as comfortable - you're standing, it might be hot and crowded, and you don't know if the food is safe.",
          "vocabulary": [
            { "phrase": "people probably feel", "usage": "Speculation about experience", "alternatives": [
              { "level": "Alternative 1", "phrase": "diners likely experience", "usage": "More formal" },
              { "level": "Alternative 2", "phrase": "patrons presumably perceive", "usage": "Academic" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both depict dining experiences occurring outside the domestic sphere. The first presents a formal restaurant setting with table service and structured ambiance. The second portrays informal street food consumption at an outdoor market vendor. Both scenarios involve individuals seeking sustenance through commercial food establishments.",
          "vocabulary": [
            { "phrase": "These images both depict", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Simple" },
              { "level": "Alternative 2", "phrase": "Both photographs exemplify", "usage": "Sophisticated" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "However, these culinary contexts differ significantly. The restaurant embodies formal dining culture - seated service, curated menus, and refined atmosphere within an enclosed space. In contrast, the street food scenario represents casual, rapid consumption - minimal infrastructure, immediate service, and open-air environment. The former emphasizes leisurely enjoyment and social ritual, whilst the latter prioritizes convenience and authenticity.",
          "vocabulary": [
            { "phrase": "However, these culinary contexts differ", "usage": "Showing contrast", "alternatives": [
              { "level": "Base", "phrase": "But the dining experiences are different", "usage": "Natural" },
              { "level": "Alternative 2", "phrase": "The gastronomic paradigms diverge", "usage": "Academic" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the experience, restaurant diners likely perceive their meal as an occasion - perhaps celebratory or romantic. The controlled environment, attentive service, and culinary presentation create a sense of indulgence and temporal leisure. However, this comes with financial expense and behavioral expectations. Street food consumers, conversely, experience cultural immersion and culinary adventure at minimal cost. The informal setting offers spontaneity and local authenticity, though potentially compromised by environmental discomfort and food safety uncertainties.",
          "vocabulary": [
            { "phrase": "As for the experience", "usage": "Addressing question", "alternatives": [
              { "level": "Base", "phrase": "What might it be like?", "usage": "Direct" },
              { "level": "Alternative 2", "phrase": "Regarding the experiential quality", "usage": "Formal" }
            ]}
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "Both photographs exemplify commercial alimentary consumption transpiring beyond domestic confines. The first depicts a formal dining establishment characterized by table service, architectural sophistication, and codified behavioral norms. The second portrays informal street-based food vending featuring minimal infrastructure and immediate transactional exchange. The unifying element is the procurement of prepared meals through commercial rather than domestic channels.",
          "vocabulary": [
            { "phrase": "Both photographs exemplify", "usage": "Opening", "alternatives": [
              { "level": "Base", "phrase": "Both photos show", "usage": "Natural" },
              { "level": "Alternative 1", "phrase": "These images both depict", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "The gastronomic experiences diverge fundamentally. Restaurant dining embodies ritualized consumption - structured service protocols, curated gastronomic offerings, and atmospheric orchestration within climate-controlled environments. This represents leisure-oriented commensality with temporal expansion and social performance dimensions. Conversely, street food consumption exemplifies spontaneous, utility-focused alimentation - minimal service mediation, vernacular cuisine, and ambulatory consumption in public thoroughfares. The former prioritizes experiential cultivation, whereas the latter emphasizes convenience and cultural authenticity.",
          "vocabulary": [
            { "phrase": "The gastronomic experiences diverge", "usage": "Main contrast", "alternatives": [
              { "level": "Base", "phrase": "They're completely different", "usage": "Simple" },
              { "level": "Alternative 1", "phrase": "These culinary contexts differ", "usage": "Mid-level" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the experiential quality, restaurant patrons presumably perceive their dining as ceremonial consumption - potentially commemorating social occasions or facilitating romantic bonding. The orchestrated environment, deferential service, and aesthetic presentation engender sensations of indulgence and temporal suspension. However, this experiential elevation necessitates substantial financial outlay and adherence to behavioral conventions. Street food consumers, by contrast, access culinary immediacy and cultural immersion at nominal cost, experiencing gustatory adventure through vernacular preparations. Counterbalancing these virtues are environmental constraints - ambient heat, spatial congestion, and potential food safety ambiguities.",
          "vocabulary": [
            { "phrase": "Regarding the experiential quality", "usage": "Topic introduction", "alternatives": [
              { "level": "Base", "phrase": "What's it like?", "usage": "Direct" },
              { "level": "Alternative 1", "phrase": "As for the experience", "usage": "Mid-level" }
            ]}
          ]
        }
      ]
    }
  }
]
