[
  {
    "id": "family-park",
    "title": "Family in Park",
    "image": "https://images.unsplash.com/photo-1476703993599-0035a21b17a9?w=800",
    "description": [
      {
        "step": "overview",
        "text": "In this warm and cozy photograph, I can see a mother sitting indoors with two young children. The setting appears to be a comfortable living room, probably during the daytime given the natural lighting coming through what looks like a window in the background.",
        "highlight": { "top": "10%", "left": "10%", "width": "80%", "height": "40%" },
        "vocabulary": [
          { "phrase": "I can see", "usage": "Introducing what's visible" },
          { "phrase": "appears to be", "usage": "Making observations" },
          { "phrase": "given the", "usage": "Providing evidence" }
        ]
      },
      {
        "step": "details",
        "text": "In the center of the image, there's a woman with red hair wearing dark clothing, seated on a grey sofa. She's surrounded by two children - a toddler sitting to her left and a baby she's holding. The toddler appears to be focused on a tablet device. In the foreground, I can make out what looks like a glass on a table, suggesting they might be having snacks. The background shows a soft, blurred interior with warm tones.",
        "highlight": { "top": "30%", "left": "20%", "width": "60%", "height": "50%" },
        "vocabulary": [
          { "phrase": "In the center", "usage": "Describing position - middle" },
          { "phrase": "surrounded by", "usage": "Describing arrangement" },
          { "phrase": "appears to be focused on", "usage": "Observing behavior" },
          { "phrase": "I can make out", "usage": "Seeing something unclear" }
        ]
      },
      {
        "step": "speculation",
        "text": "I imagine this is a typical quiet afternoon at home. The mother seems to be entertaining her children with screen time, which is quite common for young families these days. Perhaps she's using the tablet to keep the older child occupied while caring for the baby. The relaxed atmosphere suggests they're comfortable and content. It might be the weekend or perhaps the mother is working from home and taking a break to spend time with her children.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I imagine", "usage": "Speculation" },
          { "phrase": "seems to be", "usage": "Drawing conclusions" },
          { "phrase": "suggests they're", "usage": "Inference from evidence" },
          { "phrase": "It might be", "usage": "Possibility" }
        ]
      }
    ]
  },
  {
    "id": "office-meeting",
    "title": "Office Meeting",
    "image": "https://images.unsplash.com/photo-1542744173-8e7e53415bb0?w=800",
    "description": [
      {
        "step": "overview",
        "text": "This photograph shows what appears to be a business meeting taking place in a modern office environment. The setting looks professional and contemporary, with several people gathered around a conference table in what seems to be a bright, well-lit meeting room.",
        "highlight": { "top": "15%", "left": "15%", "width": "70%", "height": "35%" },
        "vocabulary": [
          { "phrase": "This photograph shows", "usage": "Formal opening" },
          { "phrase": "what appears to be", "usage": "Cautious observation" },
          { "phrase": "taking place", "usage": "Describing an event" }
        ]
      },
      {
        "step": "details",
        "text": "In the foreground, I can see several professionals seated around a wooden conference table. There's a woman in the center wearing a white blazer who appears to be leading the discussion. On the left-hand side, there's a man in a blue shirt, and on the right, I can make out other colleagues listening attentively. The table is covered with laptops, papers, and what look like coffee cups, suggesting this has been an ongoing discussion. The background shows large windows allowing natural light to flood the space.",
        "highlight": { "top": "30%", "left": "25%", "width": "50%", "height": "50%" },
        "vocabulary": [
          { "phrase": "In the foreground", "usage": "Front position" },
          { "phrase": "appears to be leading", "usage": "Observing roles" },
          { "phrase": "On the left-hand side", "usage": "Left position" },
          { "phrase": "I can make out", "usage": "Partial visibility" }
        ]
      },
      {
        "step": "speculation",
        "text": "I'd say this is probably a strategy meeting or project review. The professional attire and serious expressions suggest it's an important discussion, perhaps about quarterly results or a new business initiative. The presence of multiple laptops indicates they might be reviewing data or presentations together. The atmosphere seems collaborative yet focused, which suggests the team works well together. It could be mid-morning, as that's when most companies schedule their key meetings.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I'd say", "usage": "Personal judgment" },
          { "phrase": "suggest it's", "usage": "Drawing inference" },
          { "phrase": "indicates they might be", "usage": "Evidence-based speculation" },
          { "phrase": "seems collaborative", "usage": "Describing atmosphere" }
        ]
      }
    ]
  },
  {
    "id": "street-market",
    "title": "Street Market",
    "image": "https://images.unsplash.com/photo-1555939594-58d7cb561ad1?w=800",
    "description": [
      {
        "step": "overview",
        "text": "This mouth-watering photograph captures a beautifully presented meal, probably in a restaurant or food market setting. The image is dominated by rich, warm colors - golden browns and deep reds - that immediately draw the eye to the food.",
        "highlight": { "top": "20%", "left": "10%", "width": "80%", "height": "30%" },
        "vocabulary": [
          { "phrase": "This mouth-watering photograph", "usage": "Descriptive opening" },
          { "phrase": "captures", "usage": "Showing scene" },
          { "phrase": "is dominated by", "usage": "Describing main feature" }
        ]
      },
      {
        "step": "details",
        "text": "In the center of the image, there's a wooden cutting board displaying what looks like roasted or grilled meat, possibly chicken or turkey, with crispy, golden-brown skin. Surrounding the meat are roasted vegetables - I can make out what appear to be potatoes and possibly carrots. The food is garnished with fresh herbs. In the background, there's a small bowl containing what looks like a red sauce, and I can see part of a basket, suggesting this might be a rustic or artisanal presentation. The wooden surface and natural styling give it an authentic, homemade feel.",
        "highlight": { "top": "35%", "left": "20%", "width": "60%", "height": "50%" },
        "vocabulary": [
          { "phrase": "In the center", "usage": "Central position" },
          { "phrase": "I can make out", "usage": "Identifying details" },
          { "phrase": "what appears to be", "usage": "Uncertain identification" },
          { "phrase": "give it a", "usage": "Describing effect" }
        ]
      },
      {
        "step": "speculation",
        "text": "I imagine this is either a specialty dish at a farm-to-table restaurant or perhaps a street food market stall selling gourmet roasted meats. The careful presentation suggests it's meant to be photographed and shared on social media. The generous portion and variety of sides indicate it's probably designed for sharing between two or three people. This could be a popular dish that draws customers specifically for its visual appeal and hearty, comfort-food qualities. The rustic presentation suggests the establishment prides itself on traditional cooking methods.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I imagine", "usage": "Speculation" },
          { "phrase": "suggests it's meant to be", "usage": "Purpose inference" },
          { "phrase": "indicate it's probably", "usage": "Evidence-based guess" },
          { "phrase": "prides itself on", "usage": "Describing values" }
        ]
      }
    ]
  },
  {
    "id": "students-library",
    "title": "Students Studying",
    "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800",
    "description": [
      {
        "step": "overview",
        "text": "In this photograph, I can see a group of young people studying together in what looks like a university library or collaborative study space. The environment appears bright and modern, typical of an academic setting designed to encourage group work.",
        "highlight": { "top": "10%", "left": "10%", "width": "80%", "height": "40%" },
        "vocabulary": [
          { "phrase": "In this photograph", "usage": "Formal opening" },
          { "phrase": "what looks like", "usage": "Educated guess" },
          { "phrase": "appears bright", "usage": "Describing atmosphere" },
          { "phrase": "typical of", "usage": "Making comparisons" }
        ]
      },
      {
        "step": "details",
        "text": "In the foreground, there are four students gathered around a table. I can see they're using multiple devices - there are at least two laptops visible, and they appear to be sharing information on the screens. One woman on the left is smiling and seems to be explaining something, while the others are leaning in attentively. They all look engaged and focused on their work. The table appears to have notebooks and other study materials scattered across it. Everyone is dressed casually, which is typical for university students.",
        "highlight": { "top": "35%", "left": "15%", "width": "70%", "height": "50%" },
        "vocabulary": [
          { "phrase": "In the foreground", "usage": "Front position" },
          { "phrase": "gathered around", "usage": "Describing group position" },
          { "phrase": "appear to be sharing", "usage": "Observing interaction" },
          { "phrase": "leaning in attentively", "usage": "Describing body language" }
        ]
      },
      {
        "step": "speculation",
        "text": "I'd guess this is probably exam revision period or they're working on a group project together. The collaborative atmosphere and the fact they're sharing screens suggests they're helping each other understand difficult concepts. University students often find studying in groups more effective and less stressful than working alone. The positive energy and smiles suggest they have good chemistry as a study group. It might be late morning or early afternoon, as libraries tend to fill up with students during these peak study hours.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I'd guess", "usage": "Making assumption" },
          { "phrase": "suggests they're helping", "usage": "Inferring behavior" },
          { "phrase": "find studying", "usage": "Describing preferences" },
          { "phrase": "tend to fill up", "usage": "Habitual patterns" }
        ]
      }
    ]
  },
  {
    "id": "beach-sunset",
    "title": "Beach at Sunset",
    "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800",
    "description": [
      {
        "step": "overview",
        "text": "This stunning image shows a tropical beach at what appears to be either sunrise or sunset. The scene is absolutely breathtaking, with crystal-clear turquoise water and pristine white sand creating a picture-perfect paradise setting.",
        "highlight": { "top": "5%", "left": "5%", "width": "90%", "height": "40%" },
        "vocabulary": [
          { "phrase": "This stunning image", "usage": "Appreciative opening" },
          { "phrase": "at what appears to be", "usage": "Time speculation" },
          { "phrase": "absolutely breathtaking", "usage": "Strong description" },
          { "phrase": "creating a", "usage": "Describing effect" }
        ]
      },
      {
        "step": "details",
        "text": "In the foreground, there's untouched white sand that looks incredibly soft and inviting. The shallow water near the shore displays the most amazing shades of turquoise and aquamarine, so clear you can see right through to the sandy bottom. Further out, the ocean transitions to deeper blues. On the right-hand side of the image, I can make out a few palm trees leaning gracefully, their fronds swaying gently. The sky above shows beautiful warm tones - soft oranges, pinks, and golden hues blending together. There's not a single person visible in the frame, which emphasizes the sense of isolation and tranquility.",
        "highlight": { "top": "45%", "left": "10%", "width": "80%", "height": "45%" },
        "vocabulary": [
          { "phrase": "In the foreground", "usage": "Front position" },
          { "phrase": "displays the most amazing", "usage": "Emphasizing quality" },
          { "phrase": "I can make out", "usage": "Partial visibility" },
          { "phrase": "which emphasizes", "usage": "Describing effect" }
        ]
      },
      {
        "step": "speculation",
        "text": "I imagine this photograph was taken at a remote tropical destination, possibly in the Maldives, Caribbean, or South Pacific. The complete absence of people and development suggests it's either a private island, a protected nature reserve, or the photographer arrived very early in the morning to capture this untouched beauty. This is exactly the kind of scene people dream about when planning a tropical getaway - somewhere to completely escape from the stresses of daily life. The perfect conditions and lighting suggest the photographer waited for just the right moment to capture this image. Anyone viewing this photo would probably feel an immediate desire to visit such a paradise.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I imagine", "usage": "Speculation" },
          { "phrase": "suggests it's either", "usage": "Multiple possibilities" },
          { "phrase": "exactly the kind of", "usage": "Categorizing" },
          { "phrase": "would probably feel", "usage": "Predicted reaction" }
        ]
      }
    ]
  },
  {
    "id": "city-night",
    "title": "City at Night",
    "image": "https://images.unsplash.com/photo-1514565131-fce0801e5785?w=800",
    "description": [
      {
        "step": "overview",
        "text": "This atmospheric photograph captures a bustling city street at night, illuminated by countless artificial lights. The scene appears to be in a major metropolitan area, probably in Asia given the style of signage and urban density visible in the image.",
        "highlight": { "top": "10%", "left": "10%", "width": "80%", "height": "35%" },
        "vocabulary": [
          { "phrase": "This atmospheric photograph", "usage": "Mood-setting opening" },
          { "phrase": "illuminated by", "usage": "Describing light source" },
          { "phrase": "appears to be", "usage": "Location speculation" },
          { "phrase": "given the", "usage": "Providing evidence" }
        ]
      },
      {
        "step": "details",
        "text": "In the foreground, I can see a busy street filled with pedestrians crossing what looks like a major intersection. The crowds appear quite dense, suggesting this is a popular area or peak time. All along both sides of the street, there are bright neon signs and advertisements in various colors - predominantly reds, blues, and whites - creating that characteristic urban glow. In the background, tall buildings rise up, their windows lit from within. I can make out some Japanese or Chinese characters on several signs, which confirms this is likely somewhere in East Asia. The wet pavement reflects all these lights, suggesting it has recently rained.",
        "highlight": { "top": "40%", "left": "15%", "width": "70%", "height": "45%" },
        "vocabulary": [
          { "phrase": "In the foreground", "usage": "Front position" },
          { "phrase": "appear quite dense", "usage": "Describing crowd" },
          { "phrase": "All along both sides", "usage": "Describing distribution" },
          { "phrase": "I can make out", "usage": "Identifying details" }
        ]
      },
      {
        "step": "speculation",
        "text": "I'd say this is probably a famous entertainment or shopping district, perhaps in Tokyo, Osaka, Seoul, or Shanghai. The sheer number of people and the vibrant commercial signage suggest this is a major nightlife area that attracts both locals and tourists. People might be heading out for dinner, shopping, or entertainment after finishing work. The energy of the scene suggests this area never truly sleeps - it's the kind of place that comes alive after dark. The photograph was probably taken on a weekend evening when foot traffic is at its peak. For visitors, this would represent the exciting, fast-paced side of Asian megacity life.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I'd say", "usage": "Personal judgment" },
          { "phrase": "suggest this is", "usage": "Drawing conclusion" },
          { "phrase": "might be heading", "usage": "Speculation about activity" },
          { "phrase": "comes alive", "usage": "Describing transformation" }
        ]
      }
    ]
  },
  {
    "id": "mountain-hiking",
    "title": "Mountain Hiking",
    "image": "https://images.unsplash.com/photo-1551632811-561732d1e306?w=800",
    "description": [
      {
        "step": "overview",
        "text": "This inspiring photograph shows a lone hiker standing on a mountain ridge, looking out over a dramatic landscape. The scene appears to be at high altitude, probably in a major mountain range, captured during what looks like either early morning or late afternoon given the quality of light.",
        "highlight": { "top": "15%", "left": "10%", "width": "80%", "height": "35%" },
        "vocabulary": [
          { "phrase": "This inspiring photograph", "usage": "Emotional opening" },
          { "phrase": "looking out over", "usage": "Describing viewpoint" },
          { "phrase": "appears to be", "usage": "Making observation" },
          { "phrase": "given the quality of", "usage": "Reasoning from evidence" }
        ]
      },
      {
        "step": "details",
        "text": "In the center of the image, there's a person wearing outdoor gear - I can make out a backpack and what looks like hiking clothing - standing with their back to the camera. They're positioned on a rocky outcrop or ridge. Stretching out before them is a vast mountainous landscape with multiple peaks visible in the distance. The foreground shows rough, rocky terrain, while the background features layer upon layer of mountain ranges fading into the misty distance. The sky above displays interesting cloud formations, adding drama to the scene. The lighting creates strong contrasts between the shadowed valleys and the illuminated peaks.",
        "highlight": { "top": "35%", "left": "20%", "width": "60%", "height": "50%" },
        "vocabulary": [
          { "phrase": "In the center", "usage": "Central position" },
          { "phrase": "I can make out", "usage": "Identifying elements" },
          { "phrase": "Stretching out before", "usage": "Describing view" },
          { "phrase": "fading into", "usage": "Describing distance" }
        ]
      },
      {
        "step": "speculation",
        "text": "I imagine this hiker has been trekking for several hours to reach this viewpoint, possibly as part of a multi-day hiking expedition. The solitary figure suggests this person values the peace and reflection that comes with solo hiking in remote places. They're probably taking a moment to rest, absorb the view, and feel a sense of accomplishment at reaching this point. The scale of the landscape compared to the human figure emphasizes both the majesty of nature and our small place within it. This could be somewhere like the Alps, Himalayas, or Rocky Mountains. For many outdoor enthusiasts, moments like this - standing alone in such magnificent scenery - represent the ultimate reward for the physical effort of climbing.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I imagine", "usage": "Speculation" },
          { "phrase": "suggests this person values", "usage": "Character inference" },
          { "phrase": "They're probably taking", "usage": "Guessing activity" },
          { "phrase": "emphasizes both", "usage": "Describing significance" }
        ]
      }
    ]
  },
  {
    "id": "coffee-shop",
    "title": "Coffee Shop",
    "image": "https://images.unsplash.com/photo-1554118811-1e0d58224f24?w=800",
    "description": [
      {
        "step": "overview",
        "text": "This cozy image captures the interior of what appears to be an independent coffee shop or café. The atmosphere looks warm and inviting, with a distinctly artisanal or hipster aesthetic that's become popular in urban coffee culture.",
        "highlight": { "top": "10%", "left": "10%", "width": "80%", "height": "40%" },
        "vocabulary": [
          { "phrase": "This cozy image", "usage": "Setting mood" },
          { "phrase": "what appears to be", "usage": "Identifying location" },
          { "phrase": "looks warm and inviting", "usage": "Describing atmosphere" },
          { "phrase": "that's become popular", "usage": "Cultural reference" }
        ]
      },
      {
        "step": "details",
        "text": "In the foreground, I can see a polished wooden counter or bar area with a beautifully crafted cup of coffee sitting on it - the latte art on top is clearly visible and looks professionally done. Behind the counter, there's an impressive display of bottles, presumably containing various syrups and ingredients. The background shows industrial-style décor with exposed brick walls, hanging Edison bulbs providing warm lighting, and what looks like coffee-making equipment. On the left-hand side, I can make out some greenery - perhaps potted plants adding a natural touch to the space. The overall color scheme is warm browns, amber lighting, and natural wood tones.",
        "highlight": { "top": "40%", "left": "20%", "width": "60%", "height": "45%" },
        "vocabulary": [
          { "phrase": "In the foreground", "usage": "Front position" },
          { "phrase": "I can see", "usage": "Identifying elements" },
          { "phrase": "presumably containing", "usage": "Educated guess" },
          { "phrase": "I can make out", "usage": "Noticing details" }
        ]
      },
      {
        "step": "speculation",
        "text": "I'd guess this is probably a trendy neighborhood café that takes its coffee seriously - the kind of place where baristas are trained in the art of coffee making and customers come as much for the atmosphere as for the beverages. The attention to detail in both the drink presentation and the interior design suggests the owners have invested significantly in creating a specific ambiance. This type of establishment probably attracts a mix of freelancers working on laptops, friends meeting for casual catch-ups, and coffee enthusiasts who appreciate quality brewing methods. It might be mid-morning, which is typically when coffee shops experience their busiest period. The careful styling suggests this café is likely active on social media, as these aesthetically pleasing spaces are very popular for Instagram posts.",
        "highlight": null,
        "vocabulary": [
          { "phrase": "I'd guess", "usage": "Making assumption" },
          { "phrase": "suggests the owners have", "usage": "Business inference" },
          { "phrase": "probably attracts", "usage": "Predicting clientele" },
          { "phrase": "are very popular for", "usage": "Cultural trend" }
        ]
      }
    ]
  }
]
