[
  {
    "id": "work-situations",
    "question": "Compare the two photographs and say what might be difficult for the people in these situations.",
    "photo1": {
      "id": "office-meeting",
      "title": "Office Meeting",
      "image": "https://images.unsplash.com/photo-1542744173-8e7e53415bb0?w=800"
    },
    "photo2": {
      "id": "coffee-shop-work",
      "title": "Working in Café",
      "image": "https://images.unsplash.com/photo-1554118811-1e0d58224f24?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people working. In the first one, there's a meeting in an office with people sitting around a table. In the second photo, someone is working in a café. In both situations, people are trying to get work done.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Starting comparison", "alternatives": [
              { "level": "Alternative 1", "phrase": "These two pictures both show" },
              { "level": "Alternative 2", "phrase": "In both pictures we can see" }
            ]}
          ]
        },
        {
          "step": "differences",
          "text": "But there are some big differences. The office looks really formal - everyone's in a proper meeting. But the café is much more relaxed and casual. Also, in the office they're working as a team, while in the café the person is on their own.",
          "vocabulary": [
            { "phrase": "But there are some big differences", "usage": "Introducing contrast", "alternatives": [
              { "level": "Alternative 1", "phrase": "However, they're quite different" },
              { "level": "Alternative 2", "phrase": "On the other hand" }
            ]}
          ]
        },
        {
          "step": "answer_question",
          "text": "So what might be difficult? Well, in the office meeting, I think the hard part is probably dealing with different opinions. Everyone has their own ideas and you have to agree on something. Plus, you might feel nervous speaking in front of your colleagues. In the café, the main problem would be all the noise and people walking around. It's really hard to concentrate when there's so much going on. Also, you don't have anyone to help you if you get stuck.",
          "vocabulary": [
            { "phrase": "I think the hard part is probably", "usage": "Speculation", "alternatives": [
              { "level": "Alternative 1", "phrase": "It might be difficult because" },
              { "level": "Alternative 2", "phrase": "I'd say the challenge is" }
            ]}
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show people in working environments. The first picture shows an office meeting with several colleagues around a table. In the second one, someone is working alone in a café. What they have in common is that both people are focused on their work.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Starting comparison" },
            { "phrase": "What they have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, they're quite different in several ways. While the office meeting looks formal and structured, the café is much more casual. Another difference is that the office workers are collaborating as a team, whereas the person in the café is working alone.",
          "vocabulary": [
            { "phrase": "However, they're quite different", "usage": "Introducing contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for what might be difficult, I'd say that in the office meeting, the challenge is probably managing different opinions. It could be stressful trying to get everyone to agree. Also, you might feel pressure speaking in front of colleagues. In the café, I think the main difficulty would be the distractions - there's noise, people moving around, and no privacy. Plus, if you get stuck on something, there's nobody there to help you.",
          "vocabulary": [
            { "phrase": "As for what might be difficult", "usage": "Addressing question" },
            { "phrase": "I'd say that", "usage": "Giving opinion" },
            { "phrase": "the challenge is probably", "usage": "Speculation" },
            { "phrase": "It could be", "usage": "Modal for speculation" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both pictures we can see people in work situations. The top photo shows a formal meeting in an office, while the bottom one shows someone working in a café. One thing these situations have in common is that in both cases, people are trying to complete work tasks.",
          "vocabulary": [
            { "phrase": "In both pictures we can see", "usage": "Starting comparison" },
            { "phrase": "One thing these situations have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, there are significant differences. The office meeting appears quite formal and organized, whereas the café setting is considerably more relaxed. Another clear difference is that the first situation involves teamwork and collaboration, while the second shows independent work.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "while", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the difficulties, in my opinion, the office workers might find it challenging to manage conflicting ideas and reach agreement. There could also be pressure to perform well in front of their team. As for the café situation, I imagine the main problem would be staying focused with all the background noise and movement. It's likely that working alone means you can't ask for help when you need it.",
          "vocabulary": [
            { "phrase": "Regarding the difficulties", "usage": "Addressing question" },
            { "phrase": "in my opinion", "usage": "Giving opinion" },
            { "phrase": "might find it challenging", "usage": "Modal speculation" },
            { "phrase": "There could also be", "usage": "Possibility" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "It's likely that", "usage": "Probability" }
          ]
        }
      ]
    }
  },
  {
    "id": "outdoor-activities",
    "question": "Compare the two photographs and say why the people might have decided to spend their time in these ways.",
    "photo1": {
      "id": "beach-sunset",
      "title": "Beach at Sunset",
      "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800"
    },
    "photo2": {
      "id": "mountain-hiking",
      "title": "Mountain Hiking",
      "image": "https://images.unsplash.com/photo-1551632811-561732d1e306?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people enjoying nature. The first picture is of a beautiful beach, and the second one shows someone hiking in the mountains. In both cases, people have chosen to spend time outside in really nice places.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening comparison" }
          ]
        },
        {
          "step": "differences",
          "text": "But they're very different activities. The beach is all about relaxing - you just sit there and chill out. The mountain hiking is completely different - it's active and you need to be quite fit. The beach is easy to get to, but going up a mountain needs proper planning.",
          "vocabulary": [
            { "phrase": "But they're very different", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "So why did they choose these activities? I think the people at the beach probably wanted to escape from their busy lives and just relax. Maybe they were feeling stressed and needed somewhere quiet and peaceful. The mountain hiker is different - they probably chose this because they like a challenge. Some people prefer doing something active where they push themselves. Plus, the views from the top of a mountain are amazing - that's a pretty good reason to climb up there!",
          "vocabulary": [
            { "phrase": "I think the people", "usage": "Speculation" },
            { "phrase": "Maybe", "usage": "Possibility" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These images both show people enjoying outdoor activities. The first one depicts a peaceful beach setting, while the second shows someone hiking in the mountains. What they have in common is that both individuals have chosen to spend time in natural environments.",
          "vocabulary": [
            { "phrase": "These images both show", "usage": "Opening" },
            { "phrase": "What they have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the activities are quite different. While the beach experience is all about relaxation and unwinding, mountain hiking is much more active and challenging. Another difference is that beaches are usually easy to access, whereas mountain trips require more preparation.",
          "vocabulary": [
            { "phrase": "However, the activities are quite different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Showing contrast" },
            { "phrase": "whereas", "usage": "Contrasting" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for why they chose these activities, I'd say the beach-goers probably wanted to de-stress and escape from their daily routine. Perhaps they needed some peace and quiet away from their busy lives. The mountain hiker, on the other hand, likely chose this activity for the physical challenge. Some people enjoy pushing their limits and testing themselves. Plus, the amazing views from the top could be a big motivation.",
          "vocabulary": [
            { "phrase": "As for why they chose", "usage": "Addressing question" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "Perhaps", "usage": "Speculation" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "could be", "usage": "Possibility" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see people spending time in nature. The first shows a stunning beach scene, while the second depicts a mountain hiking adventure. One thing both situations have in common is that people have decided to get outdoors and away from urban life.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing both situations have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, these are very different ways to spend free time. The beach represents passive relaxation and rest, whereas hiking involves physical activity and endurance. It seems to me that accessibility is another key difference - beaches are generally straightforward to reach, while mountain expeditions need careful planning.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding their motivations, I imagine the people at the beach were looking for a way to relax and escape stress. They might have been feeling overwhelmed and needed somewhere calm and peaceful. As for the hiker, I reckon they chose this activity because they enjoy physical challenges. It's possible that they're the type of person who likes pushing themselves. What's more, the spectacular views you get from mountain peaks could be a major reason for making the effort.",
          "vocabulary": [
            { "phrase": "Regarding their motivations", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "They might have been", "usage": "Past speculation" },
            { "phrase": "As for the hiker", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's possible that", "usage": "Possibility" },
            { "phrase": "could be", "usage": "Modal speculation" }
          ]
        }
      ]
    }
  },
  {
    "id": "learning-situations",
    "question": "Compare the two photographs and say what the people might be learning from these experiences.",
    "photo1": {
      "id": "students-library",
      "title": "Students Studying",
      "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800"
    },
    "photo2": {
      "id": "family-home",
      "title": "Family at Home",
      "image": "https://images.unsplash.com/photo-1476703993599-0035a21b17a9?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both pictures show people learning something, but in different ways. In the first photo, there are university students studying together in a library. In the second one, there's a parent at home with young children using a tablet. They're all focused on learning.",
          "vocabulary": [
            { "phrase": "Both pictures show", "usage": "Starting comparison" }
          ]
        },
        {
          "step": "differences",
          "text": "The big difference is what kind of learning it is. The students are doing serious study - probably for exams or assignments. It's formal and organized. But the children at home are learning through games and fun activities. It's much more relaxed. Also, the students work together as a group, but the little kids need their parent to help them.",
          "vocabulary": [
            { "phrase": "The big difference is", "usage": "Main contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "So what are they learning? The university students are obviously learning their subjects - history, science, whatever they're studying. But they're also learning how to work with other people and how to manage their time. The young children are probably learning basic things like numbers, colors, or new words. They're also learning important skills like how to pay attention and follow instructions. And spending time with their parent teaches them they're loved and safe.",
          "vocabulary": [
            { "phrase": "So what are they learning?", "usage": "Addressing question" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show learning situations. The first shows university students working together in a library. In the second, a parent is helping young children learn using a tablet at home. What these situations have in common is that learning is taking place in both.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Opening" },
            { "phrase": "What these situations have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the type of learning is quite different. While the students are engaged in formal academic study, the children are learning through play-based activities. Another difference is that the university students work independently as a group, whereas the young children require parental guidance.",
          "vocabulary": [
            { "phrase": "However, the type of learning is quite different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for what they're learning, I'd say the students are obviously developing knowledge in their academic subjects. Beyond that, they're probably learning collaboration skills and time management. The young children, on the other hand, are likely learning fundamental things like counting, colors, or vocabulary. Perhaps more importantly, they're also developing concentration skills and learning to follow instructions. Plus, the quality time with their parent helps them feel secure.",
          "vocabulary": [
            { "phrase": "As for what they're learning", "usage": "Addressing topic" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "Perhaps more importantly", "usage": "Adding emphasis" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see educational activities taking place. The top picture shows students studying together in a library, while the bottom one shows a parent teaching young children at home with a tablet. One thing they share is that everyone is focused on acquiring new knowledge or skills.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing they share", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, the learning contexts are very different. The university setting involves formal, structured study, whereas the home environment is more informal and playful. It seems to me that another key difference is independence - the students are working autonomously, while the children need adult support.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding what they're learning, I imagine the university students are building subject knowledge in their chosen fields. They might also be developing important skills like teamwork and self-discipline. As for the young children, I reckon they're learning basic concepts - numbers, letters, and vocabulary. It's likely that they're also developing cognitive skills like concentration and following instructions. What's more, the interaction with their parent is probably teaching them about trust and security.",
          "vocabulary": [
            { "phrase": "Regarding what they're learning", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "They might also be", "usage": "Possibility" },
            { "phrase": "As for the young children", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's likely that", "usage": "Probability" },
            { "phrase": "What's more", "usage": "Adding information" }
          ]
        }
      ]
    }
  },
  {
    "id": "social-situations",
    "question": "Compare the two photographs and say how the people might be feeling in these situations.",
    "photo1": {
      "id": "city-night",
      "title": "City at Night",
      "image": "https://images.unsplash.com/photo-1514565131-fce0801e5785?w=800"
    },
    "photo2": {
      "id": "study-group",
      "title": "Study Group",
      "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people in places with lots of other people around. The first one shows a busy city street at night with crowds everywhere. The second photo shows students working together in a library. In both situations, people are sharing the same space.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening" }
          ]
        },
        {
          "step": "differences",
          "text": "But the social situations are totally different. In the city, nobody really knows each other - it's just random people walking past. It's quite impersonal. But the students are clearly friends working together. They're talking and helping each other. The city is about being alone even though you're with people, but the library is about real connection.",
          "vocabulary": [
            { "phrase": "But the social situations are totally different", "usage": "Introducing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "How might people be feeling? In the busy city, I think it's mixed. Some people probably feel excited by all the lights and energy. But others might feel overwhelmed or even lonely even though there are so many people around. Everyone's just going somewhere and not really connecting. The students probably feel quite different - maybe a bit stressed about their work, but they also feel supported because they have friends there. Studying in a group makes you feel less alone when things are difficult.",
          "vocabulary": [
            { "phrase": "I think it's mixed", "usage": "Speculation" },
            { "phrase": "might feel", "usage": "Modal speculation" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show people in shared spaces. The first depicts a crowded city street at night, while the second shows students collaborating in a library. What they have in common is that people are surrounded by others in both situations.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Opening" },
            { "phrase": "What they have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the social dynamics are very different. While the urban setting involves strangers with no connection to each other, the library shows friends supporting one another. Another key difference is that the city feels anonymous and impersonal, whereas the study group represents genuine social bonds.",
          "vocabulary": [
            { "phrase": "However, the social dynamics are very different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for how people might be feeling, I'd say in the city scene, emotions are probably mixed. Some individuals might feel energized by the vibrant atmosphere, while others could feel overwhelmed or isolated despite the crowds. In the study group, on the other hand, I imagine students feel a combination of academic stress and social support. The presence of friends probably makes the pressure more manageable.",
          "vocabulary": [
            { "phrase": "As for how people might be feeling", "usage": "Addressing topic" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "might feel", "usage": "Modal speculation" },
            { "phrase": "could feel", "usage": "Possibility" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "I imagine", "usage": "Speculation" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see people in crowded environments. The first shows a busy urban street at night, while the second depicts students working together in a library. One thing both situations share is that individuals are physically close to other people.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing both situations share", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, the quality of social interaction differs dramatically. The city represents anonymous coexistence with strangers, whereas the library shows meaningful connection between friends. It seems to me that the urban scene is about isolation within crowds, while the study group is about genuine companionship.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding their feelings, I imagine people in the city might experience various emotions. Some could feel excited by the urban energy and lights, while others might feel lonely or anxious despite being surrounded by people. As for the students, I reckon they're probably feeling academic pressure, but the support of their friends helps. It's likely that working together makes the stress more bearable. What's more, having company during difficult tasks probably reduces feelings of isolation.",
          "vocabulary": [
            { "phrase": "Regarding their feelings", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "could feel", "usage": "Possibility" },
            { "phrase": "might feel", "usage": "Modal speculation" },
            { "phrase": "As for the students", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's likely that", "usage": "Probability" },
            { "phrase": "What's more", "usage": "Adding information" }
          ]
        }
      ]
    }
  },
  {
    "id": "entertainment-choices",
    "question": "Compare the two photographs and say why the people might have chosen to spend their time in these ways.",
    "photo1": {
      "id": "cinema",
      "title": "Cinema",
      "image": "https://images.unsplash.com/photo-1489599849927-2ee91cede3ba?w=800"
    },
    "photo2": {
      "id": "board-games",
      "title": "Board Games",
      "image": "https://images.unsplash.com/photo-1610890716171-6b1bb98ffd09?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people having fun and relaxing. In the first one, people are watching a movie at the cinema. In the second picture, a family is playing board games at home. In both cases, people are choosing entertainment to enjoy their free time.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening" }
          ]
        },
        {
          "step": "differences",
          "text": "But they're quite different types of entertainment. The cinema is a public place where you watch something that's been made for you. You're passive - you just sit and watch. Board games at home are totally different - you're active and you have to think and make decisions. Also, at the cinema you're with strangers, while board games are usually with family or close friends.",
          "vocabulary": [
            { "phrase": "But they're quite different", "usage": "Introducing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "So why might they have chosen these? I think people go to the cinema because they want to escape into a story and forget about their own lives for a couple of hours. The big screen and sound system make it really immersive. It's a special experience you can't get at home. The family playing board games probably chose this because they wanted to spend quality time together. Board games make you interact and talk with each other. Plus it's much cheaper than going out, and you can pause whenever you want.",
          "vocabulary": [
            { "phrase": "I think people go", "usage": "Speculation about motivation" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show people enjoying leisure activities. The first shows cinema-goers watching a film, while the second depicts a family playing board games at home. What these activities have in common is that people are using their free time for entertainment.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Opening" },
            { "phrase": "What these activities have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the forms of entertainment are quite different. While going to the cinema is a passive experience in a public venue, board gaming is active and interactive in a private setting. Another difference is that cinemas involve strangers sharing an experience, whereas board games typically involve close family or friends.",
          "vocabulary": [
            { "phrase": "However, the forms of entertainment are quite different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for why they chose these activities, I'd say cinema-goers probably want to escape reality through immersive storytelling. Perhaps they enjoy the experience of a big screen and surround sound that you can't replicate at home. The family with board games, on the other hand, likely prioritized spending quality time together. I imagine they wanted an activity that encourages conversation and interaction. Plus, it's more economical and flexible than going out.",
          "vocabulary": [
            { "phrase": "As for why they chose", "usage": "Addressing question" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "Perhaps", "usage": "Speculation" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "I imagine", "usage": "Speculation" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see people engaged in recreational activities. The first shows people at a cinema watching a movie, while the second depicts a family playing board games at home. One thing both situations have in common is that people are seeking entertainment during their leisure time.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing both situations have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, these are very different forms of recreation. Cinema involves passive consumption of media in a public commercial space, whereas board gaming requires active participation in a domestic setting. It seems to me that the social aspect also differs - cinemas involve anonymous crowds, while board games involve intimate family interaction.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding their motivations, I imagine cinema-goers are seeking escapism through high-quality visual storytelling. They might appreciate the immersive experience that only a theater can provide. As for the family playing board games, I reckon they wanted to strengthen family bonds through shared activity. It's possible they value face-to-face interaction over digital entertainment. What's more, board games offer flexibility and value for money compared to commercial entertainment.",
          "vocabulary": [
            { "phrase": "Regarding their motivations", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "They might appreciate", "usage": "Possibility" },
            { "phrase": "As for the family", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's possible", "usage": "Speculation" },
            { "phrase": "What's more", "usage": "Adding information" }
          ]
        }
      ]
    }
  },
  {
    "id": "shopping-experiences",
    "question": "Compare the two photographs and say what might be enjoyable or frustrating about shopping in these places.",
    "photo1": {
      "id": "shopping-mall",
      "title": "Shopping Mall",
      "image": "https://images.unsplash.com/photo-1519197924294-4ba991a11128?w=800"
    },
    "photo2": {
      "id": "local-market",
      "title": "Local Market",
      "image": "https://images.unsplash.com/photo-1555939594-58d7cb561ad1?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show places where people go shopping. The first one is a big modern shopping mall with lots of stores. The second picture shows a local market with individual stalls. In both situations, people are buying things they need or want.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening" }
          ]
        },
        {
          "step": "differences",
          "text": "But the shopping experiences are completely different. The mall is modern, clean, and organized with big chain stores. Everything has a fixed price and you can use your card. The market is much more traditional and authentic. It looks a bit messy and chaotic, with fresh produce and small vendors. You probably need cash and might have to bargain over prices.",
          "vocabulary": [
            { "phrase": "But the shopping experiences are completely different", "usage": "Main contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "What might be enjoyable or frustrating? In the mall, the good thing is it's convenient - everything's in one place, it's air-conditioned, and it's easy to find what you want. But it can feel impersonal and crowded, plus everything is quite expensive. At the market, the enjoyable part is the atmosphere - it's lively and you get fresh, local products. You can talk to the vendors and get a better deal. But it might be frustrating if it's too hot, crowded, or if you don't speak the language well enough to negotiate.",
          "vocabulary": [
            { "phrase": "the good thing is", "usage": "Identifying positive" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show shopping environments. The first depicts a modern shopping mall with multiple stores, while the second shows a traditional outdoor market. What they have in common is that both are places where consumers purchase goods.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Opening" },
            { "phrase": "What they have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the shopping experiences are very different. While the mall is modern and climate-controlled with chain retailers, the market is traditional and open-air with independent vendors. Another difference is that malls have fixed prices, whereas markets often involve price negotiation.",
          "vocabulary": [
            { "phrase": "However, the shopping experiences are very different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for what's enjoyable or frustrating, I'd say the mall offers convenience - everything in one location, comfortable climate, and easy transactions. However, it could feel impersonal and prices tend to be higher. The market, on the other hand, provides atmosphere and cultural experience. You might enjoy the fresh products and bargaining opportunities. Perhaps the frustrations would be the heat, crowds, or language barriers when negotiating prices.",
          "vocabulary": [
            { "phrase": "As for what's enjoyable or frustrating", "usage": "Addressing question" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "could feel", "usage": "Possibility" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "might enjoy", "usage": "Modal speculation" },
            { "phrase": "Perhaps", "usage": "Speculation" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see retail environments where shopping takes place. The first shows a contemporary shopping center, while the second depicts a traditional market setting. One thing both places have in common is that they serve as commercial spaces for buying and selling goods.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing both places have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, these retail environments differ significantly. The mall represents organized, standardized shopping, whereas the market embodies traditional, informal commerce. It seems to me that another key difference is pricing - malls use fixed prices, while markets typically involve negotiation.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding what might be enjoyable or frustrating, I imagine mall shoppers appreciate the convenience and comfort - centralized location, air conditioning, and straightforward purchasing. They might find it frustrating that it feels somewhat impersonal and prices are generally higher. As for the market, I reckon the enjoyable aspects would be the vibrant atmosphere and fresh, local products. It's possible that bargaining adds to the experience. What could be frustrating, though, is dealing with heat, navigating crowds, or struggling with language barriers during negotiations.",
          "vocabulary": [
            { "phrase": "Regarding what might be enjoyable", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "might find", "usage": "Modal speculation" },
            { "phrase": "As for the market", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's possible that", "usage": "Speculation" },
            { "phrase": "What could be frustrating", "usage": "Addressing negative" }
          ]
        }
      ]
    }
  },
  {
    "id": "exercise-activities",
    "question": "Compare the two photographs and say what the benefits might be of exercising in these different ways.",
    "photo1": {
      "id": "gym",
      "title": "Gym Exercise",
      "image": "https://images.unsplash.com/photo-1534438327276-14e5300c3a48?w=800"
    },
    "photo2": {
      "id": "outdoor-yoga",
      "title": "Outdoor Yoga",
      "image": "https://images.unsplash.com/photo-1544367567-0f2fcb009e0b?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people exercising and being active. In the first one, someone is working out at a gym using machines. In the second photo, people are doing yoga outside in a park. In both cases, people are taking care of their health and fitness.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening" }
          ]
        },
        {
          "step": "differences",
          "text": "But they're very different types of exercise. The gym workout is indoors and uses equipment - it's probably focused on building strength or losing weight. It looks intense and individual. The outdoor yoga is gentle and relaxing, done in nature with a group. One is about pushing your body hard, while the other is about flexibility and calmness.",
          "vocabulary": [
            { "phrase": "But they're very different types", "usage": "Introducing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "So what are the benefits? The gym is great for specific fitness goals - you can target certain muscles, track your progress, and work out whatever the weather. Plus there's usually a trainer who can help you. But it can be expensive and a bit boring. Outdoor yoga gives you fresh air and connection with nature, which is really good for mental health. It's also more social - you're part of a class. The downside is you can't do it when it's raining, and it might not give you the intense workout some people want.",
          "vocabulary": [
            { "phrase": "So what are the benefits?", "usage": "Addressing question" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show people engaged in physical exercise. The first depicts gym training with equipment, while the second shows outdoor yoga in a park. What they have in common is that both individuals are working on their physical fitness and wellbeing.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Opening" },
            { "phrase": "What they have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the exercise styles are quite different. While gym training is high-intensity and equipment-based, yoga is gentle and focuses on flexibility. Another difference is that the gym is indoors and individual, whereas yoga takes place outdoors in a group setting.",
          "vocabulary": [
            { "phrase": "However, the exercise styles are quite different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the benefits, I'd say gym training allows for targeted muscle development and measurable progress regardless of weather. Perhaps the advantage is having professional guidance available. However, it could be expensive and repetitive. Outdoor yoga, on the other hand, offers mental health benefits through nature connection and fresh air. I imagine the group atmosphere is motivating. The limitation might be weather dependence and lower cardiovascular intensity.",
          "vocabulary": [
            { "phrase": "As for the benefits", "usage": "Addressing question" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "Perhaps the advantage is", "usage": "Speculation" },
            { "phrase": "could be", "usage": "Possibility" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "might be", "usage": "Modal speculation" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see people doing physical exercise. The first shows gym-based strength training, while the second depicts outdoor yoga practice. One thing both activities share is their focus on improving physical health and fitness.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing both activities share", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, the approaches to fitness are very different. The gym represents intensive, equipment-based training in a controlled environment, whereas yoga embodies gentle, mindful movement in natural surroundings. It seems to me that the social element also differs - gym work appears solitary, while yoga is clearly a group activity.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the benefits, I imagine gym training offers targeted physical results and weather independence. Gym-goers might appreciate the ability to track progress and receive expert instruction. However, it could be costly and monotonous. As for outdoor yoga, I reckon the main benefits would be psychological - fresh air, nature exposure, and stress reduction. It's possible that the community aspect provides motivation. What might be limiting, though, is the weather dependency and potentially insufficient intensity for those seeking vigorous exercise.",
          "vocabulary": [
            { "phrase": "Regarding the benefits", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "might appreciate", "usage": "Modal speculation" },
            { "phrase": "could be", "usage": "Possibility" },
            { "phrase": "As for outdoor yoga", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's possible that", "usage": "Speculation" },
            { "phrase": "What might be limiting", "usage": "Addressing drawback" }
          ]
        }
      ]
    }
  },
  {
    "id": "eating-situations",
    "question": "Compare the two photographs and say what the experience might be like for the people in these situations.",
    "photo1": {
      "id": "restaurant-dining",
      "title": "Restaurant Dining",
      "image": "https://images.unsplash.com/photo-1517248135467-4c7edcad34c4?w=800"
    },
    "photo2": {
      "id": "street-food",
      "title": "Street Food",
      "image": "https://images.unsplash.com/photo-1555939594-58d7cb561ad1?w=800"
    },
    "styles": {
      "default": [
        {
          "step": "similarities",
          "text": "Both photos show people eating food in public places. In the first one, people are dining at a nice restaurant with tables and waiters. In the second picture, someone is getting street food from a market stall. In both situations, people are enjoying meals outside their homes.",
          "vocabulary": [
            { "phrase": "Both photos show", "usage": "Opening" }
          ]
        },
        {
          "step": "differences",
          "text": "But the dining experiences are completely different. The restaurant looks formal and expensive - you sit down, order from a menu, and get proper service. It's calm and sophisticated. The street food is much more casual and quick - you just grab something and eat it standing up or walking around. One is a full meal experience, while the other is more like a snack on the go.",
          "vocabulary": [
            { "phrase": "But the dining experiences are completely different", "usage": "Main contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "What might the experience be like? At the restaurant, people probably feel quite special and relaxed. It's a treat - maybe celebrating something or on a date. The atmosphere is nice, the food is presented beautifully, and you can take your time. But it's expensive and quite formal. With street food, the experience is much more authentic and spontaneous. You get to try local flavors, it's really cheap, and it's exciting. But it might not be as comfortable - you're standing, it might be hot and crowded, and you don't know if the food is safe.",
          "vocabulary": [
            { "phrase": "people probably feel", "usage": "Speculation about experience" }
          ]
        }
      ],
      "alternative1": [
        {
          "step": "similarities",
          "text": "These two pictures both show dining experiences outside the home. The first depicts a formal restaurant setting with table service, while the second shows street food consumption at a market stall. What these situations have in common is that people are eating commercially prepared food.",
          "vocabulary": [
            { "phrase": "These two pictures both show", "usage": "Opening" },
            { "phrase": "What these situations have in common", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "However, the dining contexts are very different. While the restaurant offers a formal, seated experience with full service, street food is informal and quick with minimal service. Another difference is that restaurants provide a calm, controlled environment, whereas street food vendors operate in busy, public spaces.",
          "vocabulary": [
            { "phrase": "However, the dining contexts are very different", "usage": "Contrast" },
            { "phrase": "While", "usage": "Contrasting" },
            { "phrase": "whereas", "usage": "Showing contrast" }
          ]
        },
        {
          "step": "answer_question",
          "text": "As for the experience, I'd say restaurant diners probably feel they're having a special occasion - perhaps celebrating or enjoying a romantic evening. The ambiance might make them feel relaxed and pampered. However, it could be quite expensive. Street food customers, on the other hand, likely experience cultural authenticity and excitement. I imagine they enjoy trying local specialties at low cost. Perhaps the drawbacks would be standing, heat, and uncertainty about food safety.",
          "vocabulary": [
            { "phrase": "As for the experience", "usage": "Addressing question" },
            { "phrase": "I'd say", "usage": "Opinion" },
            { "phrase": "might make them feel", "usage": "Modal speculation" },
            { "phrase": "could be", "usage": "Possibility" },
            { "phrase": "on the other hand", "usage": "Contrast" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "Perhaps", "usage": "Speculation" }
          ]
        }
      ],
      "alternative2": [
        {
          "step": "similarities",
          "text": "In both photographs we can see people consuming food outside their homes. The first shows formal dining in a restaurant, while the second depicts street food consumption at a market. One thing both situations share is that people are purchasing prepared meals from commercial vendors.",
          "vocabulary": [
            { "phrase": "In both photographs we can see", "usage": "Opening" },
            { "phrase": "One thing both situations share", "usage": "Similarity" }
          ]
        },
        {
          "step": "differences",
          "text": "On the other hand, the dining experiences differ dramatically. The restaurant embodies formal, leisurely dining with table service and structured atmosphere, whereas street food represents quick, casual consumption in an open-air setting. It seems to me that comfort levels also vary - restaurants offer seated comfort, while street food involves standing or walking.",
          "vocabulary": [
            { "phrase": "On the other hand", "usage": "Main contrast" },
            { "phrase": "whereas", "usage": "Contrasting" },
            { "phrase": "It seems to me that", "usage": "Opinion" }
          ]
        },
        {
          "step": "answer_question",
          "text": "Regarding the experience, I imagine restaurant patrons feel they're treating themselves to something special. They might be celebrating an occasion or enjoying a romantic evening. The refined atmosphere could make them feel valued and relaxed. However, it's likely to be expensive. As for street food consumers, I reckon they experience cultural immersion and culinary adventure. It's possible they enjoy the authentic local flavors at minimal cost. What might be challenging, though, is the lack of seating, potential heat and crowds, or concerns about hygiene.",
          "vocabulary": [
            { "phrase": "Regarding the experience", "usage": "Topic introduction" },
            { "phrase": "I imagine", "usage": "Speculation" },
            { "phrase": "might be celebrating", "usage": "Modal speculation" },
            { "phrase": "could make them feel", "usage": "Possibility" },
            { "phrase": "it's likely to be", "usage": "Probability" },
            { "phrase": "As for street food consumers", "usage": "Changing focus" },
            { "phrase": "I reckon", "usage": "Opinion" },
            { "phrase": "It's possible", "usage": "Speculation" },
            { "phrase": "What might be challenging", "usage": "Addressing negative" }
          ]
        }
      ]
    }
  }
]
