{
  "reports": [
    {
      "id": "school-facilities",
      "title": "Assessment of School Facilities",
      "topic": "School Facilities Assessment",
      "type": "Educational Assessment",
      "question": "Your school principal has asked you to write a report assessing the current school facilities and suggesting improvements.",
      "keyPoints": ["Describe the current condition of the facilities", "Explain what problems students face", "Recommend specific improvements"],
      "styles": {
        "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The purpose of this report is to assess</span> the current condition of school facilities and <span class=\"formal\">propose improvements</span> based on feedback from over 200 students. <span class=\"discourse\">This report covers</span> classrooms, the library, sports facilities and toilet areas.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Situation</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, the school facilities are <span class=\"formal\">generally adequate</span> but require attention in several areas. Classrooms are well-maintained and IT equipment was recently upgraded. <span class=\"discourse\">However</span>, the library suffers from limited seating capacity, particularly during exam periods. The sports hall is <span class=\"formal\">well-equipped</span>, though toilet facilities throughout the building are outdated.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\"><span class=\"discourse\">One major concern</span> expressed by students is the overcrowded library. <span class=\"discourse\">By far the worst aspect</span> is that there are insufficient study spaces when students need them most. <span class=\"discourse\">Another significant problem</span> is the condition of toilet facilities, which are outdated and require urgent modernization. Additionally, Wi-Fi coverage is weak in some areas, <span class=\"discourse\">which affects</span> students' ability to access online resources.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> extending library opening hours and adding more study desks and chairs. <span class=\"formal\">It is essential that</span> toilet facilities be renovated as a priority. <span class=\"recommend\">One key recommendation would be to</span> improve Wi-Fi coverage throughout the building. <span class=\"discourse\">Taking everything into account</span>, these improvements would <span class=\"formal\">significantly enhance</span> the learning environment for all students.</div></div>",
        "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an assessment of</span> current school facilities and identifies areas requiring investment. <span class=\"discourse\">The analysis draws upon</span> student feedback gathered through a structured survey (n=215) conducted in November 2024, supplemented by direct facility inspection.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Situation</div><div class=\"section-content\">School infrastructure <span class=\"formal\">exhibits variable quality across different areas</span>. Recent capital investment in classroom IT equipment has delivered positive outcomes, with all teaching spaces now featuring modern digital resources. The sports facility maintains appropriate equipment standards for curriculum delivery. <span class=\"discourse\">In contrast</span>, library provision operates beyond optimal capacity during examination periods, creating pressure on available study space. Sanitation facilities <span class=\"formal\">require comprehensive modernization</span>, while wireless network infrastructure proves inadequate in several building zones.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\">Student consultation reveals library overcrowding as the <span class=\"formal\">most significant operational challenge</span>. <span class=\"discourse\">During examination periods</span>, available seating proves insufficient for demand, <span class=\"discourse\">which negatively impacts</span> students' study capability. Toilet facilities, unchanged for over fifteen years, <span class=\"formal\">fail to meet contemporary standards</span> and constitute a priority maintenance concern. Wi-Fi coverage gaps in older building sections limit students' digital learning access. Building services data indicates heating inefficiency in pre-2000 construction areas, <span class=\"discourse\">resulting in</span> suboptimal learning temperatures during winter months.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Immediate priority should be assigned to</span> toilet facility modernization, representing both a maintenance imperative and student wellbeing concern. Library capacity constraints <span class=\"recommend\">could be addressed through</span> extended opening hours (until 17:30) and procurement of additional study furniture for examination periods. Wi-Fi infrastructure expansion <span class=\"formal\">merits capital investment</span> to support digital pedagogy requirements. <span class=\"discourse\">Overall</span>, these targeted improvements, estimated at £75,000 total capital expenditure, would <span class=\"formal\">deliver substantial quality-of-life enhancements</span> for the student population.</div></div>",
        "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Assessing our school facilities required me to</span> look beyond my personal experience and consider what truly serves a learning community. After consulting 215 students, patterns emerged that revealed not just practical concerns but deeper questions about what we value in education. This report examines our physical spaces and what they communicate about our priorities.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Situation</div><div class=\"section-content\">Our classrooms tell a story of investment and care - modern technology, maintained spaces, thoughtful design. Teachers and students alike benefit from these choices. <span class=\"discourse\">Yet walking from</span> these well-resourced rooms to our library reveals a contradiction. The library, meant to be the heart of learning, operates beyond capacity. <span class=\"discourse\">During exam periods</span>, watching students compete for study space, I wondered: what does it mean to value education if we don't provide space for it? Our toilet facilities, unchanged since the 1990s, speak to deferred maintenance becoming accepted neglect.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\">The library crisis transcends furniture shortage - it represents a philosophical question about student autonomy. We encourage independent study while providing insufficient space for it. <span class=\"discourse\">This contradiction creates</span> stress that undermines learning itself. The toilet situation raises dignity concerns; functional facilities aren't luxury but basic respect. The Wi-Fi gaps in older building sections create a two-tier system where <span class=\"discourse\">location determines</span> access to digital resources, <span class=\"vocabulary\">inadvertently creating inequality</span> in educational opportunity. These aren't merely inconveniences; they're messages about whose comfort and success we prioritize.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose we reframe these recommendations</span> not as facility improvements but as investments in educational philosophy. Extended library hours and increased study spaces demonstrate that we genuinely support independent learning. Toilet modernization affirms that student dignity matters. Universal Wi-Fi access ensures equitable opportunity regardless of classroom location. <span class=\"discourse\">These changes would cost</span> approximately £75,000, yet <span class=\"discourse\">the return exceeds</span> financial calculation - we would be stating clearly that our physical environment should match our educational aspirations. <span class=\"formal\">Sometimes the most important improvements</span> are the ones that show we've been listening all along.</div></div>"
      }
    },
    {
      "id": "exchange-programme",
      "title": "Evaluation of Spain Exchange Programme",
      "topic": "Exchange Programme Evaluation",
      "type": "Educational Review",
      "question": "You recently participated in a two-week student exchange programme in Spain.",
      "keyPoints": ["Describe the accommodation and school activities", "Explain what you learned", "Recommend whether to continue"],
      "styles": {
        "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The aim of this report is to evaluate</span> the two-week student exchange programme in Valencia, Spain. <span class=\"discourse\">This report is based on</span> my experience and feedback from 15 participating students during March 2025.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Accommodation & Activities</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, host families were <span class=\"formal\">exceptionally welcoming</span> and encouraged Spanish conversation at mealtimes. We attended daily Spanish lessons and participated in cultural activities including museums and theatre. <span class=\"discourse\">Additionally</span>, sports exchanges with local students helped integration.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Learning Outcomes</div><div class=\"section-content\"><span class=\"discourse\">One major benefit</span> was that conversation skills improved dramatically through real-world practice. Students gained confidence using language authentically. <span class=\"discourse\">The most valuable aspect was</span> immersive learning that classroom instruction cannot replicate. We developed international friendships and understood Spanish culture firsthand.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> continuing this programme as language benefits far exceed classroom learning. <span class=\"recommend\">To optimize outcomes</span>, pre-departure lessons would help. <span class=\"formal\">It is essential that</span> host family communication be improved beforehand. <span class=\"discourse\">Taking everything into account</span>, this represents invaluable educational value.</div></div>",
        "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an evaluation of</span> the student exchange programme conducted in Valencia, Spain, March 2025. <span class=\"discourse\">The analysis draws upon</span> participant observation and consultation with all 15 students.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Accommodation & Activities</div><div class=\"section-content\">Host family placement proved <span class=\"formal\">highly successful</span>, with families demonstrating exceptional hospitality and language immersion commitment. Daily instructional sessions provided structured development, while cultural programming delivered authentic contextual learning. Sports integration facilitated informal acquisition and cross-cultural relationships.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Learning Outcomes</div><div class=\"section-content\"><span class=\"discourse\">The programme delivered substantial value</span> across multiple dimensions. Linguistic competency metrics showed measurable improvement, with fluency advancing markedly. Participant confidence in authentic language application increased significantly. <span class=\"discourse\">The immersive context enabled</span> cultural understanding that conventional instruction cannot replicate.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Continuation is strongly advised</span>. Benefits <span class=\"formal\">substantially exceed</span> traditional methodologies. <span class=\"recommend\">To optimize outcomes</span>, enhanced pre-departure preparation is recommended. Improved host family communication protocols would facilitate transition. <span class=\"discourse\">In conclusion</span>, this represents exceptional value and <span class=\"formal\">merits continued investment</span>.</div></div>",
        "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating Valencia's exchange</span> requires examining not just what we learned, but who we became. Two weeks immersed in Spanish life taught lessons about learning itself - how we grow beyond comfort zones, how connection transcends barriers.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Accommodation & Activities</div><div class=\"section-content\">Living with the García family revealed education happens everywhere - at dinner tables, through shared laughter over mistakes. <span class=\"discourse\">Their patience</span> created safety to fail, essential for learning. Morning lessons scaffolded grammar, but Valencia wanderings - museums, theatre, sports courts where teenagers speak universal competition language - taught what textbooks cannot.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Learning Outcomes</div><div class=\"section-content\">Measurable gains - fluency, vocabulary, confidence - matter less than discovering I could navigate unfamiliar territory and emerge changed. <span class=\"discourse\">Each day</span> presented victories: ordering coffee, understanding jokes, explaining thoughts. These accumulated into transformation. Friendships taught that connection requires vulnerability, mistakes invite learning, humanity shares more than divides.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I advocate passionately for continuation</span> - it delivers education in its truest sense. <span class=\"recommend\">One enhancement involves</span> deeper pre-departure preparation, helping students understand challenge creates growth. Better host communication eases uncertainty. <span class=\"discourse\">But the truth remains:</span> this offers what traditional education misses - becoming more fully ourselves through encountering others.</div></div>"
      }
    },
    {
      "id": "sports-facilities",
      "title": "Assessment of Local Sports Centre",
      "topic": "Sports Centre Evaluation",
      "type": "Community Assessment",
      "question": "Your local council is considering investing in sports facilities for young people.",
      "keyPoints": ["Describe existing facilities", "Explain needed improvements", "Recommend changes for young users"],
      "styles": {
        "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The purpose of this report is to assess</span> current sports centre facilities and <span class=\"formal\">propose improvements</span> based on survey data from 120 young people aged 14-18. <span class=\"discourse\">This report covers</span> equipment quality, accessibility, and usage patterns.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Existing Facilities</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, basketball courts are in reasonable condition and the football pitch is well-maintained. The swimming pool remains popular despite being dated. <span class=\"discourse\">However</span>, gym equipment is limited and old, while tennis courts are rarely used due to poor surface quality.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Improvements Needed</div><div class=\"section-content\"><span class=\"discourse\">One major concern</span> raised by users is outdated gym equipment. Opening hours don't suit school schedules, finishing at 8pm when students need evening access. <span class=\"discourse\">Another significant problem</span> is membership prices being too high for teenagers. The absence of online booking creates accessibility barriers.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> modernizing gym equipment as urgent priority. <span class=\"formal\">It is essential that</span> opening hours extend until 9pm to accommodate students. <span class=\"recommend\">One key recommendation would be</span> introducing student discount schemes. Implementing mobile booking would improve accessibility. <span class=\"discourse\">Taking everything into account</span>, these changes would double youth participation.</div></div>",
        "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an assessment of</span> local sports centre provision for youth demographics (14-18 years). <span class=\"discourse\">The analysis draws upon</span> survey data from 120 respondents and facility utilization metrics.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Existing Facilities</div><div class=\"section-content\">Court-based provision (basketball, football) maintains satisfactory standards. Aquatic facilities demonstrate continued popularity despite infrastructure aging. <span class=\"discourse\">In contrast</span>, resistance training equipment <span class=\"formal\">exhibits significant deterioration</span>, operating below contemporary fitness standards. Tennis court surfaces have degraded beyond safe usage parameters.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Improvements Needed</div><div class=\"section-content\">User consultation identifies equipment modernization as primary concern. Operating hours terminating at 20:00 create accessibility barriers for student demographics with academic commitments. Pricing structures <span class=\"formal\">exceed youth affordability thresholds</span> at current membership rates. Digital booking infrastructure absence limits service accessibility and planning capability.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Immediate priority should be assigned to</span> resistance training equipment replacement. Extended operating hours until 21:00 would substantially improve student accessibility. <span class=\"recommend\">Implementation of</span> youth-focused pricing (approximately £15 monthly) addresses financial barriers. Mobile application development for booking services represents essential digital infrastructure investment. <span class=\"discourse\">Overall</span>, these interventions would demonstrably increase youth participation rates.</div></div>",
        "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Assessing our sports centre</span> requires asking deeper questions: what does community investment in youth fitness communicate about values? After surveying 120 teenagers, I see facilities revealing priorities - where we invest, where we neglect, whom we serve.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Existing Facilities</div><div class=\"section-content\">Courts function well, pool serves its purpose despite age. <span class=\"discourse\">But the gym tells a different story</span> - equipment breaking, outdated, neglected. It whispers we don't value youth fitness enough to maintain basic standards. Tennis courts, abandoned and cracking, suggest resources allocated elsewhere. These spaces communicate messages whether we intend them or not.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Improvements Needed</div><div class=\"section-content\">Equipment age matters less than what it represents - years of deferring youth investment. <span class=\"discourse\">Closing at 8pm</span> when students need 9pm access reveals misunderstanding teenage schedules. Pricing excluding most young people creates fitness as privilege, not public good. No digital booking in 2025 suggests we haven't considered how young people actually organize their lives.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing these</span> not as facility improvements but as value statements. Modern gym equipment says youth fitness matters. Extended hours acknowledge student realities. Affordable pricing declares fitness is right, not luxury. Digital booking respects how young people function. <span class=\"discourse\">These changes would cost money</span> but the return transcends participation metrics - we'd be demonstrating that young people's wellbeing genuinely matters to us.</div></div>"
      }
    },
    {
      "id": "school-trip",
      "title": "Evaluation of Educational Trip to Bath",
      "topic": "School Trip Evaluation",
      "type": "Educational Event",
      "question": "Your class recently went on a three-day educational trip to a historical city.",
      "keyPoints": ["Describe accommodation and activities", "Explain what students enjoyed and problems", "Recommend improvements"],
      "styles": {
        "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The aim of this report is to evaluate</span> the three-day educational trip to Bath for 32 Year 10 students in November 2024. <span class=\"discourse\">This report is based on</span> student feedback and direct observation of organized activities.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Accommodation & Activities</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, the youth hostel was clean and comfortable with adequate meal provision. The Roman Baths tour proved highly informative and engaging. <span class=\"discourse\">Additionally</span>, library workshops were well-organized and walking tours around historical sites provided excellent learning opportunities.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Feedback & Problems</div><div class=\"section-content\">Students particularly enjoyed the Roman Baths experience and photography opportunities. <span class=\"discourse\">However</span>, the hostel location created problems - excessive travel time between accommodation and sites wasted valuable learning hours. <span class=\"discourse\">Another significant issue</span> was that some workshops ran too long for the age group, causing disengagement.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> booking accommodation closer to the city centre for future trips. <span class=\"formal\">It is essential that</span> workshop sessions be shortened to 45 minutes maximum. <span class=\"recommend\">One key recommendation would be</span> allowing students choice at mealtimes and including free time for exploration. <span class=\"discourse\">Overall</span>, the trip should continue with these adjustments.</div></div>",
        "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an evaluation of</span> the three-day educational excursion to Bath, November 2024, involving 32 Year 10 students. <span class=\"discourse\">The analysis draws upon</span> participant feedback and pedagogical outcome assessment.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Accommodation & Activities</div><div class=\"section-content\">Residential provision met basic standards with satisfactory hygiene and meal service. The Roman Baths guided tour delivered high-quality historical education with strong participant engagement. Library-based workshops provided structured skill development. Urban walking tours facilitated architectural and historical contextual learning across multiple periods.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Feedback & Problems</div><div class=\"section-content\">Student consultation reveals the Roman Baths visit as <span class=\"formal\">the most educationally valuable component</span>, generating sustained engagement and learning retention. <span class=\"discourse\">However</span>, accommodation geographical positioning created significant logistical inefficiency, with transport consuming approximately two hours daily. Workshop duration exceeded optimal attention span parameters for this demographic, <span class=\"discourse\">resulting in</span> reduced educational effectiveness.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Strategic priority should be assigned to</span> securing centrally-located accommodation to maximize educational contact time. Workshop sessions <span class=\"recommend\">should be restructured to</span> 45-minute maximum duration aligned with adolescent cognitive engagement patterns. Enhanced meal choice autonomy would improve participant satisfaction. <span class=\"recommend\">Implementation of</span> supervised independent exploration periods would develop student autonomy whilst maintaining safety protocols. <span class=\"discourse\">Overall</span>, continuation with these modifications is recommended.</div></div>",
        "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating our Bath trip</span> means examining not just logistics but what transforms learning from obligation to discovery. Three days away revealed how place, immersion, and autonomy create education exceeding any classroom possibility.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Accommodation & Activities</div><div class=\"section-content\">The hostel met physical needs - beds, meals, shelter. <span class=\"discourse\">But the Roman Baths</span> met intellectual hunger I hadn't known existed. Standing where Romans stood collapsed temporal distance. Engineering feats millennia old still functioning taught humility about human capability. Workshops attempted skill transfer, walking tours provided context. Yet something about mandated group movement felt constraining.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Feedback & Problems</div><div class=\"section-content\">The Baths united us in wonder - that moment when past becomes present, when history transforms from dates to human stories. <span class=\"discourse\">Yet hours on buses</span> reminded us learning happens in places, and distance steals time. Long workshops revealed the paradox: education requires structure but also freedom. We needed guided learning but also space to discover independently, to pursue curiosity where it leads rather than prescribed paths.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing trip planning</span> around maximizing meaningful engagement time. Central accommodation isn't luxury but respecting that travel time is learning time lost. Shorter workshops acknowledge attention as resource requiring strategic deployment. Meal choice and free exploration time recognize we learn through agency, not just compliance. <span class=\"discourse\">These changes would create</span> trips that balance guidance with autonomy - teaching us not just history but how to be learners who discover actively rather than receive passively.</div></div>"
      }
    },
    {
      "id": "library-services",
      "title": "Assessment of School Library Services",
      "topic": "Library Services Evaluation",
      "type": "Educational Resource Review",
      "question": "Your school librarian has asked you to write a report evaluating current library services and suggesting improvements.",
      "keyPoints": ["Describe current resources and services", "Explain what works well and problems", "Recommend specific improvements"],
      "styles": {
        "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The purpose of this report is to assess</span> current library services and <span class=\"formal\">propose improvements</span> based on feedback from 180 students. <span class=\"discourse\">This report covers</span> book collection, study spaces, opening hours, and digital resources.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Services</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, the fiction collection is excellent with recent releases regularly updated. Study spaces are well-designed with appropriate lighting and quiet zones. <span class=\"discourse\">However</span>, non-fiction resources are outdated, particularly science and technology sections. Digital subscription services are underutilized due to poor promotion.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\"><span class=\"discourse\">One major concern</span> is insufficient seating during exam periods when demand exceeds capacity. <span class=\"discourse\">The most significant problem</span> is closing at 4pm, preventing students from using the library after sports or clubs. Printing services are expensive and frequently malfunction. The catalogue system requires modernization.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> extending opening hours until 5:30pm minimum. <span class=\"formal\">It is essential that</span> non-fiction collections be updated, prioritizing STEM subjects. <span class=\"recommend\">One key recommendation would be</span> promoting digital resources through tutorials. Adding mobile charging stations and improving printing reliability would enhance usability. <span class=\"discourse\">Taking everything into account</span>, these changes would increase library usage significantly.</div></div>",
        "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an assessment of</span> school library provision and identifies enhancement opportunities. <span class=\"discourse\">The analysis draws upon</span> survey data from 180 student users across Years 7-11.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Services</div><div class=\"section-content\">Fiction collection maintenance demonstrates high standards with regular acquisition of contemporary titles. Study environment provision meets appropriate standards regarding lighting, acoustics, and zoning. <span class=\"discourse\">In contrast</span>, non-fiction holdings <span class=\"formal\">exhibit significant obsolescence</span>, particularly within STEM disciplines. Digital resource subscriptions remain underutilized due to insufficient user education.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\">Capacity constraints during examination periods create access barriers, with seating provision insufficient for demand peaks. Operating hours terminating at 16:00 conflict with extracurricular scheduling (16:30 conclusion), <span class=\"discourse\">which prevents</span> post-activity library access. Printing infrastructure demonstrates reliability concerns whilst pricing structures exceed student affordability thresholds. Catalogue system interface requires modernization to improve user experience.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Extended operating hours until 17:30 represent</span> essential accessibility improvement. Non-fiction collection renewal <span class=\"formal\">merits priority investment</span>, focusing on STEM subject areas. <span class=\"recommend\">Implementation of</span> digital resource training sessions would optimize subscription value. Infrastructure enhancement including mobile device charging facilities and printing system reliability improvements would substantially enhance user experience. <span class=\"discourse\">Overall</span>, these interventions would demonstrably increase library utilization metrics.</div></div>",
        "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating our library</span> means examining what we value about learning spaces. Libraries represent more than book repositories - they're statements about knowledge accessibility, study culture, student autonomy. This report considers both practical improvements and philosophical questions about what libraries should be.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Services</div><div class=\"section-content\">The fiction collection demonstrates someone cares - contemporary, diverse, refreshed. Study spaces designed thoughtfully tell students their learning comfort matters. <span class=\"discourse\">Yet the science section</span>, frozen in time with decade-old resources, whispers different priorities. Digital subscriptions sitting unused suggest we acquire resources without ensuring accessibility - investment without education about value.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\"><span class=\"discourse\">Insufficient exam-period seating</span> creates something deeper than inconvenience - it communicates that when stress peaks and we need sanctuary most, space runs out. Early closing when activities end late reveals misunderstanding student rhythms. Expensive, unreliable printing treats necessity as luxury. Complex catalogues suggest we forgot libraries should reduce barriers to knowledge, not create them.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing library improvements</span> as investments in learning philosophy. Extended hours acknowledge student schedules deserve accommodation. Updated non-fiction declares all subjects merit current resources, not just popular ones. Digital resource training recognizes access requires education. Charging stations and reliable printing affirm we understand modern learning tools. <span class=\"discourse\">These aren't merely service improvements</span> - they're statements that libraries should remove obstacles between students and knowledge, creating spaces where learning feels supported, not frustrated.</div></div>"
      }
    },
  {
  "id": "work-experience",
  "title": "Evaluation of Work Experience Programme",
  "topic": "Work Experience Assessment",
  "type": "Vocational Programme Review",
  "question": "Your school runs a one-week work experience programme for Year 10 students.",
  "keyPoints": ["Describe placement types and organization", "Explain benefits and problems encountered", "Recommend improvements for next year"],
  "styles": {
    "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The aim of this report is to evaluate</span> the one-week work experience programme for Year 10 students in October 2024. <span class=\"discourse\">This report is based on</span> feedback from 95 participating students across various placement sectors.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Placements & Organization</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, students secured placements in diverse sectors including retail, healthcare, education, engineering, and media. Most placements were well-organized with clear tasks and supervision. <span class=\"discourse\">However</span>, finding placements proved difficult for students without family connections, creating inequality.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Benefits & Problems</div><div class=\"section-content\"><span class=\"discourse\">One major benefit</span> was gaining insight into workplace culture and professional expectations. Students developed practical skills and improved confidence. <span class=\"discourse\">The most significant problem</span> was that some placements involved minimal meaningful activity, essentially observing rather than participating. Travel costs created financial barriers for some families.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> the school developing a placement database to ensure equal access. <span class=\"formal\">It is essential that</span> placement providers receive clear guidelines about student involvement expectations. <span class=\"recommend\">One key recommendation would be</span> offering travel subsidies for students facing financial hardship. Pre-placement preparation sessions would improve outcomes. <span class=\"discourse\">Overall</span>, with these improvements, the programme offers excellent career insight.</div></div>",
    
    "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an evaluation of</span> the Year 10 work experience programme conducted October 2024. <span class=\"discourse\">The analysis draws upon</span> consultation with 95 participants across diverse vocational sectors.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Placements & Organization</div><div class=\"section-content\">Participant distribution spanned multiple sectors including retail, healthcare, education, engineering, and media. Organizational standards varied, with most placements demonstrating adequate supervision and task allocation. <span class=\"discourse\">However</span>, placement acquisition processes <span class=\"formal\">revealed significant inequity</span>, favoring students with established familial professional networks.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Benefits & Problems</div><div class=\"section-content\">Programme participation delivered valuable workplace culture exposure and professional expectation understanding. Participants reported practical skill development and enhanced self-efficacy. <span class=\"discourse\">Conversely</span>, quality variation proved problematic, with some placements offering minimal meaningful engagement - participants functioning as observers rather than active contributors. Financial accessibility barriers emerged through transport cost requirements.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Implementation of</span> a centrally-managed placement database would address equity concerns regarding opportunity access. <span class=\"formal\">It is essential that</span> placement providers receive explicit guidelines defining appropriate student involvement parameters. <span class=\"recommend\">Financial barrier mitigation through</span> travel subsidy provision is recommended. Pre-placement orientation sessions would optimize participant preparedness. <span class=\"discourse\">In conclusion</span>, with these enhancements, the programme represents valuable career development infrastructure.</div></div>",
    
    "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating work experience</span> requires examining not just what students learn, but what the programme reveals about opportunity structures. Who gets meaningful placements? Whose networks open doors? What messages do we send about fairness and access?</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Placements & Organization</div><div class=\"section-content\">Students scattered across sectors, some finding enriching experiences, others settling for whatever proved available. <span class=\"discourse\">This variation</span> exposed uncomfortable truth - placement quality often reflected family connections rather than student merit or interest. Those with professional networks accessed opportunities; others navigated rejection and compromise. Organizational quality varied accordingly.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Benefits & Problems</div><div class=\"section-content\">At its best, work experience delivers irreplaceable learning - workplace culture understanding, skill development, confidence building. <span class=\"discourse\">Yet when some students</span> gain meaningful responsibility while others spend weeks observing passively, we're not providing equal educational opportunity. Financial barriers further compound inequality - students whose families can't afford travel costs face additional obstacles. These aren't minor inconveniences; they're systemic issues about who gets to benefit.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing programme design</span> around equity principles. A school-maintained placement database ensures opportunity access reflects student interest, not family networks. Clear provider guidelines about meaningful engagement transform passive observation into active learning. Travel subsidies acknowledge financial barriers shouldn't determine educational access. Pre-placement preparation helps everyone start equally informed. <span class=\"discourse\">These changes recognize</span> that work experience's value depends not just on its existence, but on whether it's genuinely accessible to everyone.</div></div>"
  }
},
{
  "id": "cafeteria-services",
  "title": "Assessment of School Cafeteria Services",
  "topic": "Cafeteria Services Evaluation",
  "type": "Student Services Review",
  "question": "The school principal has asked you to evaluate cafeteria services and suggest improvements.",
  "keyPoints": ["Describe current food options and service", "Explain student satisfaction and problems", "Recommend specific changes"],
  "styles": {
    "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The purpose of this report is to assess</span> school cafeteria services and <span class=\"formal\">propose improvements</span> based on survey feedback from 240 students. <span class=\"discourse\">This report covers</span> food quality, variety, pricing, and service efficiency.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Situation</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, the cafeteria offers hot meals, sandwiches, salads, and snacks. Service staff are friendly and helpful. <span class=\"discourse\">However</span>, queues during lunch periods are excessive, often exceeding 15 minutes. Vegetarian and vegan options remain limited, and portion sizes are inconsistent.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\"><span class=\"discourse\">One major concern</span> is that healthy options are significantly more expensive than less nutritious alternatives. <span class=\"discourse\">The most significant problem</span> is lunch period timing - with 800 students sharing 45 minutes, queues consume valuable eating time. Students with dietary requirements face limited suitable choices.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> implementing staggered lunch periods to reduce queue pressure. <span class=\"formal\">It is essential that</span> vegetarian and vegan options be substantially increased. <span class=\"recommend\">One key recommendation would be</span> pricing healthy options competitively with less nutritious foods. Adding self-service stations and mobile payment options would improve efficiency. <span class=\"discourse\">Taking everything into account</span>, these changes would enhance student satisfaction considerably.</div></div>",
    
    "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an assessment of</span> school cafeteria provision and identifies service optimization opportunities. <span class=\"discourse\">The analysis draws upon</span> comprehensive survey data from 240 student users across all year groups.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Situation</div><div class=\"section-content\">Menu provision encompasses hot meal options, sandwich selections, salad variations, and supplementary snack items. Service personnel demonstrate appropriate customer service standards. <span class=\"discourse\">However</span>, capacity constraints during peak service periods generate queue times exceeding 15 minutes. Vegetarian and plant-based dietary provision <span class=\"formal\">remains insufficiently developed</span>. Portion control consistency requires standardization.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\">Pricing structures create nutritional disincentives, with healthier alternatives commanding premium prices relative to less nutritious options. Service capacity limitations prove <span class=\"formal\">fundamentally inadequate</span> for student population (800 users, 45-minute window), <span class=\"discourse\">resulting in</span> significant opportunity cost regarding consumption time. Dietary requirement accommodation demonstrates deficiencies across vegetarian, vegan, and allergen-sensitive categories.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Implementation of</span> staggered lunch period scheduling represents critical capacity management intervention. Vegetarian and plant-based menu expansion <span class=\"formal\">merits immediate prioritization</span>. Pricing strategy realignment to eliminate nutritional access barriers is recommended. <span class=\"recommend\">Introduction of</span> self-service infrastructure and contactless payment systems would substantially enhance service efficiency. <span class=\"discourse\">Overall</span>, these modifications would demonstrably improve user satisfaction metrics and operational effectiveness.</div></div>",
    
    "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating our cafeteria</span> means examining what daily food service reveals about institutional priorities. Do we value student wellbeing? Time? Dietary diversity? Equity? The cafeteria answers these questions whether we intend it or not.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Situation</div><div class=\"section-content\">Staff work hard under impossible conditions, their friendliness deserving recognition. Menu variety exists on paper. <span class=\"discourse\">Yet the system's design</span> creates failure - 800 students, 45 minutes, insufficient service points. Mathematics guarantees frustration. Limited vegetarian options suggest certain dietary choices matter less. Portion inconsistency introduces randomness where fairness should exist.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Problems Identified</div><div class=\"section-content\"><span class=\"discourse\">The pricing structure troubles me philosophically</span> - charging more for nutritious food effectively taxes healthy choices. What message does this send? Lunch period timing reveals planning that ignores student experience. When queues consume most of break time, we're communicating that student time has minimal value. Dietary accommodation gaps suggest we've imagined a default student rather than embracing actual diversity.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing cafeteria design</span> around respect principles. Staggered lunches respect that humans need adequate eating time. Expanded dietary options respect that students have varied needs deserving equal accommodation. Equitable pricing respects that nutrition shouldn't be financially penalized. Service improvements respect that student time matters. <span class=\"discourse\">These aren't merely operational fixes</span> - they're statements about whether we genuinely value student wellbeing or merely claim to while designing systems that contradict that claim.</div></div>"
  }
},
{
  "id": "environmental-initiative",
  "title": "Evaluation of School Environmental Initiative",
  "topic": "Environmental Programme Assessment",
  "type": "Sustainability Project Review",
  "question": "Your school has introduced environmental initiatives to reduce waste and energy consumption.",
  "keyPoints": ["Describe current initiatives", "Explain student participation and results", "Recommend further actions"],
  "styles": {
    "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The aim of this report is to evaluate</span> environmental initiatives introduced in September 2024 and <span class=\"formal\">assess their effectiveness</span>. <span class=\"discourse\">This report is based on</span> participation data and feedback from 200 students across all year groups.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Initiatives</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, the school has implemented recycling bins in all classrooms, introduced a bike-to-school scheme, and installed energy-efficient lighting. Student eco-committee meets weekly to develop sustainability projects. <span class=\"discourse\">Additionally</span>, plastic water bottles have been banned, replaced by water fountains.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Participation & Results</div><div class=\"section-content\"><span class=\"discourse\">One major success</span> has been recycling uptake - waste reduction reached 35% within two months. The bike scheme attracted 40 regular participants. <span class=\"discourse\">However</span>, energy consumption reduction remains minimal due to students leaving lights on. Eco-committee participation is limited to already-engaged students rather than broader involvement.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> installing automatic light sensors to optimize energy savings. <span class=\"formal\">It is essential that</span> environmental education be integrated into all subjects, not isolated to science. <span class=\"recommend\">One key recommendation would be</span> creating incentive schemes to broaden eco-committee participation. Introducing composting for cafeteria waste would further reduce environmental impact. <span class=\"discourse\">Overall</span>, these initiatives show promise with targeted improvements.</div></div>",
    
    "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an evaluation of</span> environmental sustainability initiatives implemented September 2024. <span class=\"discourse\">The analysis draws upon</span> quantitative participation metrics and qualitative feedback from 200 student respondents.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Initiatives</div><div class=\"section-content\">Implemented measures encompass comprehensive recycling infrastructure, active travel incentivization through bicycle schemes, LED lighting installation, weekly eco-committee operations, and single-use plastic elimination with hydration station provision. These initiatives demonstrate <span class=\"formal\">institutional commitment to</span> environmental sustainability objectives aligned with national carbon reduction targets.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Participation & Results</div><div class=\"section-content\">Waste management initiatives have delivered quantifiable success, achieving 35% reduction within two-month implementation period. Active travel participation demonstrates modest uptake (40 regular participants). <span class=\"discourse\">However</span>, energy conservation objectives <span class=\"formal\">remain substantially unrealized</span> due to behavioral compliance deficiencies regarding lighting protocols. Eco-committee engagement demonstrates limited demographic reach, attracting predominantly pre-committed environmental advocates.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Implementation of</span> motion-sensor lighting systems would eliminate behavioral compliance dependencies. Curriculum integration of sustainability education across all subject disciplines <span class=\"formal\">merits strategic prioritization</span>. <span class=\"recommend\">Development of</span> participation incentive structures would broaden eco-committee engagement demographics. Organic waste composting infrastructure represents logical programme expansion. <span class=\"discourse\">Overall</span>, these enhancements would substantially optimize environmental impact outcomes.</div></div>",
    
    "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating environmental initiatives</span> requires examining not just ecological metrics but what they reveal about collective values. Can institutional change inspire personal transformation? Does performative action lead to genuine commitment? These questions matter as much as recycling percentages.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Initiatives</div><div class=\"section-content\">We've implemented tangible changes - recycling infrastructure, bike schemes, efficient lighting, eco-committees, plastic elimination. <span class=\"discourse\">These represent</span> more than environmental tactics; they're pedagogical tools teaching that systems change when communities commit. Each recycling bin whispers that individual actions aggregate into collective impact. The bike racks demonstrate alternatives to convenience culture.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Participation & Results</div><div class=\"section-content\">The 35% waste reduction proves hope isn't naive - tangible change happens when infrastructure meets will. <span class=\"discourse\">Yet the energy savings failure</span> reveals deeper truth: technology alone won't save us. Efficient lights blazing in empty rooms suggest we've addressed symptoms without changing underlying behaviors. Eco-committee insularity shows how easily environmental action becomes subcultural rather than universal, enthusiasts preaching to themselves.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing environmental work</span> as cultural transformation, not technical fixes. Automatic sensors acknowledge human fallibility while enabling better outcomes. Curriculum integration recognizes sustainability as lens for understanding everything - not isolated science topic but framework for ethical economics, historical responsibility, mathematical modeling. Broadened eco-participation transforms environmental action from identity marker to community norm. Composting teaches that waste is human concept, not natural law. <span class=\"discourse\">These changes would recognize</span> that environmental crisis demands not just different practices but different thinking.</div></div>"
  }
},
{
  "id": "youth-club",
  "title": "Assessment of Local Youth Club Facilities",
  "topic": "Youth Club Evaluation",
  "type": "Community Services Review",
  "question": "Your local council wants to improve youth club facilities for teenagers.",
  "keyPoints": ["Describe current facilities and activities", "Explain what teenagers want", "Recommend specific improvements"],
  "styles": {
    "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The purpose of this report is to assess</span> current youth club provision and <span class=\"formal\">identify improvement opportunities</span> based on consultation with 150 teenagers aged 13-17. <span class=\"discourse\">This report covers</span> facilities, activities, accessibility, and desired enhancements.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Facilities</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, the youth club offers a games room with table tennis and pool, a small music studio, and a lounge area with sofas. Weekly activities include sports nights, creative workshops, and film screenings. <span class=\"discourse\">However</span>, opening hours are limited to three evenings weekly, and the building requires significant modernization.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Teenager Feedback</div><div class=\"section-content\"><span class=\"discourse\">One major request</span> is for improved technology - faster Wi-Fi, gaming consoles, and music production equipment. Teenagers want more frequent opening hours, particularly weekends. <span class=\"discourse\">The most significant concern</span> is that current activities don't reflect diverse interests, focusing heavily on sports while neglecting arts, technology, and social activities.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> extending opening to five evenings plus Saturday afternoons. <span class=\"formal\">It is essential that</span> technology infrastructure be upgraded with modern equipment. <span class=\"recommend\">One key recommendation would be</span> diversifying activities to include coding clubs, art workshops, and debate societies. Creating a dedicated quiet study space would attract exam-focused students. <span class=\"discourse\">Taking everything into account</span>, these improvements would substantially increase youth club attendance.</div></div>",
    
    "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an assessment of</span> local youth club provision and identifies enhancement opportunities. <span class=\"discourse\">The analysis draws upon</span> consultation with 150 adolescent users aged 13-17 years.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Facilities</div><div class=\"section-content\">Existing provision comprises recreational gaming facilities (table tennis, pool), limited music production infrastructure, and informal social spaces. Programming includes weekly sports activities, periodic creative workshops, and film exhibition. <span class=\"discourse\">However</span>, operational hours <span class=\"formal\">demonstrate significant limitations</span> (three evenings weekly), while physical infrastructure exhibits deterioration requiring capital investment.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Teenager Feedback</div><div class=\"section-content\">Consultation reveals technology infrastructure inadequacy as primary concern - bandwidth limitations, gaming console absence, and music equipment obsolescence. Operational hour expansion emerges as critical accessibility requirement, particularly weekend provision. <span class=\"discourse\">Activity programming</span> demonstrates insufficient diversity, <span class=\"formal\">over-representing</span> athletic pursuits while underserving artistic, technological, and intellectual engagement preferences.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Operational hour expansion to</span> five evenings plus Saturday afternoon sessions represents fundamental accessibility improvement. Technology infrastructure modernization <span class=\"formal\">merits immediate capital allocation</span>. <span class=\"recommend\">Programme diversification incorporating</span> coding instruction, artistic workshops, and debate forums would address demographic engagement gaps. Dedicated study facility provision would serve examination-focused users. <span class=\"discourse\">Overall</span>, these interventions would substantially enhance utilization metrics and community value.</div></div>",
    
    "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating youth club provision</span> requires examining what public investment in teenage spaces communicates about societal priorities. Do we genuinely value adolescent development? Create spaces reflecting who teenagers actually are? These questions matter beyond facility assessments.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Current Facilities</div><div class=\"section-content\">We offer minimum infrastructure - games, music space, lounging area. Activities happen but feel programmatic rather than organic. <span class=\"discourse\">Three evenings weekly operation</span> suggests teenagers are afterthought rather than priority. The building's deterioration whispers that teenage needs merit minimal investment. These aren't just logistical deficiencies; they're value statements about whose wellbeing matters.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Teenager Feedback</div><div class=\"section-content\">Technology gaps reveal generational disconnect - we inhabit digital worlds yet our designated space operates pre-smartphone assumptions. Weekend closure ignores teenage temporal realities. <span class=\"discourse\">Activity homogeneity</span> troubles me philosophically - who decided teenagers equal sports enthusiasts? This programming reflects stereotypes rather than diverse humanity. We're artists, coders, debaters, scholars, not monolithic demographic requiring identical provision.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing youth provision</span> as investment in human potential rather than containment of teenage energy. Extended hours acknowledge adolescents deserve accessible community spaces. Modern technology respects how we actually live and learn. Diversified programming recognizes teenage heterogeneity deserving multiple pathways for connection, growth, and belonging. Study space provision validates that development includes intellectual ambition. <span class=\"discourse\">These aren't facility improvements</span> - they're philosophical statements that teenage flourishing matters enough to genuinely support it.</div></div>"
  }
},
{
  "id": "language-course",
  "title": "Evaluation of Saturday French Course",
  "topic": "Language Course Assessment",
  "type": "Educational Course Review",
  "question": "You attend a Saturday French conversation course at a local language school.",
  "keyPoints": ["Describe the course content and teaching", "Explain strengths and weaknesses", "Recommend improvements for future courses"],
  "styles": {
    "default": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">The aim of this report is to evaluate</span> the Saturday French conversation course running from September to December 2024. <span class=\"discourse\">This report is based on</span> my personal experience and discussions with the 18 students attending regularly.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Course Content & Teaching</div><div class=\"section-content\"><span class=\"discourse\">At present</span>, classes focus on practical conversation through role-plays, debates, and cultural discussions. The teacher, a native speaker, creates an encouraging atmosphere. <span class=\"discourse\">However</span>, skill levels vary significantly within the group, making it challenging to pitch activities appropriately for everyone.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Strengths & Weaknesses</div><div class=\"section-content\"><span class=\"discourse\">The greatest strength</span> is authentic French exposure with a native speaker providing natural language models. Small class size enables personal attention. <span class=\"discourse\">The main weakness</span> is insufficient grammar support - conversation practice alone doesn't address systematic language building. Limited homework means students don't practice between sessions.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I would strongly recommend</span> dividing the class by proficiency level to optimize learning for all abilities. <span class=\"formal\">It is essential that</span> grammar instruction be integrated systematically within conversation practice. <span class=\"recommend\">One key recommendation would be</span> introducing weekly homework assignments to reinforce learning. Providing digital resources for independent study would enhance course value. <span class=\"discourse\">Overall</span>, the course offers excellent foundation with targeted improvements needed.</div></div>",
    
    "professional": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"formal\">This report presents an evaluation of</span> the Saturday French conversation course, September-December 2024 session. <span class=\"discourse\">The analysis draws upon</span> participant observation and consultation with 18 regular attendees.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Course Content & Teaching</div><div class=\"section-content\">Pedagogical methodology emphasizes communicative competence through role-play simulation, structured debate, and cultural discourse. Instruction delivery by native francophone creates authentic language exposure. <span class=\"discourse\">However</span>, heterogeneous proficiency distribution within participant cohort <span class=\"formal\">creates significant pedagogical challenges</span> regarding appropriate activity calibration.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Strengths & Weaknesses</div><div class=\"section-content\">Primary strength resides in authentic target language exposure, with native speaker instruction providing natural linguistic modeling and cultural authenticity. Reduced class size facilitates individualized pedagogical attention. <span class=\"discourse\">Principal weakness</span> concerns insufficient systematic grammar instruction - conversational practice alone <span class=\"formal\">proves inadequate for</span> comprehensive linguistic competence development. Homework absence eliminates inter-session reinforcement opportunities.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">Implementation of</span> proficiency-based cohort stratification would optimize instructional effectiveness across ability spectrum. <span class=\"formal\">Integration of systematic grammatical instruction</span> within communicative framework is essential. <span class=\"recommend\">Introduction of</span> weekly assignment protocols would enhance knowledge retention and skill consolidation. Digital resource provision for autonomous study would substantially augment course value. <span class=\"discourse\">Overall</span>, with these modifications, the programme demonstrates strong pedagogical potential.</div></div>",
    
    "formal": "<div class=\"report-section\"><div class=\"section-heading\">Introduction</div><div class=\"section-content\"><span class=\"discourse\">Evaluating this French course</span> means examining how we learn languages beyond classroom mechanics. What transforms vocabulary into communication? Structure into expression? Fear into confidence? Four months have taught me about learning itself, not just French.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Course Content & Teaching</div><div class=\"section-content\">Marie creates space where mistakes feel safe rather than shameful - revolutionary for language learning. Role-plays and debates force authentic usage rather than recitation. <span class=\"discourse\">Yet the mixed ability reality</span> reveals language education's central tension: how to honor individual starting points while moving everyone forward? Some of us soar while others struggle, neither group fully served.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Strengths & Weaknesses</div><div class=\"section-content\">Native speaker instruction gives us real French - idioms, rhythms, cultural context textbooks sanitize away. Small classes enable genuine relationships accelerating learning. <span class=\"discourse\">But conversation-only methodology</span> feels incomplete. I'm fluently wrong, speaking confidently with systematic errors nobody corrects. The week-long silences between classes allow forgetting to erase progress. We need both freedom to speak and structure to improve.</div></div>\n\n<div class=\"report-section\"><div class=\"section-heading\">Recommendations</div><div class=\"section-content\"><span class=\"recommend\">I propose reframing course design</span> around dual principles: authentic communication and systematic development. Ability grouping respects that learning happens in zones slightly beyond current capacity. Grammar integration provides scaffolding conversation needs. Homework bridges weekly gaps where knowledge dissipates. Digital resources enable self-directed growth honoring learner autonomy. <span class=\"discourse\">These aren't merely practical fixes</span> - they're philosophical statements that language learning requires both courage to speak imperfectly and discipline to improve systematically.</div></div>"
   }
  }
 ]
}  
