{
  "educational": {
    "title": "Educational Report",
    "purpose": "Reports on educational facilities, programs, or learning initiatives.",
    "sections": {
      "introduction": {
        "label": "A: Introduction & Context",
        "purpose": "State the purpose, scope, and explain how information was gathered.",
        "examples": [
          {
            "variation": 1,
            "text": "The purpose of this report is to provide an overview of all the upper-intermediate English courses available at Madeiran language schools. The relevant information was obtained by contacting the directors of studies of all such schools registered on the island."
          },
          {
            "variation": 2,
            "text": "This report aims to summarise all the upper-intermediate English courses available at Madeiran language schools. It is based on the answers to a short questionnaire sent to the directors of studies of all such schools registered on the island."
          },
          {
            "variation": 3,
            "text": "This report aims to examine the role of computers in my secondary school. The relevant information was obtained by interviewing students and observing computer use during lessons."
          },
          {
            "variation": 4,
            "text": "The main purpose of this report is to determine to what extent advertising influences shopping habits in Funchal. The data was obtained by conducting a survey of local shoppers."
          },
          {
            "variation": 5,
            "text": "The primary aim of this report is to demonstrate how the new youth club has affected my leisure time. It is based on my own observations and interviews with other members."
          },
          {
            "variation": 6,
            "text": "This report seeks to assess the effects of tourism on our traditional handicrafts. It is based on the answers to a written questionnaire distributed to local artisans."
          },
          {
            "variation": 7,
            "text": "This report is intended to outline the importance of the internet in the local library. It is based on feedback from a sample of library users."
          },
          {
            "variation": 8,
            "text": "The purpose of this report is to evaluate the school canteen service. It is based on the results of an opinion poll carried out among pupils and staff."
          }
        ]
      },
      "neutral": {
        "label": "B: Neutral General Views",
        "purpose": "Present balanced, objective observations without strong praise or criticism.",
        "examples": [
          {
            "variation": 1,
            "text": "It is generally agreed that the new computer lab meets the basic requirements for ICT lessons. Most students acknowledge that the equipment is modern and the room is adequately equipped, although there are mixed views about whether the current number of computers is sufficient for class sizes."
          },
          {
            "variation": 2,
            "text": "On the whole, the school library facilities are considered acceptable by most users. The general consensus is that while the book collection covers essential topics, there is room for expansion in certain subject areas. Students report moderate satisfaction with the opening hours and study spaces available."
          },
          {
            "variation": 3,
            "text": "Feedback suggests that the after-school study programme serves its intended purpose for most participants. It was noted that the programme operates within reasonable parameters, providing adequate supervision and a quiet environment. The prevailing view is that it functions satisfactorily for students who need extra study time."
          },
          {
            "variation": 4,
            "text": "Most respondents felt that the sports facilities were adequate for current needs. There appears to be broad recognition that the gymnasium and outdoor areas meet basic standards, though opinions vary on whether additional equipment would be beneficial."
          }
        ]
      },
      "praising": {
        "label": "C: Praising",
        "purpose": "Highlight specific strengths, successes, and positive aspects.",
        "examples": [
          {
            "variation": 1,
            "text": "One thing that worked really well was the new science laboratory equipment. Students were particularly impressed by the modern microscopes and the interactive whiteboard, which made practical lessons far more engaging. A definite strength was the way teachers incorporated technology into experiments, allowing students to record and analyse results digitally."
          },
          {
            "variation": 2,
            "text": "By far the best aspect of the new canteen is the variety of healthy food options available. Many students highlighted the salad bar and fresh fruit station as outstanding features. What makes the service particularly valuable is the speed of service during lunch breaks, meaning students have more time to eat and socialise."
          },
          {
            "variation": 3,
            "text": "The highlight was the school trip to Lisbon, which many participants mentioned enthusiastically. It is worth noting that the educational value exceeded expectations, with students praising the guided tours of historical sites. Particularly noteworthy is the way the trip brought history lessons to life, making abstract concepts tangible and memorable."
          },
          {
            "variation": 4,
            "text": "It should be emphasized that the peer tutoring scheme represents a significant achievement for the school. The quality of student mentors was consistently praised by younger pupils. Feedback was overwhelmingly positive regarding the supportive atmosphere created, with many students reporting improved confidence in challenging subjects."
          }
        ]
      },
      "criticising": {
        "label": "D: Criticising",
        "purpose": "Identify specific problems, weaknesses, and areas requiring attention.",
        "examples": [
          {
            "variation": 1,
            "text": "It must be stated that many students object to the current library opening hours. This is mostly due to the fact that the library closes at 4pm, which completely excludes those involved in after-school activities. There is also some concern from parents, since many teenagers would benefit from a quiet study space in the early evening. One major issue was the lack of weekend access, mainly because this is when many students have time for extended research projects."
          },
          {
            "variation": 2,
            "text": "Many students have voiced their deep concern over the outdated computer equipment in the IT lab, as this will undoubtedly result in frustration when trying to run modern software. Similarly, this situation has drawn sharp criticism from teachers who have stressed the importance of preparing students for university-level technology. The ageing computers have prompted serious objections on the grounds that such equipment could bring a multitude of negative impacts on exam preparation."
          },
          {
            "variation": 3,
            "text": "However, a common complaint was that the sports hall is unavailable during lunch breaks. Unfortunately, this falls short in a key area, particularly regarding students who want to stay active throughout the day. A significant concern raised by many was the limited equipment available for team sports. Disappointingly, the changing facilities have not lived up to expectations, with several students mentioning poor ventilation and inadequate shower provision."
          },
          {
            "variation": 4,
            "text": "By far the worst aspect of the new timetable is the early start time for lessons. A major drawback is the 8am start, which impacts students who travel long distances. It must be acknowledged that this arrangement requires urgent attention, especially given that many teenagers struggle with early morning concentration."
          }
        ]
      },
      "recommending": {
        "label": "E: Recommending",
        "purpose": "Propose specific, actionable solutions and improvements.",
        "examples": [
          {
            "variation": 1,
            "text": "To improve the library situation, it would be a good idea to extend opening hours until at least 6pm on weekdays. If this change is made, it would help students because they could access resources after sports practice and clubs. Another option would be to open on Saturday mornings, which could provide valuable study time for those preparing for exams. A practical step would be to introduce a booking system for group study rooms, leading to better use of available space."
          },
          {
            "variation": 2,
            "text": "One simple way to fix the computer problem would be to replace the oldest machines first, prioritising the computers used for exam preparation. It is recommended that a rolling upgrade programme is introduced to deal with equipment obsolescence. In order to maximize the available budget, I would strongly recommend seeking donations from local businesses who regularly update their own IT systems."
          },
          {
            "variation": 3,
            "text": "The school should consider investing in new sports equipment to address student complaints. To prevent the issue from worsening, the changing facilities should be renovated during the summer holidays. An immediate improvement would be to allow lunchtime access to the sports hall, perhaps with a teacher supervision rota. If the school were to implement these changes, the benefits would include improved student wellbeing and higher participation in physical activities."
          },
          {
            "variation": 4,
            "text": "It would be advisable to reconsider the lesson start time, potentially moving it to 8:30am to allow for better concentration levels. To enhance the learning environment, a priority should be to survey students about their sleep patterns and travel times before making final timetable decisions."
          }
        ]
      },
      "conclusion": {
        "label": "F: Conclusion",
        "purpose": "Summarise key points, synthesize findings, and provide final perspective.",
        "examples": [
          {
            "variation": 1,
            "text": "The overall conclusion is that there is widespread student support for any measures that would help to improve the library facilities. While the initial cost of extending opening hours would require additional staffing, it is reasonable to expect that the resulting benefits to academic achievement would more than compensate for this within a year. Taking everything into account, the most important improvement would be weekend access for exam preparation."
          },
          {
            "variation": 2,
            "text": "Based on the facts presented above, I conclude that while the school facilities work well in many areas, the IT equipment needs urgent attention. In conclusion, the main strengths are the teaching staff and the modern science labs, while the biggest issue is outdated computer technology. Overall, these changes would make a real difference for students preparing for higher education."
          },
          {
            "variation": 3,
            "text": "To sum up, the findings clearly show that students value the new canteen service highly, but sports facilities require investment. All things considered, implementing the recommendations above would significantly enhance the school's appeal to prospective families. The evidence suggests that improved sports provision could increase student wellbeing and academic performance."
          },
          {
            "variation": 4,
            "text": "In summary, the peer tutoring scheme demonstrates considerable success and should be expanded. On balance, while there are areas requiring improvement, the school provides a generally positive learning environment. Looking ahead, the priority should be addressing the timetable concerns raised by distance learners."
          }
        ]
      }
    }
  },

  "community": {
    "title": "Community Report",
    "purpose": "Reports on community facilities, services, or local initiatives.",
    "sections": {
      "introduction": {
        "label": "A: Introduction & Context",
        "purpose": "Introduce the community issue and explain how information was gathered.",
        "examples": [
          {
            "variation": 1,
            "text": "The purpose of this report is to examine the proposed marina development at Praia do Norte. The relevant information was obtained by attending public consultation meetings and interviewing local residents, business owners, and environmental scientists."
          },
          {
            "variation": 2,
            "text": "This report aims to assess the impact of the new airport on local employment. It is based on the answers to a questionnaire distributed to businesses within a 20-kilometre radius and interviews with community leaders."
          },
          {
            "variation": 3,
            "text": "The main purpose of this report is to evaluate the effectiveness of the town's new recycling scheme. The data was obtained by conducting surveys of participating households and analysing council collection statistics."
          }
        ]
      },
      "neutral": {
        "label": "B: Neutral General Views",
        "purpose": "Present balanced observations about community facilities or services.",
        "examples": [
          {
            "variation": 1,
            "text": "Overall, most residents felt that the new bus service was adequate for basic transportation needs. On the whole, people acknowledged that the timetable covers essential commuting hours, though there were mixed opinions about evening and weekend provision. The general view is that the service meets minimum requirements for those without private transport."
          },
          {
            "variation": 2,
            "text": "Feedback suggests that the community centre functions at an acceptable standard for most activities. It was noted that while the facilities are suitable for smaller gatherings, capacity limitations become apparent during popular events. Most users acknowledged that the centre serves a useful purpose in providing a meeting space for local groups."
          }
        ]
      },
      "praising": {
        "label": "C: Praising",
        "purpose": "Highlight strengths and positive aspects of community provision.",
        "examples": [
          {
            "variation": 1,
            "text": "One strong point is that the new airport has created over 500 permanent jobs in the region. Residents particularly appreciated the opportunities for young people to find local employment without emigrating to the mainland. The highlight for many was the boost to tourism, with several small businesses reporting increased custom from visitors."
          },
          {
            "variation": 2,
            "text": "It is especially commendable that the recycling scheme has achieved an 85% participation rate within six months. Many community members praised the clear information provided and the convenient collection schedule. A notable success has been the reduction in landfill waste, which benefits the entire island's environment."
          }
        ]
      },
      "criticising": {
        "label": "D: Criticising",
        "purpose": "Identify community concerns and service deficiencies.",
        "examples": [
          {
            "variation": 1,
            "text": "It must be stated that many people object to the planned marina. This is mostly due to the fact that the development would completely destroy one of the best surfing sites in Europe. There is also some opposition from the scientific community, since the lagoon behind the site is a vital staging-point on the migration routes of several species of birds."
          },
          {
            "variation": 2,
            "text": "Many local people have voiced their deep concern over the proposed marina, as this will undoubtedly result in the destruction of one of the most sought-after surfing sites in Europe. Similarly, this plan has drawn sharp criticism from the scientific community who have stressed the importance of the region as a migratory route, in particular the lagoon behind the site."
          },
          {
            "variation": 3,
            "text": "The planned marina has prompted serious objections from local people on the grounds that such a project could bring a multitude of negative impacts on the surfing sites. The plan came under further criticism from the scientific community who emphasised the ecological significance of the coastal lagoon system."
          },
          {
            "variation": 4,
            "text": "However, a common complaint was the lack of parking near the community centre. Unfortunately, this creates significant difficulties for elderly residents and those with mobility issues. A persistent problem is the evening traffic congestion, which many locals attribute to poor planning when the centre was built."
          }
        ]
      },
      "recommending": {
        "label": "E: Recommending",
        "purpose": "Propose community improvements.",
        "examples": [
          {
            "variation": 1,
            "text": "To address environmental concerns, it would be advisable to commission an independent ecological impact assessment before proceeding with the marina plans. Local authorities should consider alternative locations that would not threaten the surfing beach or bird migration routes. If this change is made, it would benefit both the tourism industry and conservation efforts."
          },
          {
            "variation": 2,
            "text": "One practical solution would be to create a new car park on the vacant land adjacent to the community centre. The council should prioritise this development, as it would significantly improve access for all users. Another option would be to introduce a shuttle bus service from the town centre during peak times."
          }
        ]
      },
      "conclusion": {
        "label": "F: Conclusion",
        "purpose": "Summarise community findings and future outlook.",
        "examples": [
          {
            "variation": 1,
            "text": "The overall conclusion is that there is widespread local support for any measures that would help to stem the flight of young people from the area. While the initial cost of the new airport would be high, it is reasonable to expect that the resulting economic benefits would more than compensate for this within a few years."
          },
          {
            "variation": 2,
            "text": "Based on the facts presented above, I conclude there is widespread local support for any measures that would help to stem the flight of young people from the area. While the initial cost of the new airport would be high, it is reasonable to expect that the resulting economic benefits would more than compensate for this within a few years."
          },
          {
            "variation": 3,
            "text": "In conclusion, the marina proposal faces significant opposition on environmental and recreational grounds. To sum up, while economic development is important, the evidence suggests that alternative approaches would better serve the community's long-term interests. Taking everything into account, a thorough environmental impact assessment is essential before any decision is made."
          }
        ]
      }
    }
  }
}
