{
  "reports": [
    {
      "id": "school-facilities",
      "title": "Assessment of School Facilities",
      "topic": "School Facilities Assessment",
      "type": "Educational Assessment",
      "question": "Your school principal has asked you to write a report assessing the current school facilities and suggesting improvements.",
      "keyPoints": [
        "Describe the current condition of the facilities",
        "Explain what problems students face",
        "Recommend specific improvements"
      ],
      "styles": {
        "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to assess</span> the current school facilities. <span class='discourse'>This report is based on</span> a questionnaire conducted among over 200 students.</div></div>\n\n<div class='report-section'><div class='section-heading'>General View</div><div class='section-content'><span class='discourse'>It is generally agreed that</span> the school provides a pleasant learning environment. The classrooms are in good condition and <span class='discourse'>many students referred to</span> the new IT equipment as helpful for lessons. <span class='discourse'>By far the best aspect of</span> the facilities is the sports hall, which is modern and well-equipped.</div></div>\n\n<div class='report-section'><div class='section-heading'>Problems</div><div class='section-content'><span class='discourse'>However, one major concern expressed by students is</span> the overcrowded library. <span class='discourse'>By far the worst aspect of</span> the IT facilities is that machines frequently break down. The library <span class='discourse'>is far from ideal since</span> it lacks sufficient seating during exam periods. <span class='discourse'>This is mainly due to the fact that</span> student numbers have increased significantly.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> replace outdated computers with modern equipment. <span class='recommend'>In order to maximize study space, I would strongly recommend</span> adding more library seating. <span class='formal'>It is essential that</span> the school invests in covered outdoor areas. <span class='discourse'>Taking everything into account, it seems clear that</span> these improvements would significantly enhance the learning environment.</div></div>",
        "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> assessing school facilities and suggesting improvements. <span class='discourse'>The information presented was collected through</span> student surveys.</div></div>\n\n<div class='report-section'><div class='section-heading'>Positive Aspects</div><div class='section-content'><span class='discourse'>There is a broad consensus that</span> the school offers a good learning environment. <span class='discourse'>What makes the library so valuable is that</span> it provides a wide selection of resources. <span class='discourse'>One positive aspect of</span> the facilities is the sports hall. <span class='discourse'>The highlight of</span> the school is the recently upgraded IT equipment.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> many students is the overcrowded library during exams. Computer facilities <span class='discourse'>are far from ideal</span>, considering that machines often malfunction. The toilet facilities are outdated. <span class='discourse'>This is mainly because</span> no renovations have been done for over ten years.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If we were to improve facilities, one key recommendation would be to</span> modernize computer equipment urgently. <span class='recommend'>I would strongly recommend</span> extending library hours and adding more seating. <span class='recommend'>It is essential that</span> toilets are renovated soon.</div></div>\n\n<div class='report-section'><div class='section-heading'>Conclusion</div><div class='section-content'><span class='discourse'>The main conclusion to be drawn is that</span> while facilities are adequate, improvements are necessary. <span class='discourse'>To sum up</span>, these changes would benefit all students.</div></div>",
        "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate current facilities and propose improvements. <span class='discourse'>The findings in this report are drawn from</span> comprehensive feedback provided by 215 students.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the school provides satisfactory facilities. Classrooms are well-equipped. <span class='discourse'>There was broad agreement that</span> recent technology investments have been beneficial.</div></div>\n\n<div class='report-section'><div class='section-heading'>What Works Well</div><div class='section-content'><span class='discourse'>What made the sports facilities so successful was that</span> they are modern and well-maintained. <span class='discourse'>Many students referred to</span> the sports hall as the best feature.</div></div>\n\n<div class='report-section'><div class='section-heading'>Criticisms</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> numerous students involves library capacity. <span class='discourse'>The worst part of</span> using computers is that they crash frequently, <span class='discourse'>which affects</span> students' coursework completion. Toilet facilities require urgent attention.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> purchasing additional computers and library furniture. <span class='recommend'>One way to improve would be</span> extending library hours. <span class='recommend'>It would be advisable to</span> renovate toilets during summer.</div></div>\n\n<div class='report-section'><div class='section-heading'>Conclusion</div><div class='section-content'><span class='discourse'>In conclusion, as can be seen</span>, strategic improvements would enhance student experience. <span class='discourse'>Overall</span>, implementing these recommendations should be a priority.</div></div>"
      }
    },
   {
  "id": "exchange-programme",
  "title": "Evaluation of Exchange Programme in Spain",
  "topic": "Student Exchange Programme",
  "type": "Educational Experience Report",
  "question": "Write a report for your school about the exchange programme, describing what you learned and whether the school should continue it.",
  "keyPoints": [
    "Describe the accommodation and school activities",
    "Explain what you learned from the experience",
    "Recommend whether the school should continue the programme"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to assess</span> the two-week exchange programme in Spain and recommend whether it should continue. <span class='discourse'>This report is based on</span> feedback collected from participating students after the visit.</div></div>\n\n<div class='report-section'><div class='section-heading'>Accommodation and School Activities</div><div class='section-content'><span class='discourse'>It was generally felt that</span> host families were welcoming and provided comfortable accommodation. Students attended regular lessons, joined group projects and took part in cultural activities. <span class='discourse'>One positive aspect of</span> the programme was the supportive attitude of teachers, who encouraged students to participate actively.</div></div>\n\n<div class='report-section'><div class='section-heading'>What Students Learned</div><div class='section-content'><span class='discourse'>What made the experience so valuable is that</span> students had to communicate in Spanish every day in real-life situations. Many participants reported improved confidence, greater independence and a better understanding of Spanish culture. <span class='discourse'>As a result</span>, students became more willing to speak even when they made mistakes.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>I would strongly recommend</span> continuing the exchange programme because the educational benefits are clear. <span class='recommend'>One key recommendation would be to</span> organise more mixed-group activities after school so that visiting students spend more time together. <span class='discourse'>Taking everything into account, it seems clear that</span> the programme should be offered again next year.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> evaluating the exchange programme in Spain and deciding whether it should be continued. <span class='discourse'>The information presented was collected through</span> questionnaires and discussions with students and teachers.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths of the Programme</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> accommodation with host families was a major strength, as students felt safe and included in daily routines. School activities were well organised, and <span class='discourse'>one feature that was highly appreciated was</span> project work, which encouraged teamwork and communication. Cultural visits also helped students understand local traditions.</div></div>\n\n<div class='report-section'><div class='section-heading'>Learning Outcomes</div><div class='section-content'><span class='discourse'>The main conclusion to be drawn is that</span> students developed language confidence, independence and social skills. <span class='discourse'>What makes this programme especially effective is that</span> learners practise the language in authentic settings, which improves fluency and listening ability. Many participants also reported increased motivation to study Spanish on return.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>However, one major concern expressed by students is</span> that some participants had limited contact with other exchange students after lessons. <span class='discourse'>This is mainly due to the fact that</span> there were few organised afternoon activities. <span class='discourse'>As a result</span>, a small number of students felt isolated at times.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If the programme is continued, one key recommendation would be to</span> introduce regular mixed-group events such as sports sessions or city walks. <span class='recommend'>It is essential that</span> students receive clear guidance on meeting points, transport and emergency contacts. <span class='discourse'>To sum up</span>, the programme should continue, as the advantages clearly outweigh the difficulties.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the two-week exchange programme in Spain and recommend future action. <span class='discourse'>The findings in this report are drawn from</span> detailed feedback provided by participants and accompanying staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>Accommodation and Organisation</div><div class='section-content'><span class='discourse'>It was generally felt that</span> accommodation standards were high and host families provided considerable support. The school programme included regular lessons and structured activities. <span class='discourse'>There was broad agreement that</span> staff supervision and communication were effective throughout the visit.</div></div>\n\n<div class='report-section'><div class='section-heading'>Educational Value</div><div class='section-content'><span class='discourse'>What made the exchange particularly beneficial was that</span> students used Spanish continuously, both at school and in the community. Participants reported improved fluency, stronger listening skills and increased cultural awareness. <span class='discourse'>This has resulted in</span> greater confidence when speaking, even in unfamiliar situations.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> several students was the limited number of organised group activities after school. <span class='discourse'>The exchange is far from ideal since</span> some participants had little opportunity to socialise with their peers outside host-family settings, which affected overall satisfaction.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> scheduling daily mixed-group events, such as shared projects or guided visits. <span class='recommend'>It would be advisable to</span> provide a clear timetable and practical travel guidance before departure. <span class='formal'>It is essential that</span> the programme continues, as its educational benefits are significant.</div></div>\n\n<div class='report-section'><div class='section-heading'>Conclusion</div><div class='section-content'><span class='discourse'>In conclusion, as can be seen</span>, the exchange programme offers substantial language and personal development. <span class='discourse'>Overall</span>, continuing the programme should be considered a priority.</div></div>"
  }
},
    {
  "id": "sports-facilities",
  "title": "Assessment of Local Sports Facilities",
  "topic": "Sports Centre Evaluation",
  "type": "Community Facilities Report",
  "question": "Write a report assessing the local sports centre and suggesting improvements.",
  "keyPoints": [
    "Describe existing facilities and equipment",
    "Explain what improvements are needed",
    "Recommend specific changes for young users"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to assess</span> the local sports centre and suggest improvements for young users. <span class='discourse'>This report is based on</span> feedback collected from teenage members and occasional visitors.</div></div>\n\n<div class='report-section'><div class='section-heading'>Current Facilities</div><div class='section-content'><span class='discourse'>It is generally agreed that</span> the centre offers a good range of facilities, including a gym, a swimming pool and several courts for team sports. <span class='discourse'>One positive aspect of</span> the centre is the variety of group classes, such as dance fitness and beginner training sessions.</div></div>\n\n<div class='report-section'><div class='section-heading'>Problems</div><div class='section-content'><span class='discourse'>However, a common complaint relates to</span> overcrowding after 5 p.m., when many students arrive. <span class='discourse'>As a result</span>, users often have to wait for machines or leave early. <span class='discourse'>By far the worst aspect of</span> the centre is the changing rooms, which are small and outdated. <span class='discourse'>This is mainly due to the fact that</span> the building has not been renovated for several years.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> improve the changing rooms by adding lockers and increasing cleanliness checks. <span class='recommend'>In order to reduce</span> overcrowding, <span class='recommend'>it may be worth considering</span> student-only time slots or extending opening hours on weekdays. <span class='discourse'>Taking everything into account, it seems clear that</span> these changes would make the centre more attractive to young people.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> evaluating the local sports centre and proposing improvements aimed at teenage users. <span class='discourse'>The information presented was collected through</span> questionnaires and brief interviews with regular members.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> the centre provides good value for money and offers modern equipment in the gym area. <span class='discourse'>By far the best aspect of</span> the sports centre is the swimming pool, which is clean, well supervised and suitable for different ability levels. <span class='discourse'>One feature that was highly appreciated was</span> the range of weekly classes available at a reasonable price.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> teenage users concerns overcrowding in the gym during peak hours. The facilities <span class='discourse'>are far from ideal</span> at these times, as it is difficult to access popular machines. In addition, the changing rooms need attention. <span class='discourse'>This is mainly because</span> they are outdated and not designed for the current number of users.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If the council wishes to improve the service, one key recommendation would be to</span> introduce a booking system for busy hours and provide clearer information about quieter times. <span class='recommend'>I would strongly recommend</span> renovating the changing rooms and adding more lockers. <span class='discourse'>To sum up</span>, these changes would significantly improve the experience for young people.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the local sports centre and propose improvements for teenage users. <span class='discourse'>The findings in this report are drawn from</span> feedback provided by 120 young members and observations from staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the centre offers a wide range of activities, including swimming, fitness training and indoor sports. <span class='discourse'>There was broad agreement that</span> staff are professional and the gym equipment is largely in good condition.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> many respondents relates to overcrowding during weekday evenings. <span class='discourse'>The worst part of</span> using the gym at these times is that machines are often unavailable, <span class='discourse'>which affects</span> the quality of training. Furthermore, changing facilities require modernisation in order to meet current demands.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> introducing a booking system for peak hours and expanding beginner-friendly classes for teenagers. <span class='recommend'>It would be advisable to</span> renovate the changing rooms and improve locker availability. <span class='discourse'>In conclusion, as can be seen</span>, targeted improvements would significantly enhance the centre’s appeal for young users.</div></div>"
  }
},
{
  "id": "school-trip",
  "title": "Evaluation of Recent School Trip",
  "topic": "Educational School Trip",
  "type": "Educational Experience Report",
  "question": "Write a report about the recent school trip for your teacher.",
  "keyPoints": [
    "Describe accommodation and activities",
    "Explain what students enjoyed and any problems",
    "Recommend improvements for future trips"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to evaluate</span> the recent school trip and suggest improvements for future visits. <span class='discourse'>This report is based on</span> feedback collected from students and accompanying teachers.</div></div>\n\n<div class='report-section'><div class='section-heading'>Accommodation and Activities</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the accommodation was comfortable and suitable for a school group. The programme included guided tours, workshops and evening activities. <span class='discourse'>One positive aspect of</span> the trip was the variety of activities, which kept students engaged throughout the stay.</div></div>\n\n<div class='report-section'><div class='section-heading'>Problems and Enjoyment</div><div class='section-content'><span class='discourse'>By far the best aspect of</span> the trip was the interactive workshop, which helped students understand the topic more clearly. <span class='discourse'>However, a common complaint relates to</span> the long travel time, which caused tiredness on the first day. <span class='discourse'>As a result</span>, some students found it difficult to concentrate during afternoon activities.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> plan an earlier departure time to reduce fatigue. <span class='recommend'>In order to improve</span> the overall experience, <span class='recommend'>it may be worth considering</span> including more free time in the evening. <span class='discourse'>Taking everything into account, it seems clear that</span> the trip was successful but could be improved.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> assessing the organisation, accommodation and activities of the recent school trip. <span class='discourse'>The information presented was collected through</span> questionnaires completed by participating students.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths of the Trip</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> the accommodation met expectations and staff at the venue were helpful. <span class='discourse'>What made the trip particularly successful was that</span> activities were closely linked to subjects studied in class. Many students found the guided tour especially informative.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> students concerns the tight schedule, which allowed little time for rest. <span class='discourse'>This is mainly because</span> too many activities were planned in a short period. <span class='discourse'>Consequently</span>, some students felt exhausted by the end of the trip.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If similar trips are organised in the future, one key recommendation would be to</span> reduce the number of daily activities. <span class='recommend'>I would strongly recommend</span> including optional evening sessions so students can choose how to spend their time. <span class='discourse'>To sum up</span>, better pacing would greatly improve the experience.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the educational value of the recent school trip and propose improvements. <span class='discourse'>The findings in this report are drawn from</span> written feedback provided by students and staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> accommodation standards were satisfactory and safety procedures were well managed. <span class='discourse'>There was broad agreement that</span> the planned activities were relevant and educational.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> several participants relates to noise levels at night, which affected sleep. <span class='discourse'>The worst part of</span> the accommodation was the lack of clear quiet hours, <span class='discourse'>which resulted in</span> tiredness during morning sessions.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> setting clear rules regarding quiet time and staff supervision at night. <span class='recommend'>It would be advisable to</span> include a short briefing on behaviour before departure. <span class='discourse'>In conclusion, as can be seen</span>, small organisational changes would significantly improve future trips.</div></div>"
  }
},
{
  "id": "library-services",
  "title": "Assessment of School Library Services",
  "topic": "Library Services Review",
  "type": "Educational Facilities Report",
  "question": "Write a report assessing library services and suggesting improvements.",
  "keyPoints": [
    "Describe current services and opening hours",
    "Explain what is useful and what problems exist",
    "Recommend changes to improve the library"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to assess</span> current library services and suggest improvements. <span class='discourse'>This report is based on</span> feedback collected from students who regularly use the library.</div></div>\n\n<div class='report-section'><div class='section-heading'>Current Services</div><div class='section-content'><span class='discourse'>It is generally agreed that</span> the library provides a quiet and comfortable place for study. It offers a wide range of books, access to computers and space for group work. <span class='discourse'>One positive aspect of</span> the service is the helpful librarian, who supports students with research tasks.</div></div>\n\n<div class='report-section'><div class='section-heading'>Problems</div><div class='section-content'><span class='discourse'>However, one major concern expressed by students is</span> the limited number of seats during exam periods. <span class='discourse'>By far the worst aspect of</span> the service is the early closing time, which prevents many students from studying after school. <span class='discourse'>This is mainly due to the fact that</span> there is not enough staff to supervise longer hours.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> extend opening hours twice a week during exam periods. <span class='recommend'>In order to improve</span> study conditions, <span class='recommend'>it may be worth considering</span> adding more desks and chairs. <span class='discourse'>Taking everything into account, it seems clear that</span> these changes would benefit a large number of students.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> evaluating library services, resources and access. <span class='discourse'>The information presented was collected through</span> questionnaires completed by students from different year groups.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> the library is well organised and supports independent learning. <span class='discourse'>What makes the library so valuable is that</span> it offers both silent study areas and spaces for collaborative work. The digital resources are also widely used.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> students concerns outdated computers, which often freeze. The service <span class='discourse'>is far from ideal</span> during busy periods, as printing queues become long. <span class='discourse'>As a result</span>, students lose valuable study time.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If improvements are to be made, one key recommendation would be to</span> replace older computers and improve the printing system. <span class='recommend'>I would strongly recommend</span> providing short training sessions on using online academic resources. <span class='discourse'>To sum up</span>, these changes would significantly enhance the quality of library services.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the effectiveness of current library services and propose improvements. <span class='discourse'>The findings in this report are drawn from</span> detailed feedback provided by students and teaching staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the library plays an important role in supporting academic work. <span class='discourse'>There was broad agreement that</span> the range of textbooks and reference materials is appropriate for most subjects.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> many students involves limited seating and restricted access during peak times. <span class='discourse'>The worst part of</span> using the library at these times is the lack of available workspaces, <span class='discourse'>which affects</span> students' ability to revise effectively.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> reorganising the layout to create additional study areas. <span class='recommend'>It would be advisable to</span> extend opening hours before examinations. <span class='discourse'>In conclusion, as can be seen</span>, targeted improvements would significantly enhance student access and satisfaction.</div></div>"
  }
},
    {
  "id": "work-experience",
  "title": "Evaluation of Work Experience Placement",
  "topic": "Student Work Experience",
  "type": "Educational Experience Report",
  "question": "Write a report about your work experience placement for the school.",
  "keyPoints": [
    "Describe the company and your tasks",
    "Explain what skills you developed",
    "Recommend whether the placement should continue"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to evaluate</span> my recent work experience placement and recommend whether it should continue. <span class='discourse'>This report is based on</span> my daily observations and feedback from my supervisor.</div></div>\n\n<div class='report-section'><div class='section-heading'>Company and Tasks</div><div class='section-content'>The placement took place at a local company where I assisted staff with basic administrative tasks and customer service. <span class='discourse'>It was generally felt that</span> employees were supportive and willing to explain procedures. <span class='discourse'>One positive aspect of</span> the placement was being trusted with real responsibilities.</div></div>\n\n<div class='report-section'><div class='section-heading'>Skills Developed</div><div class='section-content'><span class='discourse'>What made the placement so valuable is that</span> I developed communication and teamwork skills in a real working environment. I also learned how to manage my time more effectively. <span class='discourse'>As a result</span>, I became more confident when dealing with unfamiliar tasks.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>I would strongly recommend</span> continuing this placement because it provides practical experience and prepares students for future employment. <span class='recommend'>One key recommendation would be to</span> introduce a wider variety of tasks so students remain motivated. <span class='discourse'>Taking everything into account, it seems clear that</span> the placement offers clear benefits.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> assessing the value of a recent work experience placement. <span class='discourse'>The information presented was collected through</span> feedback from supervisors and participating students.</div></div>\n\n<div class='report-section'><div class='section-heading'>Placement Overview</div><div class='section-content'>Students were placed in a range of local businesses and were involved in basic tasks such as organising materials and supporting staff. <span class='discourse'>There is broad agreement that</span> the placements provided a realistic insight into working life.</div></div>\n\n<div class='report-section'><div class='section-heading'>Learning Outcomes</div><div class='section-content'><span class='discourse'>By far the best aspect of</span> the placement was the opportunity to develop communication skills and workplace confidence. <span class='discourse'>However, one major concern expressed by students is</span> that some tasks became repetitive after several days. <span class='discourse'>As a result</span>, motivation decreased slightly towards the end.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If the programme is continued, one key recommendation would be to</span> encourage employers to provide a wider range of tasks. <span class='recommend'>It is essential that</span> students receive clear guidance and support throughout the placement. <span class='discourse'>To sum up</span>, the experience remains valuable despite minor issues.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the effectiveness of the work experience programme. <span class='discourse'>The findings in this report are drawn from</span> written feedback provided by students and employers.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the placement helped students understand workplace expectations. <span class='discourse'>There was broad agreement that</span> supervision was appropriate and tasks were suitable for students of this age.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> several participants relates to the limited variety of tasks in certain placements. <span class='discourse'>The worst part of</span> these placements was the lack of challenge, <span class='discourse'>which affects</span> student engagement and learning.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> setting clearer expectations for employers before placements begin. <span class='recommend'>It would be advisable to</span> include a short project task to encourage independent work. <span class='discourse'>In conclusion, as can be seen</span>, with small adjustments the programme should continue.</div></div>"
  }
},
 {
  "id": "cafeteria-services",
  "title": "Assessment of School Cafeteria Services",
  "topic": "Cafeteria Services Review",
  "type": "Educational Facilities Report",
  "question": "Write a report assessing the cafeteria and suggesting improvements.",
  "keyPoints": [
    "Describe current food options and service",
    "Explain main complaints from students",
    "Recommend specific improvements"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to assess</span> the school cafeteria and suggest improvements. <span class='discourse'>This report is based on</span> feedback collected from students who regularly use the service.</div></div>\n\n<div class='report-section'><div class='section-heading'>Current Services</div><div class='section-content'><span class='discourse'>It is generally agreed that</span> the cafeteria offers affordable meals and friendly service. There is a daily hot meal, as well as sandwiches and snacks. <span class='discourse'>One positive aspect of</span> the cafeteria is that it saves students time during the school day.</div></div>\n\n<div class='report-section'><div class='section-heading'>Problems</div><div class='section-content'><span class='discourse'>However, one major concern expressed by students is</span> the long queues at lunchtime. <span class='discourse'>By far the worst aspect of</span> the cafeteria is the limited seating, which forces some students to eat quickly or stand. <span class='discourse'>This is mainly due to the fact that</span> several year groups have lunch at the same time.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> introduce staggered lunch times to reduce queues. <span class='recommend'>In order to improve</span> comfort, <span class='recommend'>it may be worth considering</span> adding more tables or using an additional room for seating. <span class='discourse'>Taking everything into account, it seems clear that</span> these changes would improve student satisfaction.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> evaluating food quality, service efficiency and seating in the school cafeteria. <span class='discourse'>The information presented was collected through</span> questionnaires completed by students from different year groups.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> the cafeteria provides good value for money and that staff are polite and helpful. <span class='discourse'>What makes the service particularly useful is that</span> students have access to a hot meal every day.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> students relates to the lack of healthy options, such as fresh fruit and salads. The menu <span class='discourse'>is far from ideal</span> for those who want a balanced diet. <span class='discourse'>As a result</span>, many students choose snacks instead of full meals.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If improvements are to be made, one key recommendation would be to</span> introduce a wider range of healthy options. <span class='recommend'>I would strongly recommend</span> displaying nutritional information to help students make informed choices. <span class='discourse'>To sum up</span>, these changes would encourage healthier eating habits.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the effectiveness of cafeteria services and propose improvements. <span class='discourse'>The findings in this report are drawn from</span> detailed feedback provided by students and staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> food quality is acceptable and prices are reasonable. <span class='discourse'>There was broad agreement that</span> service is efficient outside peak times.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> many students involves overcrowding during lunch breaks. <span class='discourse'>The worst part of</span> the service is the lack of available seating, <span class='discourse'>which affects</span> students' ability to relax and eat properly.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> reorganising lunch schedules and expanding seating capacity. <span class='recommend'>It would be advisable to</span> review the menu and include more nutritious options. <span class='discourse'>In conclusion, as can be seen</span>, targeted improvements would greatly enhance the cafeteria experience.</div></div>"
  }
},
    {
  "id": "environmental-initiative",
  "title": "Evaluation of School Environmental Initiative",
  "topic": "Environmental Project Review",
  "type": "School Project Report",
  "question": "Write a report evaluating the school environmental project.",
  "keyPoints": [
    "Describe project activities and participation",
    "Explain achievements and difficulties",
    "Recommend whether to organize similar projects"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to evaluate</span> the recent school environmental initiative and recommend whether similar projects should be organised in the future. <span class='discourse'>This report is based on</span> feedback collected from students and teachers involved in the project.</div></div>\n\n<div class='report-section'><div class='section-heading'>Project Activities</div><div class='section-content'>The initiative included a recycling campaign, a litter-picking day and short presentations during form time. <span class='discourse'>It was generally felt that</span> student participation was high, particularly among younger year groups. <span class='discourse'>One positive aspect of</span> the project was the clear organisation of activities.</div></div>\n\n<div class='report-section'><div class='section-heading'>Achievements and Difficulties</div><div class='section-content'><span class='discourse'>By far the best aspect of</span> the initiative was the increased awareness of environmental issues among students. <span class='discourse'>However, one major concern expressed by participants is</span> that some recycling bins were not emptied regularly. <span class='discourse'>As a result</span>, this discouraged students from using them correctly.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> appoint a small eco-team to monitor recycling areas weekly. <span class='recommend'>In order to</span> increase motivation, <span class='recommend'>it may be worth considering</span> organising competitions between classes. <span class='discourse'>Taking everything into account, it seems clear that</span> similar projects should be repeated.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> assessing the effectiveness of the school environmental project. <span class='discourse'>The information presented was collected through</span> questionnaires completed by participating students and staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths of the Initiative</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> the project successfully raised awareness of environmental responsibility. <span class='discourse'>What made the initiative particularly effective is that</span> activities were practical and easy to join, such as recycling challenges and clean-up events.</div></div>\n\n<div class='report-section'><div class='section-heading'>Challenges</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> students relates to the lack of consistent support from all classes. <span class='discourse'>This is mainly because</span> some teachers were not fully informed about the project aims. <span class='discourse'>Consequently</span>, participation levels varied.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If similar initiatives are planned, one key recommendation would be to</span> provide clear guidelines for staff before the project begins. <span class='recommend'>I would strongly recommend</span> introducing a short assembly to explain objectives and encourage whole-school involvement. <span class='discourse'>To sum up</span>, the project was successful but could be improved.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the outcomes of the school environmental initiative and propose future action. <span class='discourse'>The findings in this report are drawn from</span> detailed feedback provided by student volunteers and teaching staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the project was well organised and achieved its main objectives. <span class='discourse'>There was broad agreement that</span> student awareness of recycling and waste reduction improved significantly.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> several participants involves insufficient resources, such as gloves and bags, during the clean-up day. <span class='discourse'>The worst part of</span> this situation was that some students were unable to participate fully, <span class='discourse'>which affected</span> overall engagement.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> preparing materials earlier and seeking support from local organisations. <span class='recommend'>It would be advisable to</span> involve the Student Council in planning future initiatives. <span class='discourse'>In conclusion, as can be seen</span>, repeating the project would be beneficial.</div></div>"
  }
},
    {
  "id": "youth-club",
  "title": "Assessment of Local Youth Club",
  "topic": "Youth Club Facilities and Activities",
  "type": "Community Facilities Report",
  "question": "Write a report assessing the youth club.",
  "keyPoints": [
    "Describe current activities and facilities",
    "Explain what works well and what needs improvement",
    "Recommend specific changes"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to assess</span> the local youth club and suggest improvements. <span class='discourse'>This report is based on</span> feedback collected from teenage users of the club.</div></div>\n\n<div class='report-section'><div class='section-heading'>Current Activities and Facilities</div><div class='section-content'>The youth club offers table tennis, board games, a small café area and occasional workshops. <span class='discourse'>It is generally agreed that</span> the club provides a safe place for teenagers to meet after school. <span class='discourse'>One positive aspect of</span> the club is the friendly and supportive staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>What Works Well and Problems</div><div class='section-content'><span class='discourse'>By far the best aspect of</span> the youth club is its relaxed atmosphere, which helps young people feel comfortable. <span class='discourse'>However, a common complaint relates to</span> the limited range of activities for older teenagers. <span class='discourse'>As a result</span>, many students stop attending after the age of sixteen.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> introduce activities aimed at older teenagers, such as music production or digital skills workshops. <span class='recommend'>In order to</span> increase participation, <span class='recommend'>it may be worth considering</span> allowing users to suggest and help organise activities. <span class='discourse'>Taking everything into account, it seems clear that</span> these changes would broaden the club’s appeal.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> evaluating the facilities, activities and overall atmosphere of the youth club. <span class='discourse'>The information presented was collected through</span> questionnaires and informal discussions with regular visitors.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> the youth club offers a safe and welcoming environment. <span class='discourse'>What makes the club particularly valuable is that</span> it provides supervised activities during the evening. The sports and games areas are especially popular with younger users.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> older teenagers concerns the poor condition of some equipment. Several items <span class='discourse'>are far from ideal</span>, as they are broken or outdated. <span class='discourse'>This has resulted in</span> frustration and reduced attendance.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If improvements are to be made, one key recommendation would be to</span> replace damaged equipment and improve seating areas. <span class='recommend'>I would strongly recommend</span> introducing a suggestion box or regular meetings so users can contribute ideas. <span class='discourse'>To sum up</span>, these steps would significantly improve satisfaction.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate how effectively the youth club meets the needs of local teenagers. <span class='discourse'>The findings in this report are drawn from</span> structured feedback provided by users and staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the club plays an important role in providing a safe social space. <span class='discourse'>There was broad agreement that</span> the facilities are suitable for younger teenagers but less appealing to older users.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> many respondents involves limited opening hours at weekends. <span class='discourse'>The worst part of</span> this situation is that teenagers often meet elsewhere instead, <span class='discourse'>which affects</span> the club’s role in the community.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> extending weekend opening hours and introducing sessions specifically for older teenagers. <span class='recommend'>It would be advisable to</span> review activities regularly to reflect changing interests. <span class='discourse'>In conclusion, as can be seen</span>, targeted improvements would strengthen the club’s impact.</div></div>"
  }
},
    {
  "id": "language-course",
  "title": "Evaluation of Summer Language Course",
  "topic": "Language Course Review",
  "type": "Educational Programme Report",
  "question": "Write a report about the language course for the organisers.",
  "keyPoints": [
    "Describe teaching methods and materials",
    "Explain what was effective and any problems",
    "Recommend improvements"
  ],
  "styles": {
    "default": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The main objective of this report is to evaluate</span> the summer language course and suggest improvements for future programmes. <span class='discourse'>This report is based on</span> feedback collected from students who attended the course.</div></div>\n\n<div class='report-section'><div class='section-heading'>Teaching Methods and Materials</div><div class='section-content'>The course included daily grammar input, speaking practice and written exercises. <span class='discourse'>It was generally felt that</span> lessons were well structured and teachers were supportive. <span class='discourse'>One positive aspect of</span> the course was the regular use of pair and group work.</div></div>\n\n<div class='report-section'><div class='section-heading'>Effectiveness and Problems</div><div class='section-content'><span class='discourse'>What made the course so effective is that</span> students had frequent opportunities to practise speaking. <span class='discourse'>However, a common complaint relates to</span> the course materials, which some students found repetitive. <span class='discourse'>As a result</span>, motivation decreased slightly during the second week.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>One key recommendation would be to</span> introduce more varied materials, such as videos, podcasts and short articles. <span class='recommend'>In order to</span> maintain interest, <span class='recommend'>it may be worth considering</span> including project work and presentations. <span class='discourse'>Taking everything into account, it seems clear that</span> the course was successful but could be improved.</div></div>",
    "professional": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>This report focuses on</span> evaluating teaching methods, materials and organisation on the summer language course. <span class='discourse'>The information presented was collected through</span> questionnaires completed by participants.</div></div>\n\n<div class='report-section'><div class='section-heading'>Strengths of the Course</div><div class='section-content'><span class='discourse'>There is broad agreement that</span> teachers were knowledgeable and lessons were engaging. <span class='discourse'>By far the best aspect of</span> the course was the emphasis on speaking, which helped students gain confidence. The use of digital tools also supported independent practice.</div></div>\n\n<div class='report-section'><div class='section-heading'>Areas for Improvement</div><div class='section-content'><span class='discourse'>One major criticism expressed by</span> students concerns large class sizes, which limited individual feedback. <span class='discourse'>This is mainly because</span> too many learners were placed at the same level. <span class='discourse'>Consequently</span>, some students progressed more slowly than expected.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>If improvements are to be made, one key recommendation would be to</span> reduce group sizes or provide an assistant teacher. <span class='recommend'>I would strongly recommend</span> offering short one-to-one feedback sessions at the end of each week. <span class='discourse'>To sum up</span>, these changes would significantly improve learning outcomes.</div></div>",
    "formal": "<div class='report-section'><div class='section-heading'>Introduction</div><div class='section-content'><span class='formal'>The primary aim of this report is to</span> evaluate the effectiveness of the summer language course and propose improvements. <span class='discourse'>The findings in this report are drawn from</span> detailed feedback provided by students and teaching staff.</div></div>\n\n<div class='report-section'><div class='section-heading'>General Overview</div><div class='section-content'><span class='discourse'>It was generally felt that</span> the course was well organised and met its learning objectives. <span class='discourse'>There was broad agreement that</span> teaching methods encouraged active participation and communication.</div></div>\n\n<div class='report-section'><div class='section-heading'>Concerns</div><div class='section-content'><span class='discourse'>However, one concern raised by</span> several participants involves limited speaking time in some lessons. <span class='discourse'>The worst part of</span> this situation is that quieter students had fewer opportunities to practise, <span class='discourse'>which affects</span> overall confidence development.</div></div>\n\n<div class='report-section'><div class='section-heading'>Recommendations</div><div class='section-content'><span class='recommend'>In order to address these issues, I would recommend</span> increasing the number of structured speaking activities, such as debates and role plays. <span class='recommend'>It would be advisable to</span> provide clearer progress feedback throughout the course. <span class='discourse'>In conclusion, as can be seen</span>, the course should continue with minor adjustments.</div></div>"
  }
    }
  ]
}
