{
  "essayModels": [
    {
      "id": "life-better-today",
      "topic": "Life Today vs 100 Years Ago",
      "essayType": "Opinion",
      "question": "'Life is better today than it was 100 years ago.' Do you agree?",
      "writingPoints": [
        "health",
        "entertainment",
        "technology and communication (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "Nowadays, there is considerable debate about whether life today is better than in the past.",
          "opinion": "From my perspective, modern life is significantly better",
          "argument": "due to remarkable advances in health, entertainment and communication."
        },
        "body": [
          {
            "paragraph": 1,
            "topic": "Healthcare",
            "listing": "To begin with, it seems that",
            "opinion": "I firmly believe that healthcare plays an essential role",
            "argument": "in improving our lives. This is because diseases that once killed millions can now be treated effectively. For example, vaccines have eliminated deadly illnesses like polio and smallpox. As a result, life expectancy has increased dramatically worldwide."
          },
          {
            "paragraph": 2,
            "topic": "Entertainment",
            "listing": "Secondly, it is generally argued that",
            "opinion": "entertainment options have expanded enormously.",
            "argument": "This is because streaming platforms provide unlimited access to films and music instantly. For instance, we can enjoy any content from home at any time. Consequently, people have far more ways to relax and enjoy themselves."
          },
          {
            "paragraph": 3,
            "topic": "Technology & Communication",
            "listing": "On the other hand, as as far as I can judge",
            "opinion": "While some argue this causes stress, I believe",
            "argument": "technology has transformed how we communicate globally. Video calls allow families to stay connected across continents daily. The benefits of instant global communication far outweigh any drawbacks."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "I am convinced that life today is much better than a century ago.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that improvements in health, entertainment and technology demonstrate remarkable human progress."
        }
      }
    },
    {
      "id": "work-money-enjoyment",
      "topic": "Work: Money vs Enjoyment",
      "essayType": "For & Against",
      "question": "Is it better to earn a lot of money or to enjoy your job?",
      "writingPoints": [
        "how much time is spent at work",
        "the type of work which is done",
        "job satisfaction and mental health (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "Few people would deny that work is an essential part of modern life.",
          "opinion": "Although there are differing viewpoints,",
          "argument": "Therefore, it is vital we analyse the benefits and drawbacks of both options."
        },
        "body": [
          {
            "paragraph": 1,
            "side": "FOR - High Salary",
            "listing": "To begin with, it seems that",
            "opinion": "The main advantage of earning a high salary is",
            "argument": "financial security and stability. This is because well-paid workers can afford comfortable lifestyles and support their families. For example, they can pay for quality healthcare and education. Another strong point is that we spend nearly a third of our lives working, so earning good money makes those hours worthwhile."
          },
          {
            "paragraph": 2,
            "side": "FOR - Job Enjoyment",
            "listing": "Secondly, it is generally argued that",
            "opinion": "While there are many advantages to high salaries, job satisfaction matters greatly too.",
            "argument": "The key disadvantage of focusing only on money is that personal happiness suffers considerably. For instance, boring or stressful jobs often lead to unhappiness regardless of salary."
          },
          {
            "paragraph": 3,
            "side": "Own Idea - Mental Health",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "mental health is significantly affected by job satisfaction.",
            "argument": "This is because unfulfilling work can cause burnout, anxiety and depression. Consequently, finding meaningful work protects our overall wellbeing."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "both money and enjoyment have clear advantages.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that finding work that provides both purpose and reasonable income would be the ideal solution."
        }
      }
    },
    {
      "id": "endangered-animals",
      "topic": "Saving Endangered Animals",
      "essayType": "Opinion",
      "question": "'We should do everything we can to save animals which are in danger of disappearing from our planet.' Do you agree?",
      "writingPoints": [
        "the kind of animals which are in danger",
        "the reasons for protecting these animals",
        "ecosystem balance (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "In recent years, protecting endangered animals has attracted increasing attention",
          "opinion": "from both the public and environmental experts worldwide.",
          "argument": "I strongly believe that we should do everything possible to save them for future generations."
        },
        "body": [
          {
            "paragraph": 1,
            "topic": "Animals in Danger",
            "listing": "To begin with, it seems that",
            "opinion": "many magnificent species are currently in serious danger of extinction.",
            "argument": "This is largely because hunting and habitat destruction have reduced their numbers drastically. For example, tigers, rhinos and elephants face critical threats. As a result, we are losing irreplaceable wildlife at an alarming rate."
          },
          {
            "paragraph": 2,
            "topic": "Reasons to Protect",
            "listing": "Secondly, it is generally argued that",
            "opinion": "there are compelling reasons to protect these endangered animals.",
            "argument": "This is because every species plays vital roles in maintaining natural balance. For instance, bees pollinate crops that humans depend on for food. Consequently, losing animal species threatens our own survival too."
          },
          {
            "paragraph": 3,
            "topic": "Ecosystem Balance",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "ecosystem balance depends entirely on biodiversity.",
            "argument": "This is because each animal contributes to complex food chains. For example, wolves control deer populations and protect forests. Therefore, protecting wildlife maintains environmental stability for everyone."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "I firmly believe endangered animals must be protected urgently.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that conservation benefits both nature and humanity significantly."
        }
      }
    },
    {
      "id": "friends-vs-family",
      "topic": "Friends vs Family",
      "essayType": "For & Against",
      "question": "Which is more important – friends or family?",
      "writingPoints": [
        "who you can enjoy yourself with",
        "who will help you when you have problems",
        "different life stages (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "It is widely recognised that relationships are essential to our happiness and wellbeing.",
          "opinion": "Although views differ considerably,",
          "argument": "Hence, it is vital to consider the benefits of both."
        },
        "body": [
          {
            "paragraph": 1,
            "side": "FOR - Friends",
            "listing": "To begin with, it seems that",
            "opinion": "The main advantage of friends is",
            "argument": "that they provide enjoyment and shared interests. This is because we choose friends who share our hobbies, tastes and values. For example, teenagers select friends to socialise and have fun with. As a result, friendships create happiness and memorable experiences throughout life."
          },
          {
            "paragraph": 2,
            "side": "FOR - Family",
            "listing": "Secondly, it is generally argued that",
            "opinion": "While there are many advantages to friendships, family provides stronger support",
            "argument": "during difficult times. The key disadvantage of relying only on friends is that they may not always help during serious problems. In contrast, family members typically offer unconditional support during crises without hesitation."
          },
          {
            "paragraph": 3,
            "side": "Different Life Stages",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "different relationships matter at different life stages.",
            "argument": "This is because teenagers often prioritise friends, while adults tend to value family more. Consequently, both types of relationships serve important purposes throughout our lives."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "both friends and family are extremely valuable.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that family support proves more reliable, but both contribute significantly to our happiness."
        }
      }
    },
    {
      "id": "environment-pollution",
      "topic": "Environment & Pollution",
      "essayType": "Problem-Solution",
      "question": "Do you think the world's pollution problems can be solved?",
      "writingPoints": [
        "transport",
        "rivers and seas",
        "renewable energy (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "Nowadays, pollution has become an increasingly serious problem affecting the entire planet.",
          "opinion": "It is widely recognised that pollution damages health and the environment significantly.",
          "argument": "Hence, it is vital to examine the main problems and explore practical solutions."
        },
        "body": [
          {
            "paragraph": 1,
            "type": "PROBLEM",
            "topic": "Transport",
            "listing": "Firstly, it seems that",
            "opinion": "transport causes significant air pollution in cities worldwide.",
            "argument": "This is because millions of vehicles produce harmful emissions every single day. For example, major cities suffer from dangerous levels of smog. As a result, respiratory diseases are increasing among urban populations."
          },
          {
            "paragraph": 2,
            "type": "PROBLEM",
            "topic": "Water Pollution",
            "listing": "Secondly, it is generally argued that",
            "opinion": "rivers and seas are being contaminated by industrial waste and plastic.",
            "argument": "This happens because factories release toxic chemicals into waterways carelessly. For instance, countless marine animals die from plastic pollution annually. Consequently, entire ecosystems are being destroyed."
          },
          {
            "paragraph": 3,
            "type": "SOLUTION",
            "topic": "Renewable Energy",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "renewable energy offers a very promising solution to these problems.",
            "argument": "This is because solar and wind power produce no harmful emissions whatsoever. For example, countries investing in clean energy report significantly improved air quality. If such measures were implemented globally, pollution could be reduced dramatically."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "I believe pollution can be addressed effectively through determined action.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that combining cleaner transport, stricter regulations and renewable energy will protect our planet."
        }
      }
    },
    {
      "id": "gap-year",
      "topic": "Gap Year Before University",
      "essayType": "For & Against",
      "question": "Is taking a gap year before university a good idea?",
      "writingPoints": [
        "gaining life experience",
        "delaying education",
        "financial considerations (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "Over the past few years, gap years have become increasingly popular among young people before university.",
          "opinion": "It is widely recognised that taking time off from education can have both positive and negative effects.",
          "argument": "Hence, it is vital to analyse the advantages and disadvantages carefully."
        },
        "body": [
          {
            "paragraph": 1,
            "side": "FOR - Life Experience",
            "listing": "To begin with, it seems that",
            "opinion": "The main advantage of gap years is gaining valuable life experience and independence.",
            "argument": "This is because travelling and volunteering abroad develop maturity and practical skills. For example, students who work overseas learn to solve problems independently. As a result, they often perform better when they return to education."
          },
          {
            "paragraph": 2,
            "side": "AGAINST - Losing Momentum",
            "listing": "Secondly, it is generally argued that",
            "opinion": "While there are many advantages, gap years also present significant challenges.",
            "argument": "The key disadvantage of taking time off is potentially losing academic momentum and motivation. A major drawback is that study habits can deteriorate considerably after a year away. Consequently, some students struggle to return to education."
          },
          {
            "paragraph": 3,
            "side": "Financial Considerations",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "financial considerations are extremely significant for many families.",
            "argument": "This is because travelling and accommodation require substantial savings. For instance, expenses can reach thousands of pounds. However, working during a gap year can help fund university studies later."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "gap years have both benefits and drawbacks.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that they benefit motivated students who plan carefully and remain committed."
        }
      }
    },
    {
      "id": "childhood-obesity",
      "topic": "Childhood Obesity",
      "essayType": "Problem-Solution",
      "question": "What can be done to reduce childhood obesity?",
      "writingPoints": [
        "unhealthy eating",
        "lack of exercise",
        "school education (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "These days, childhood obesity has become an increasingly serious problem in many countries.",
          "opinion": "It is widely recognised that this crisis affects children's health and future wellbeing significantly.",
          "argument": "Therefore, it is vital to identify the main problems and discuss effective solutions."
        },
        "body": [
          {
            "paragraph": 1,
            "type": "PROBLEM",
            "topic": "Unhealthy Eating",
            "listing": "Firstly, it seems that",
            "opinion": "unhealthy eating habits are a major cause of childhood obesity.",
            "argument": "This is because many children consume excessive amounts of sugary snacks and fast food daily. For example, many eat crisps and burgers regularly instead of nutritious meals. As a result, they consume far more calories than their bodies actually need."
          },
          {
            "paragraph": 2,
            "type": "PROBLEM",
            "topic": "Lack of Exercise",
            "listing": "Secondly, it is generally argued that",
            "opinion": "lack of physical exercise contributes significantly to rising obesity rates.",
            "argument": "This is because children spend hours on screens instead of playing outdoors actively. For instance, many prefer video games to sports or cycling. Consequently, fitness levels have declined sharply among young people."
          },
          {
            "paragraph": 3,
            "type": "SOLUTION",
            "topic": "School Education",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "school education offers an effective solution to address this crisis.",
            "argument": "This is because schools can teach nutrition and provide healthy meals in canteens. For example, banning vending machines and increasing PE lessons would help considerably. By taking these steps, schools could reduce obesity."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "childhood obesity can be addressed through determined action.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that combining healthier diets, more exercise and school programmes will protect children's health."
        }
      }
    },
    {
      "id": "social-media-addiction",
      "topic": "Social Media Addiction",
      "essayType": "Cause & Effect",
      "question": "What are the causes and effects of social media addiction?",
      "writingPoints": [
        "constant notifications",
        "social comparison",
        "mental health (your own idea)"
      ],
      "structure": {
        "introduction": {
          "listing": "In recent years, social media addiction has become a significant concern among young people.",
          "opinion": "It is widely acknowledged that excessive use has led to serious consequences for mental health.",
          "argument": "Hence, it is vital to examine the main causes and their resulting effects."
        },
        "body": [
          {
            "paragraph": 1,
            "type": "CAUSE",
            "topic": "Constant Notifications",
            "listing": "To begin with, it seems that",
            "opinion": "One of the main causes of addiction is constant notifications from social media apps.",
            "argument": "This is because platforms are deliberately designed to send endless alerts about likes and messages. For example, each notification triggers dopamine release in the brain. As a result, users feel compelled to check their phones compulsively throughout the day."
          },
          {
            "paragraph": 2,
            "type": "CAUSE",
            "topic": "Social Comparison",
            "listing": "Secondly, it is generally argued that",
            "opinion": "Another important cause is social comparison with others online.",
            "argument": "This happens because people constantly see idealised images of others' seemingly perfect lives. For instance, teenagers compare themselves to influencers and celebrities. Consequently, feelings of inadequacy and low self-esteem develop rapidly."
          },
          {
            "paragraph": 3,
            "type": "EFFECT",
            "topic": "Mental Health",
            "listing": "On the other hand, as far as I can judge",
            "opinion": "The effects on mental health are particularly serious and widespread.",
            "argument": "As a consequence, many young people experience anxiety, depression and loneliness. For example, constant comparison significantly damages self-confidence. Furthermore, addiction affects sleep quality and academic performance negatively."
          }
        ],
        "conclusion": {
          "summary": "All things considered, as far as I can judge,",
          "opinion": "social media addiction causes serious problems for individuals.",
          "finalArgument": "Despite some viewpoints expressed, it is clear that understanding these causes is essential for addressing this growing issue effectively."
        }
      }
    }
  ],
  "phraseBank": {
    "introduction": {
      "listing": [
        "Nowadays, there is considerable debate about...",
        "Few people would deny that...",
        "It is widely recognised that...",
        "In recent years...",
        "Over the past few years...",
        "These days..."
      ],
      "opinion": [
        "From my perspective...",
        "I firmly believe that...",
        "Although views differ considerably...",
        "It is widely recognised that..."
      ],
      "argument": [
        "Therefore, it is vital to analyse...",
        "Hence, it is vital to consider...",
        "due to remarkable advances in..."
      ]
    },
    "bodyParagraphs": {
      "listing": [
        "To begin with, it seems that...",
        "Firstly, it seems that...",
        "Secondly, it is generally argued that...",
        "On the other hand, as far as I can judge..."
      ],
      "opinion": [
        "The main advantage of... is...",
        "I firmly believe that...",
        "While there are many advantages to...",
        "The key disadvantage of..."
      ],
      "argument": [
        "This is because...",
        "For example...",
        "For instance...",
        "As a result...",
        "Consequently...",
        "Therefore..."
      ]
    },
    "conclusion": {
      "summary": [
        "All things considered, as far as I can judge,",
        "In conclusion,",
        "To sum up,"
      ],
      "opinion": [
        "I firmly believe...",
        "I am convinced that...",
        "both... have clear advantages"
      ],
      "finalArgument": [
        "Despite some viewpoints expressed, it is clear that...",
        "it is clear that...",
        "Overall..."
      ]
    }
  }
}
