{
  "rephrasings": [
    {
      "id": "phone-usage",
      "original": "Some people think students should spend less time on their phones.",
      "levels": {
        "basic": "Many believe students use their phones too much and should limit screen time.",
        "standard": "It is often argued that young people depend too heavily on their mobile phones.",
        "advanced": "Nowadays, concerns are growing that students' constant phone use affects learning and relationships."
      }
    },
    {
      "id": "public-transport-free",
      "original": "Many people believe public transport should be free.",
      "levels": {
        "basic": "Some people think buses and trains should not cost anything.",
        "standard": "It is widely discussed whether public transport ought to be free for everyone.",
        "advanced": "As cities fight pollution and traffic, the idea of free public transport has gained strong support."
      }
    },
    {
      "id": "fast-food-danger",
      "original": "Is fast food a danger to people's health?",
      "levels": {
        "basic": "People often ask if eating fast food is harmful.",
        "standard": "There is increasing concern that fast food may damage people's health.",
        "advanced": "Few would deny that the rise of fast-food culture has serious consequences for public health."
      }
    },
    {
      "id": "sports-teamwork",
      "original": "Do sports and games help students learn teamwork?",
      "levels": {
        "basic": "Many think playing sports teaches students to cooperate.",
        "standard": "It is commonly believed that team sports develop cooperation and social skills in schools.",
        "advanced": "From football fields to group projects, sport is often seen as the classroom of teamwork."
      }
    },
    {
      "id": "teenagers-part-time",
      "original": "Should teenagers have a part-time job while studying?",
      "levels": {
        "basic": "Some people say students should work part-time to gain experience.",
        "standard": "There is debate about whether having a job helps or distracts teenagers from their studies.",
        "advanced": "As living costs rise, many teenagers balance work and school, but opinions differ on whether this builds responsibility or adds pressure."
      }
    },
    {
      "id": "money-management",
      "original": "Some people think schools should teach students how to manage money.",
      "levels": {
        "basic": "Many believe schools should include lessons on saving and spending.",
        "standard": "Nowadays, there is discussion about teaching financial education as part of the curriculum.",
        "advanced": "In an age of online shopping and credit cards, financial literacy is seen as an essential life skill schools may need to teach."
      }
    },
    {
      "id": "school-uniforms",
      "original": "Should students wear school uniforms?",
      "levels": {
        "basic": "People disagree about whether school uniforms are necessary.",
        "standard": "The question of whether students should wear uniforms divides parents and teachers.",
        "advanced": "While uniforms create equality, some argue they restrict self-expression in modern education."
      }
    },
    {
      "id": "social-media-lonely",
      "original": "Do social media platforms make people feel lonely?",
      "levels": {
        "basic": "Some believe using social media can make people lonely.",
        "standard": "It is often said that social networks connect us virtually but separate us emotionally.",
        "advanced": "As online connections multiply, psychologists warn that loneliness may actually be increasing."
      }
    },
    {
      "id": "animal-research",
      "original": "Should animals be used for scientific research?",
      "levels": {
        "basic": "Many people disagree about testing on animals for science.",
        "standard": "The use of animals in experiments raises both ethical and scientific questions.",
        "advanced": "As technology advances, the debate intensifies over whether animal testing can ever be justified."
      }
    },
    {
      "id": "holiday-planning",
      "original": "Are holidays more enjoyable when planned or spontaneous?",
      "levels": {
        "basic": "Some people like organising holidays, while others prefer to travel without plans.",
        "standard": "There is discussion about whether careful planning or spontaneity makes travel more enjoyable.",
        "advanced": "Modern travellers are divided between those who value detailed planning and those who believe true adventure comes unplanned."
      }
    },
    {
      "id": "school-start-time",
      "original": "Should schools start later in the morning?",
      "levels": {
        "basic": "Many people think schools should begin later so students can sleep more.",
        "standard": "It is often argued that starting classes later would improve students' focus and health.",
        "advanced": "With growing concern about teen sleep patterns, some suggest that later school schedules could boost learning and well-being."
      }
    },
    {
      "id": "advertising-useful",
      "original": "Is advertising useful or misleading?",
      "levels": {
        "basic": "People disagree about whether adverts help or trick consumers.",
        "standard": "There is debate about whether advertising gives information or simply persuades people to buy.",
        "advanced": "In an age of constant marketing, the line between informing and manipulating customers has become increasingly blurred."
      }
    },
    {
      "id": "community-service",
      "original": "Should young people do unpaid work to help their communities?",
      "levels": {
        "basic": "Some people believe teenagers should volunteer in their local areas.",
        "standard": "It is commonly suggested that unpaid community service can teach responsibility to young people.",
        "advanced": "As societies seek active citizens, volunteering is seen as a way for youth to gain purpose while supporting their communities."
      }
    },
    {
      "id": "celebrity-role-models",
      "original": "Do celebrities make good role models?",
      "levels": {
        "basic": "Many people look up to famous actors or singers, but not everyone agrees this is good.",
        "standard": "There is discussion about whether celebrities give a positive example to young fans.",
        "advanced": "In a culture obsessed with fame, the question remains whether public figures inspire ambition or unhealthy imitation."
      }
    },
    {
      "id": "work-from-home",
      "original": "Should people work from home more often?",
      "levels": {
        "basic": "Working from home has become common, and some think it should happen more.",
        "standard": "It is widely argued that remote work offers benefits such as flexibility and less commuting.",
        "advanced": "As technology reshapes employment, the shift toward home working raises new questions about balance and productivity."
      }
    },
    {
      "id": "countryside-vs-city",
      "original": "Is it better to live in the countryside or the city?",
      "levels": {
        "basic": "People often compare life in towns with life in rural areas.",
        "standard": "There is debate about whether city convenience outweighs the calm of the countryside.",
        "advanced": "Modern lifestyles force many to choose between urban opportunity and rural tranquillity."
      }
    },
    {
      "id": "creativity-vs-exams",
      "original": "Should schools focus more on creativity than exams?",
      "levels": {
        "basic": "Some say exams are too important and schools should be more creative.",
        "standard": "It is increasingly argued that creativity deserves as much attention as academic testing.",
        "advanced": "As education evolves, many question whether measuring grades can ever replace inspiring imagination."
      }
    },
    {
      "id": "technology-laziness",
      "original": "Is technology making people lazier?",
      "levels": {
        "basic": "Many believe new technology makes life easier but reduces effort.",
        "standard": "Some argue that modern inventions encourage laziness instead of efficiency.",
        "advanced": "While innovation simplifies daily tasks, it also raises concerns that convenience may weaken motivation."
      }
    },
    {
      "id": "practical-skills",
      "original": "Should students learn more practical life skills at school?",
      "levels": {
        "basic": "People think schools should teach skills like cooking or fixing things.",
        "standard": "It is often suggested that education should include everyday abilities, not just academic subjects.",
        "advanced": "With rising demand for self-reliance, many argue schools must balance theory with essential life skills."
      }
    },
    {
      "id": "books-vs-films",
      "original": "Is it better to read books or watch films?",
      "levels": {
        "basic": "People enjoy both reading and watching movies, but opinions differ.",
        "standard": "There is discussion about whether books or films give a deeper understanding of stories.",
        "advanced": "From page to screen, audiences still debate which medium offers richer imagination and emotion."
      }
    }
  ]
}
