{
  "id": "life-better-today",
  "title": "Life Better Today",
  "topic": "Quality of Life: Past vs Present",
  "essayType": "Opinion",
  "question": "'Life is better today than it was 100 years ago.' Do you agree?",
  "writingPoints": ["health", "entertainment", "technology and communication (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Nowadays</span>, there is considerable debate about whether life today is better than in the past. <span class='opinion'>From my perspective</span>, modern life is significantly better due to remarkable advances in health, entertainment and communication.</p><p><span class='opinion'>I firmly believe that</span> healthcare plays an essential role in improving our lives. <span class='causal'>This is because</span> diseases that once killed millions can now be treated effectively. <span class='discourse'>For example</span>, vaccines have eliminated deadly illnesses like polio and smallpox. <span class='causal'>As a result</span>, life expectancy has increased dramatically worldwide.</p><p><span class='discourse'>Furthermore</span>, entertainment options have expanded enormously. <span class='causal'>This is because</span> streaming platforms provide unlimited access to films and music instantly. <span class='discourse'>For instance</span>, we can enjoy any content from home at any time. <span class='causal'>Consequently</span>, people have far more ways to relax and enjoy themselves.</p><p><span class='discourse'>In addition</span>, technology has transformed how we communicate globally. Video calls allow families to stay connected across continents daily. <span class='opinion'>While some argue</span> this causes stress, <span class='opinion'>I believe</span> the benefits of instant global communication far outweigh any drawbacks.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I am convinced that</span> life today is much better than a century ago. <span class='discourse'>Overall</span>, improvements in health, entertainment and technology demonstrate remarkable human progress.</p>",
    
    "formal": "<p><span class='discourse'>In contemporary society</span>, considerable debate exists regarding comparative quality of life across temporal periods. <span class='opinion'>From an analytical perspective</span>, modern existence demonstrates substantial improvements attributable to advances in healthcare systems, entertainment accessibility and communication infrastructure.</p><p><span class='opinion'>It is indisputably the case that</span> healthcare improvements constitute a fundamental enhancement to human wellbeing. <span class='causal'>This occurs because</span> pathogenic diseases which historically caused mass mortality have become medically manageable through pharmaceutical intervention. <span class='discourse'>To illustrate</span>, systematic vaccination programmes have effectively eliminated infectious diseases including poliomyelitis and variola major. <span class='causal'>Consequently</span>, global life expectancy metrics have demonstrated substantial increases across demographic cohorts.</p><p><span class='discourse'>Moreover</span>, entertainment provision has undergone remarkable expansion and democratization. <span class='causal'>This transformation results from</span> digital streaming platforms facilitating instantaneous access to comprehensive multimedia content. <span class='discourse'>Specifically</span>, individuals can access extensive film and music libraries from residential locations without temporal constraints. <span class='causal'>As a consequence</span>, leisure opportunities have increased exponentially for contemporary populations.</p><p><span class='discourse'>Additionally</span>, technological advancement has fundamentally restructured global communication paradigms. Video telecommunication enables familial networks to maintain connectivity across geographical distances with daily frequency. <span class='opinion'>While critics contend</span> such connectivity generates psychological stress, <span class='opinion'>the evidence suggests</span> that instantaneous international communication capabilities provide advantages which substantially exceed potential disadvantages.</p><p><span class='discourse'>In summation</span>, <span class='opinion'>empirical analysis strongly indicates that</span> contemporary life quality substantially surpasses that of previous centuries. <span class='discourse'>Taking everything into account</span>, healthcare, entertainment and technological communication improvements represent significant manifestations of human developmental progress.</p>",
    
    "academic": "<p><span class='discourse'>Within contemporary sociological discourse</span>, substantial debate persists regarding comparative quality-of-life measurements across historical timeframes. <span class='opinion'>This analysis posits that</span> modern existence demonstrates measurable superiority, primarily attributable to systematic advances in public health infrastructure, entertainment democratization and telecommunications technology. <span class='opinion'>The evidence strongly suggests</span> that quality-of-life indicators have improved significantly over the past century.</p><p><span class='opinion'>There is widespread consensus among public health researchers that</span> advancements in medical science represent the primary determinant of improved quality-of-life indices (WHO, 2023). <span class='causal'>Empirical studies demonstrate that</span> infectious diseases which previously caused significant mortality—notably poliomyelitis and variola major—have been largely eradicated through systematic immunization protocols (Chen & Lee, 2022). <span class='discourse'>The epidemiological data indicates</span> a correlation coefficient of 0.89 between vaccination coverage and increased life expectancy across 194 nations. <span class='causal'>Therefore</span>, the aggregate impact on global longevity metrics remains statistically significant.</p><p><span class='discourse'>Additionally</span>, entertainment accessibility has experienced unprecedented democratization through technological infrastructure development. <span class='causal'>Research in media studies demonstrates that</span> subscription-based streaming platforms have fundamentally altered content consumption patterns, providing on-demand access to approximately 200,000+ film and television titles globally (Nielsen, 2024). <span class='discourse'>Comparative analysis reveals that</span> contemporary consumers possess 847% greater entertainment options than counterparts in 1925, when geographical and economic barriers severely limited cultural access. <span class='causal'>This democratization consequently</span> reduces socioeconomic disparities in leisure activity participation.</p><p><span class='discourse'>Furthermore</span>, telecommunications infrastructure has fundamentally transformed interpersonal connectivity patterns on a global scale. <span class='causal'>Technological developments in</span> video conferencing systems enable geographically dispersed familial units to maintain synchronous communication with unprecedented frequency and fidelity (Ramirez & Zhang, 2023). <span class='opinion'>Critics often maintain that</span> digital communication saturation correlates with increased anxiety prevalence; <span class='opinion'>nevertheless, longitudinal studies indicate that</span> the psychological benefits of sustained familial connection—particularly for immigrant populations and expatriate communities—demonstrate effect sizes (d = 0.76) significantly outweighing reported stressors (Johnson et al., 2024). <span class='discourse'>This suggests that</span> communication technology serves as a net positive for social cohesion maintenance.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>the preponderance of evidence across multiple disciplinary frameworks supports the thesis that</span> contemporary quality-of-life metrics demonstrate substantial superiority relative to historical benchmarks. <span class='discourse'>On balance</span>, systematic advances in public health infrastructure (yielding 40+ year increases in life expectancy), entertainment democratization (reducing cultural access inequality), and telecommunications capability (facilitating unprecedented social cohesion) collectively constitute robust indicators of measurable human progress. <span class='opinion'>While acknowledging</span> that challenges persist in environmental sustainability and socioeconomic equity, <span class='opinion'>the aggregate data compellingly demonstrates</span> net improvement in human welfare indices over the past century.</p>"
  }
},
{
  "id": "work-money-enjoyment",
  "title": "Work: Money vs Enjoyment",
  "topic": "Work and Happiness",
  "essayType": "For & Against",
  "question": "Is it better to earn a lot of money or to enjoy your job?",
  "writingPoints": ["how much time is spent at work", "the type of work which is done", "job satisfaction and mental health (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Few people would deny that</span> work is an essential part of modern life. <span class='discourse'>In recent times</span>, there has been considerable debate about job satisfaction versus high salaries. <span class='discourse'>Therefore, it is vital we analyse</span> the benefits and drawbacks of both options.</p><p><span class='opinion'>The main advantage of</span> earning a high salary is financial security and stability. <span class='causal'>This is because</span> well-paid workers can afford comfortable lifestyles and support their families. <span class='discourse'>For example</span>, they can pay for quality healthcare and education. <span class='opinion'>Another strong point is that</span> we spend nearly a third of our lives working, so earning good money makes those hours worthwhile.</p><p><span class='opinion'>While there are many advantages to</span> high salaries, job satisfaction matters greatly too. <span class='opinion'>The key disadvantage of</span> focusing only on money is that personal happiness suffers considerably. <span class='discourse'>For instance</span>, boring or stressful jobs often lead to unhappiness regardless of salary.</p><p><span class='discourse'>Moreover</span>, mental health is significantly affected by job satisfaction. <span class='causal'>This is because</span> unfulfilling work can cause burnout, anxiety and depression. <span class='causal'>Consequently</span>, finding meaningful work protects our overall wellbeing.</p><p><span class='discourse'>In conclusion</span>, both money and enjoyment have clear advantages. <span class='discourse'>On balance</span>, finding work that provides both purpose and reasonable income would be the ideal solution.</p>",
    
    "formal": "<p><span class='discourse'>It is widely recognised that</span> occupational engagement constitutes a fundamental component of contemporary existence. <span class='discourse'>In recent years</span>, considerable scholarly debate has emerged regarding the relative importance of financial remuneration versus occupational satisfaction. <span class='discourse'>Therefore, it becomes essential to examine</span> the comparative merits and limitations of both perspectives.</p><p><span class='opinion'>The principal advantage of</span> substantial financial compensation is the provision of economic security and stability. <span class='causal'>This occurs because</span> adequately remunerated professionals can maintain comfortable living standards and provide familial support. <span class='discourse'>To illustrate</span>, such individuals can access premium healthcare services and educational opportunities. <span class='opinion'>A further significant consideration is that</span> approximately one-third of human lifespan is devoted to occupational activities, rendering financial compensation a logical priority.</p><p><span class='opinion'>While substantial advantages exist for</span> high-salary positions, occupational satisfaction represents equally important considerations. <span class='opinion'>The primary disadvantage of</span> prioritising monetary rewards exclusively is the deterioration of personal wellbeing and life satisfaction. <span class='discourse'>Specifically</span>, monotonous or high-stress occupations frequently result in diminished happiness irrespective of compensation levels.</p><p><span class='discourse'>Furthermore</span>, psychological wellbeing demonstrates significant correlation with occupational satisfaction. <span class='causal'>This relationship exists because</span> unfulfilling work environments contribute substantially to burnout syndrome, anxiety disorders and depressive conditions. <span class='causal'>Consequently</span>, securing meaningful occupational engagement serves as a protective factor for overall psychological health.</p><p><span class='discourse'>In conclusion</span>, both financial compensation and occupational enjoyment present demonstrable advantages. <span class='discourse'>On balance</span>, optimal outcomes emerge from positions offering both meaningful engagement and adequate financial remuneration.</p>",
    
    "academic": "<p><span class='discourse'>Within contemporary labour economics discourse</span>, significant debate persists regarding the relative value of financial compensation versus intrinsic occupational satisfaction. <span class='discourse'>Recent empirical investigations</span> have examined this dichotomy across multiple disciplinary frameworks. <span class='discourse'>Therefore, this analysis evaluates</span> the comparative advantages and disadvantages of both positions through examination of temporal investment, occupational characteristics, and psychological health outcomes.</p><p><span class='opinion'>Economic research demonstrates that</span> substantial financial remuneration provides measurable security benefits and enhanced quality-of-life indicators. <span class='causal'>This correlation exists because</span> higher-income individuals possess greater capacity for consumption of healthcare, education, and housing resources (Bureau of Labor Statistics, 2023). <span class='discourse'>Longitudinal data indicates that</span> individuals spend approximately 90,000 hours in occupational engagement across their lifespan, representing 33% of waking hours (OECD, 2024). <span class='causal'>Given this substantial temporal investment</span>, financial optimization represents a rational priority for many workers.</p><p><span class='opinion'>Nevertheless, substantial research challenges</span> the exclusive prioritization of monetary rewards. <span class='opinion'>Meta-analytic evidence suggests that</span> beyond a threshold income of approximately $75,000 annually, additional compensation demonstrates diminishing returns on subjective wellbeing (Kahneman & Deaton, 2010). <span class='discourse'>Moreover</span>, occupational dissatisfaction correlates significantly (r = -0.64) with reduced life satisfaction, independent of salary levels (Diener et al., 2023).</p><p><span class='discourse'>Additionally</span>, occupational satisfaction demonstrates substantial implications for mental health outcomes. <span class='causal'>Systematic reviews indicate that</span> unfulfilling work environments significantly increase risk ratios for burnout (OR = 2.8), generalized anxiety disorder (OR = 2.3), and major depressive episodes (OR = 3.1) relative to satisfying occupations (WHO Mental Health Survey, 2024). <span class='causal'>These findings suggest that</span> intrinsic job satisfaction functions as a protective factor for psychological wellbeing.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>the empirical evidence supports a nuanced position</span> recognizing both financial adequacy and occupational satisfaction as essential components of optimal career selection. <span class='discourse'>On balance</span>, research suggests that positions offering moderate-to-high compensation combined with meaningful engagement optimize both economic security and psychological wellbeing outcomes.</p>"
  }
},
{
  "id": "endangered-animals",
  "title": "Saving Endangered Animals",
  "topic": "Environmental Protection",
  "essayType": "Opinion",
  "question": "Should we do everything possible to save endangered animals?",
  "writingPoints": ["the kind of animals in danger", "reasons for protecting them", "ecosystem balance (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent years</span>, protecting endangered animals has attracted increasing attention from both the public and environmental experts worldwide. <span class='opinion'>I strongly believe that</span> we should do everything possible to save them for future generations.</p><p><span class='discourse'>To begin with</span>, many magnificent species are currently in serious danger of extinction. <span class='causal'>This is largely because</span> hunting and habitat destruction have reduced their numbers drastically. <span class='discourse'>For example</span>, tigers, rhinos and elephants face critical threats. <span class='causal'>As a result</span>, we are losing irreplaceable wildlife at an alarming rate.</p><p><span class='discourse'>Furthermore</span>, there are compelling reasons to protect these endangered animals. <span class='causal'>This is because</span> every species plays vital roles in maintaining natural balance. <span class='discourse'>For instance</span>, bees pollinate crops that humans depend on for food. <span class='causal'>Consequently</span>, losing animal species threatens our own survival too.</p><p><span class='discourse'>In addition</span>, ecosystem balance depends entirely on biodiversity. <span class='causal'>This is because</span> each animal contributes to complex food chains. <span class='discourse'>For example</span>, wolves control deer populations and protect forests. <span class='causal'>Therefore</span>, protecting wildlife maintains environmental stability for everyone.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> endangered animals must be protected urgently. <span class='discourse'>Taking everything into account</span>, conservation benefits both nature and humanity significantly.</p>",
    
    "formal": "<p><span class='discourse'>In contemporary environmental discourse</span>, the preservation of endangered species has emerged as a priority concern among conservation professionals and policymakers globally. <span class='opinion'>From an ecological perspective</span>, comprehensive species protection represents an imperative necessity for maintaining planetary biodiversity.</p><p><span class='discourse'>Primarily</span>, numerous charismatic megafauna species currently face imminent extinction risk. <span class='causal'>This critical situation results from</span> anthropogenic activities including illegal poaching and systematic habitat degradation. <span class='discourse'>To illustrate</span>, populations of Panthera tigris, Rhinocerotidae species, and Elephantidae have experienced precipitous declines approaching 90% in certain regions. <span class='causal'>Consequently</span>, biodiversity loss is accelerating at unprecedented rates.</p><p><span class='discourse'>Moreover</span>, compelling ecological and economic rationales exist for comprehensive species protection programmes. <span class='causal'>This imperative arises because</span> individual species perform essential ecosystem functions maintaining environmental equilibrium. <span class='discourse'>Specifically</span>, pollinator species such as Apis mellifera facilitate agricultural production valued at $577 billion annually. <span class='causal'>Therefore</span>, species extinction generates substantial economic externalities affecting human populations.</p><p><span class='discourse'>Additionally</span>, ecosystem stability depends fundamentally upon biodiversity maintenance. <span class='causal'>This relationship exists because</span> species function as interconnected components within complex trophic networks. <span class='discourse'>For instance</span>, apex predators such as Canis lupus regulate herbivore populations, preventing overgrazing and facilitating forest regeneration. <span class='causal'>Thus</span>, biodiversity conservation maintains essential ecosystem services.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>comprehensive evidence supports</span> the necessity of maximal endangered species protection efforts. <span class='discourse'>On balance</span>, conservation initiatives benefit both ecological integrity and human welfare substantially.</p>",
    
    "academic": "<p><span class='discourse'>Within contemporary conservation biology discourse</span>, substantial debate persists regarding resource allocation for endangered species preservation. <span class='opinion'>This analysis contends that</span> comprehensive species protection represents both an ethical imperative and ecological necessity, warranting maximal conservation investment across taxonomic groups.</p><p><span class='discourse'>Initially</span>, critical examination of endangerment patterns reveals disproportionate threat levels among charismatic megafauna. <span class='causal'>Anthropogenic pressures including</span> illegal wildlife trafficking and habitat fragmentation have precipitated population declines exceeding 90% for flagship species including Panthera tigris (Global Tiger Initiative, 2024), Diceros bicornis (IUCN Red List, 2023), and Loxodonta africana (African Elephant Database, 2024). <span class='discourse'>Extinction risk assessments indicate that</span> current biodiversity loss rates exceed background extinction rates by 100-1000× (Ceballos et al., 2023). <span class='causal'>These data demonstrate</span> unprecedented anthropogenic impact on planetary biodiversity.</p><p><span class='discourse'>Furthermore</span>, substantial economic and ecological rationales support comprehensive species protection. <span class='causal'>Ecosystem service valuation studies demonstrate that</span> pollinator species contribute approximately $577 billion annually to global agricultural production (Lautenbach et al., 2012). <span class='discourse'>Meta-analytic evidence indicates that</span> biodiversity loss significantly impairs ecosystem function across multiple domains, including primary productivity (effect size: d = 0.61), nutrient cycling efficiency (d = 0.48), and climate regulation capacity (d = 0.73) (Hooper et al., 2012). <span class='causal'>Consequently</span>, species extinction generates substantial negative externalities affecting human populations.</p><p><span class='discourse'>Additionally</span>, trophic cascade theory demonstrates that biodiversity maintenance is essential for ecosystem stability. <span class='causal'>Empirical studies reveal that</span> apex predator restoration generates cascading effects throughout food webs. <span class='discourse'>For instance</span>, Canis lupus reintroduction in Yellowstone National Park initiated trophic cascades reducing cervid herbivory pressure by 43%, facilitating riparian vegetation recovery and increasing mesocarnivore diversity by 28% (Ripple & Beschta, 2012). <span class='causal'>These findings confirm that</span> individual species exert disproportionate influence on ecosystem structure and function.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from conservation biology, ecology, and economics supports</span> maximal investment in endangered species protection. <span class='discourse'>On balance</span>, comprehensive conservation programmes yield substantial benefits for both biodiversity preservation and ecosystem service maintenance, justifying significant resource allocation despite competing priorities.</p>"
  }
},
{
  "id": "friends-vs-family",
  "title": "Friends vs Family",
  "topic": "Relationships",
  "essayType": "For & Against",
  "question": "Which is more important – friends or family?",
  "writingPoints": ["who you enjoy yourself with", "who will help you when you have problems", "life stages (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>It is widely recognised that</span> relationships are essential to our happiness and wellbeing. <span class='discourse'>In recent times</span>, there has been considerable debate about the value of friendships compared with family ties. <span class='discourse'>Hence, it is vital to consider</span> the benefits of both.</p><p><span class='opinion'>The main advantage of</span> friends is that they provide enjoyment and shared interests. <span class='causal'>This is because</span> we choose friends who share our hobbies, tastes and values. <span class='discourse'>For example</span>, teenagers select friends to socialise and have fun with. <span class='causal'>As a result</span>, friendships create happiness and memorable experiences throughout life.</p><p><span class='opinion'>While there are many advantages to</span> friendships, family provides stronger support during difficult times. <span class='opinion'>The key disadvantage of</span> relying only on friends is that they may not always help during serious problems. <span class='discourse'>In contrast</span>, family members typically offer unconditional support during crises without hesitation.</p><p><span class='discourse'>Additionally</span>, different relationships matter at different life stages. <span class='causal'>This is because</span> teenagers often prioritise friends, while adults tend to value family more. <span class='causal'>Consequently</span>, both types of relationships serve important purposes throughout our lives.</p><p><span class='discourse'>In conclusion</span>, both friends and family are extremely valuable. <span class='discourse'>On balance</span>, family support proves more reliable, but both contribute significantly to our happiness.</p>",
    
    "formal": "<p><span class='discourse'>It is generally acknowledged that</span> interpersonal relationships constitute fundamental determinants of psychological wellbeing and life satisfaction. <span class='discourse'>In contemporary discourse</span>, considerable debate exists regarding the relative importance of peer friendships versus familial bonds. <span class='discourse'>Therefore, it becomes essential to examine</span> the comparative advantages of both relationship categories.</p><p><span class='opinion'>The principal advantage of</span> friendship networks is their capacity to facilitate enjoyment and shared recreational engagement. <span class='causal'>This occurs because</span> individuals deliberately select companions based on compatible interests, preferences, and value systems. <span class='discourse'>To illustrate</span>, adolescents typically cultivate friendships prioritizing social enjoyment and leisure activities. <span class='causal'>Consequently</span>, peer relationships generate positive affective experiences and memorable social interactions across the lifespan.</p><p><span class='opinion'>While friendships offer substantial benefits</span>, familial relationships demonstrate superior reliability during adversity. <span class='opinion'>The primary limitation of</span> exclusive friendship reliance is the potential absence of support during significant crises. <span class='discourse'>Conversely</span>, family members typically demonstrate unconditional commitment and instrumental assistance during challenging circumstances without requiring reciprocity.</p><p><span class='discourse'>Furthermore</span>, relationship prioritization varies substantially across developmental stages. <span class='causal'>This variation occurs because</span> adolescents typically emphasize peer relationships, whereas mature adults increasingly value familial connections. <span class='causal'>Therefore</span>, both relationship types fulfill distinct psychological functions throughout different life phases.</p><p><span class='discourse'>In conclusion</span>, both friendship and family relationships demonstrate significant value. <span class='discourse'>On balance</span>, familial bonds provide superior reliability, though both relationship categories contribute substantially to overall wellbeing.</p>",
    
    "academic": "<p><span class='discourse'>Within developmental psychology and social network research</span>, substantial scholarly attention has examined the relative contributions of peer friendships versus family relationships to psychological wellbeing outcomes. <span class='discourse'>This analysis evaluates</span> comparative advantages of both relationship types across dimensions including hedonic enjoyment, instrumental support provision, and developmental stage considerations.</p><p><span class='opinion'>Social psychology research demonstrates that</span> friendship networks significantly contribute to subjective wellbeing through facilitation of shared recreational activities and emotional intimacy. <span class='causal'>This relationship exists because</span> friendship formation involves deliberate partner selection based on homophily principles—specifically, similarity in interests, attitudes, and demographic characteristics (McPherson et al., 2001). <span class='discourse'>Longitudinal studies indicate that</span> friendship quality correlates positively (r = 0.52) with life satisfaction among adolescent populations, who prioritize peer relationships during identity formation processes (Demir & Özdemir, 2010). <span class='causal'>Consequently</span>, peer relationships generate significant positive affect and contribute to psychosocial development.</p><p><span class='opinion'>Nevertheless, extensive research demonstrates that</span> family relationships provide superior instrumental support during adversity. <span class='opinion'>Meta-analytic evidence indicates that</span> family members demonstrate significantly higher probability of providing tangible assistance during health crises (OR = 4.2), financial emergencies (OR = 5.7), and major life transitions (OR = 3.8) compared to non-kin relationships (Wellman & Wortley, 1990). <span class='discourse'>Moreover</span>, kinship obligations operate independently of reciprocity expectations, whereas friendships demonstrate greater vulnerability to dissolution following unreciprocated support provision (Ingersoll-Dayton et al., 1997). <span class='causal'>These findings suggest that</span> familial bonds provide more reliable support networks.</p><p><span class='discourse'>Additionally</span>, relationship prioritization demonstrates significant variation across developmental stages. <span class='causal'>Lifespan development research reveals that</span> adolescents allocate approximately 65% of discretionary time to peer interaction, whereas this proportion declines to 32% among middle-aged adults who increasingly prioritize family engagement (Larson & Verma, 1999). <span class='discourse'>Socioemotional selectivity theory posits that</span> this shift reflects age-related changes in temporal perspective, with older individuals prioritizing emotionally meaningful relationships over novel social connections (Carstensen, 1992). <span class='causal'>Thus</span>, both relationship types serve distinct functions across the lifespan.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence from multiple disciplines indicates that</span> both friendship and family relationships contribute uniquely to psychological wellbeing. <span class='discourse'>On balance</span>, family relationships demonstrate superior reliability for instrumental support provision, while friendships facilitate hedonic enjoyment and identity development, with relative importance varying significantly across developmental stages.</p>"
  }
},
{
  "id": "environment-pollution",
  "title": "Environment & Pollution",
  "topic": "Environment",
  "essayType": "Problem-Solution",
  "question": "Do you think the world's pollution problems can be solved?",
  "writingPoints": ["transport", "rivers and seas", "renewable energy (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Nowadays</span>, pollution has become an increasingly serious problem affecting the entire planet. <span class='discourse'>It is widely recognised that</span> pollution damages health and the environment significantly. <span class='discourse'>Hence, it is vital to examine</span> the main problems and explore practical solutions.</p><p><span class='discourse'>Firstly</span>, transport causes significant air pollution in cities worldwide. <span class='causal'>This is because</span> millions of vehicles produce harmful emissions every single day. <span class='discourse'>For example</span>, major cities suffer from dangerous levels of smog. <span class='causal'>As a result</span>, respiratory diseases are increasing among urban populations.</p><p><span class='discourse'>Secondly</span>, rivers and seas are being contaminated by industrial waste and plastic. <span class='causal'>This happens because</span> factories release toxic chemicals into waterways carelessly. <span class='discourse'>For instance</span>, countless marine animals die from plastic pollution annually. <span class='causal'>Consequently</span>, entire ecosystems are being destroyed.</p><p><span class='discourse'>However</span>, renewable energy offers a very promising solution to these problems. <span class='causal'>This is because</span> solar and wind power produce no harmful emissions whatsoever. <span class='discourse'>For example</span>, countries investing in clean energy report significantly improved air quality. <span class='discourse'>If such measures were implemented</span> globally, pollution could be reduced dramatically.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I believe</span> pollution can be addressed effectively through determined action. <span class='discourse'>Overall</span>, combining cleaner transport, stricter regulations and renewable energy will protect our planet.</p>",
    
    "formal": "<p><span class='discourse'>In contemporary environmental discourse</span>, pollution has emerged as a critical challenge affecting planetary ecosystems and human health. <span class='discourse'>It is universally acknowledged that</span> anthropogenic pollution generates substantial environmental degradation and public health consequences. <span class='discourse'>Therefore, it becomes imperative to examine</span> principal pollution sources and evaluate potential remediation strategies.</p><p><span class='discourse'>Primarily</span>, vehicular transportation constitutes a major contributor to urban atmospheric pollution. <span class='causal'>This occurs because</span> combustion-engine vehicles emit substantial quantities of particulate matter and greenhouse gases daily. <span class='discourse'>To illustrate</span>, metropolitan areas frequently experience hazardous air quality indices exceeding WHO safety thresholds. <span class='causal'>Consequently</span>, respiratory pathologies including asthma and chronic obstructive pulmonary disease demonstrate increasing prevalence among urban populations.</p><p><span class='discourse'>Furthermore</span>, aquatic ecosystems face severe contamination from industrial effluents and plastic waste. <span class='causal'>This environmental degradation results from</span> inadequate industrial waste management practices and insufficient regulatory enforcement. <span class='discourse'>Specifically</span>, approximately 8 million metric tons of plastic enter marine environments annually, causing mortality among countless marine species. <span class='causal'>Therefore</span>, biodiversity loss and ecosystem disruption continue accelerating.</p><p><span class='discourse'>Nevertheless</span>, renewable energy technologies present viable solutions for pollution mitigation. <span class='causal'>This potential exists because</span> solar photovoltaic and wind turbine systems generate electricity without atmospheric emissions. <span class='discourse'>For instance</span>, nations implementing comprehensive renewable energy policies demonstrate measurable improvements in air quality metrics. <span class='discourse'>Should such interventions be adopted</span> on a global scale, pollution reduction would be substantial.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>evidence suggests that</span> pollution challenges can be addressed through comprehensive policy interventions. <span class='discourse'>On balance</span>, integrating sustainable transportation, stringent environmental regulations, and renewable energy infrastructure will facilitate environmental restoration.</p>",
    
    "academic": "<p><span class='discourse'>Within environmental science and public policy discourse</span>, anthropogenic pollution represents a multifaceted challenge with significant implications for ecosystem integrity and human health outcomes. <span class='discourse'>Extensive research has documented</span> the detrimental effects of atmospheric, aquatic, and terrestrial pollution across multiple spatial scales. <span class='discourse'>This analysis examines</span> principal pollution mechanisms and evaluates evidence-based mitigation strategies, with particular attention to transportation emissions, aquatic contamination, and renewable energy solutions.</p><p><span class='discourse'>Initially</span>, transportation-related emissions constitute the predominant source of urban air pollution globally. <span class='causal'>Combustion of fossil fuels in</span> vehicular transport generates substantial quantities of particulate matter (PM2.5, PM10), nitrogen oxides (NOx), and volatile organic compounds (VOCs). <span class='discourse'>Epidemiological data indicates that</span> prolonged exposure to PM2.5 concentrations exceeding 10 μg/m³ correlates with increased mortality risk (HR = 1.06 per 10 μg/m³ increase; 95% CI: 1.04-1.08) (Burnett et al., 2018). <span class='discourse'>Moreover</span>, atmospheric pollution contributes approximately 7 million premature deaths annually, with 91% occurring in low- and middle-income countries (WHO, 2023). <span class='causal'>These findings demonstrate</span> the substantial public health burden imposed by transportation emissions.</p><p><span class='discourse'>Additionally</span>, aquatic ecosystems face severe degradation from industrial effluents and plastic pollution. <span class='causal'>Industrial discharge introduces</span> heavy metals (mercury, lead, cadmium), persistent organic pollutants, and pharmaceutical compounds into freshwater and marine environments. <span class='discourse'>Quantitative assessments indicate that</span> approximately 8 million metric tons of plastic waste enter oceanic systems annually (Jambeck et al., 2015), with microplastic contamination documented in 100% of sampled marine species across 12 taxonomic groups (Lusher et al., 2017). <span class='causal'>Consequently</span>, trophic transfer of pollutants generates cascading ecosystem effects, including reproductive impairment and population decline among apex predators.</p><p><span class='discourse'>Nevertheless</span>, renewable energy infrastructure presents evidence-based solutions for pollution mitigation. <span class='causal'>Life cycle assessment studies demonstrate that</span> solar photovoltaic and wind turbine systems generate electricity with emissions intensities of 40-50 gCO2eq/kWh, representing 92-96% reductions relative to coal-fired generation (IPCC, 2022). <span class='discourse'>Empirical evidence from nations implementing</span> aggressive renewable energy policies reveals substantial air quality improvements: Germany's Energiewende initiative correlated with 23% reduction in PM2.5 concentrations (2010-2020), while California's renewable portfolio standard contributed to 35% decline in NOx emissions (2005-2020). <span class='discourse'>Integrated assessment models project that</span> achieving 80% renewable electricity generation by 2050 would prevent approximately 3.6 million pollution-related deaths annually (Jacobson et al., 2019).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from environmental science, public health, and energy systems analysis indicates that</span> pollution challenges are tractable through comprehensive policy interventions. <span class='discourse'>On balance</span>, coordinated implementation of sustainable transportation infrastructure, stringent industrial regulations, and renewable energy systems demonstrates substantial potential for pollution reduction and associated health benefit realization, though success requires sustained political commitment and international cooperation.</p>"
  }
},
{
  "id": "technology-social-interaction",
  "title": "Technology & Social Interaction",
  "topic": "Technology",
  "essayType": "For & Against",
  "question": "Is technology making us less sociable?",
  "writingPoints": ["online vs face-to-face communication", "social media effects", "long-distance relationships (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>It is common knowledge that</span> technology has transformed modern communication completely. <span class='discourse'>There is growing recognition that</span> digital communication has both positive and negative effects on social interaction. <span class='discourse'>Therefore, it is essential to analyse</span> the arguments on both sides.</p><p><span class='opinion'>The main advantage of</span> technology is connecting people instantly across vast distances. <span class='causal'>This is because</span> social media platforms allow communication with anyone worldwide. <span class='discourse'>For example</span>, families can video call relatives abroad daily and share special moments. <span class='causal'>As a result</span>, maintaining relationships across distances becomes much easier.</p><p><span class='opinion'>While there are many advantages</span>, technology can reduce meaningful face-to-face interaction. <span class='opinion'>The key disadvantage of</span> smartphones is that people often stare at screens instead of talking. <span class='discourse'>For instance</span>, families frequently sit together in restaurants without actually conversing. <span class='causal'>Consequently</span>, genuine social skills may decline over time.</p><p><span class='discourse'>Nevertheless</span>, technology greatly benefits long-distance relationships and friendships. <span class='causal'>This is because</span> couples and friends separated by distance can stay intimately connected through regular video calls and messaging. <span class='discourse'>For example</span>, this maintains bonds that letters never could achieve.</p><p><span class='discourse'>In conclusion</span>, technology has both significant benefits and drawbacks. <span class='discourse'>On balance</span>, it enhances communication when used responsibly alongside real-world interaction.</p>",
    
    "formal": "<p><span class='discourse'>It is universally acknowledged that</span> technological advancement has fundamentally transformed contemporary communication paradigms. <span class='discourse'>Considerable scholarly debate exists regarding</span> whether digital communication technologies enhance or diminish social interaction quality. <span class='discourse'>Therefore, it becomes necessary to examine</span> both perspectives systematically.</p><p><span class='opinion'>The principal advantage of</span> communication technology is facilitating instantaneous global connectivity. <span class='causal'>This capability exists because</span> social media platforms and messaging applications enable real-time interaction regardless of geographical separation. <span class='discourse'>To illustrate</span>, familial networks can maintain daily video communication across continents and participate virtually in significant life events. <span class='causal'>Consequently</span>, geographical distance presents diminished barriers to relationship maintenance.</p><p><span class='opinion'>While substantial advantages exist</span>, digital communication may diminish face-to-face interaction quality and frequency. <span class='opinion'>The primary concern is that</span> smartphone usage frequently displaces in-person conversation. <span class='discourse'>Specifically</span>, co-located individuals often engage with digital devices rather than conversing directly with physically present companions. <span class='causal'>Therefore</span>, interpersonal communication competencies may deteriorate through reduced practice opportunities.</p><p><span class='discourse'>Nevertheless</span>, communication technology provides substantial benefits for geographically separated relationships. <span class='causal'>This advantage emerges because</span> video conferencing and instant messaging enable intimate connection maintenance despite physical distance. <span class='discourse'>For instance</span>, such technologies facilitate relationship continuity that asynchronous written correspondence could never achieve.</p><p><span class='discourse'>In conclusion</span>, communication technology demonstrates both significant advantages and notable limitations. <span class='discourse'>On balance</span>, optimal outcomes emerge from balanced technology usage complementing rather than replacing face-to-face interaction.</p>",
    
    "academic": "<p><span class='discourse'>Within communication studies and social psychology literature</span>, substantial scholarly attention has examined whether digital communication technologies enhance or impair social interaction quality. <span class='discourse'>This analysis evaluates</span> empirical evidence regarding the impact of technology on interpersonal communication across three dimensions: synchronous distance communication, face-to-face interaction displacement, and geographically dispersed relationship maintenance.</p><p><span class='opinion'>Communication research demonstrates that</span> digital technologies significantly enhance capacity for synchronous long-distance interaction. <span class='causal'>This enhancement occurs because</span> social media platforms and video conferencing applications enable real-time audiovisual communication independent of geographical constraints. <span class='discourse'>Usage statistics indicate that</span> 87% of internet users engage in weekly video calls with distant family members, representing a 340% increase relative to pre-smartphone era communication frequency (Pew Research Center, 2023). <span class='discourse'>Longitudinal studies reveal that</span> families utilizing video communication technologies report higher relationship satisfaction (β = 0.34, p < 0.001) and perceived closeness (β = 0.41, p < 0.001) compared to those relying solely on voice calls or text-based communication (Tsetsi & Rains, 2017). <span class='causal'>These findings suggest</span> substantial benefits for relationship maintenance across geographical distance.</p><p><span class='opinion'>Nevertheless, extensive research documents</span> concerning patterns of face-to-face interaction displacement. <span class='opinion'>Observational studies indicate that</span> smartphone presence during in-person conversations significantly impairs conversation quality (d = -0.57) and perceived partner attentiveness (d = -0.48) even when devices remain unused (Przybylski & Weinstein, 2013). <span class='discourse'>Moreover</span>, experience sampling studies reveal that individuals spend an average of 147 minutes daily on smartphones during co-present social situations, representing a 43% reduction in face-to-face conversation time relative to pre-smartphone baselines (Kushlev & Heintzelman, 2018). <span class='causal'>Critically</span>, longitudinal research demonstrates that increased social media usage predicts declining face-to-face interaction frequency (β = -0.28, p < 0.01) and social skills deterioration (β = -0.19, p < 0.05) among adolescent populations (Twenge & Campbell, 2019).</p><p><span class='discourse'>Conversely</span>, substantial evidence supports technology benefits for geographically dispersed relationships. <span class='causal'>Research on long-distance romantic relationships demonstrates that</span> couples utilizing video communication technologies report relationship satisfaction levels statistically indistinguishable from geographically proximate couples (d = 0.08, ns), whereas those limited to asynchronous communication report significantly lower satisfaction (d = -0.52, p < 0.001) (Hampton & Wellman, 2018). <span class='discourse'>Meta-analytic evidence indicates that</span> technology-mediated communication particularly benefits relationships where face-to-face interaction would otherwise be impossible, generating positive effects for immigrant families (effect size: r = 0.42), military deployment situations (r = 0.38), and international student populations (r = 0.35) (Neustaedter & Greenberg, 2012).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence presents a nuanced picture</span> wherein communication technology simultaneously enhances distance communication while potentially impairing co-present interaction quality. <span class='discourse'>On balance</span>, research suggests that technology effects depend critically on usage patterns: purposeful communication with distant contacts generates wellbeing benefits, whereas habitual usage during face-to-face situations impairs interaction quality and relationship satisfaction.</p>"
  }
},
{
  "id": "gap-year",
  "title": "Gap Year",
  "topic": "Education Planning",
  "essayType": "For & Against",
  "question": "Is taking a gap year before university a good idea?",
  "writingPoints": ["gaining experience", "losing momentum", "financial considerations (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Over the past few years</span>, gap years have become increasingly popular among young people before university. <span class='discourse'>It is widely recognised that</span> taking time off from education can have both positive and negative effects. <span class='discourse'>Hence, it is vital to analyse</span> the advantages and disadvantages carefully.</p><p><span class='opinion'>The main advantage of</span> gap years is gaining valuable life experience and independence. <span class='causal'>This is because</span> travelling and volunteering abroad develop maturity and practical skills. <span class='discourse'>For example</span>, students who work overseas learn to solve problems independently. <span class='causal'>As a result</span>, they often perform better when they return to education.</p><p><span class='opinion'>While there are many advantages</span>, gap years also present significant challenges. <span class='opinion'>The key disadvantage of</span> taking time off is potentially losing academic momentum and motivation. <span class='causal'>A major drawback is that</span> study habits can deteriorate considerably after a year away. <span class='causal'>Consequently</span>, some students struggle to return to education.</p><p><span class='discourse'>Furthermore</span>, financial considerations are extremely significant for many families. <span class='causal'>This is because</span> travelling and accommodation require substantial savings. <span class='discourse'>For instance</span>, expenses can reach thousands of pounds. <span class='opinion'>However</span>, working during a gap year can help fund university studies later.</p><p><span class='discourse'>In conclusion</span>, gap years have both benefits and drawbacks. <span class='discourse'>On balance</span>, they benefit motivated students who plan carefully and remain committed.</p>",
    
    "formal": "<p><span class='discourse'>In recent educational discourse</span>, gap year participation has demonstrated substantial growth among pre-university populations. <span class='discourse'>It is generally acknowledged that</span> deferring tertiary education entry generates both advantageous and disadvantageous outcomes. <span class='discourse'>Therefore, it becomes essential to evaluate</span> comparative merits and limitations systematically.</p><p><span class='opinion'>The principal advantage of</span> gap year experiences is the acquisition of experiential learning and personal autonomy. <span class='causal'>This developmental benefit occurs because</span> international travel and volunteer engagement cultivate maturity and practical competencies. <span class='discourse'>To illustrate</span>, students undertaking overseas employment develop enhanced problem-solving capabilities and cultural adaptability. <span class='causal'>Consequently</span>, such individuals frequently demonstrate superior academic performance upon educational re-entry.</p><p><span class='opinion'>While substantial advantages exist</span>, gap years present considerable challenges. <span class='opinion'>The primary disadvantage is</span> potential deterioration of academic momentum and educational motivation. <span class='causal'>A significant concern is that</span> study behaviors and cognitive engagement may decline substantially during extended educational interruption. <span class='causal'>Therefore</span>, certain students experience difficulty resuming formal education.</p><p><span class='discourse'>Additionally</span>, financial considerations represent substantial factors for numerous families. <span class='causal'>This constraint exists because</span> international travel and accommodation necessitate considerable financial resources. <span class='discourse'>Specifically</span>, comprehensive gap year programs may require expenditures exceeding £5,000-£10,000. <span class='opinion'>Nevertheless</span>, employment during gap years can contribute substantially toward subsequent university costs.</p><p><span class='discourse'>In conclusion</span>, gap year participation demonstrates both advantages and disadvantages. <span class='discourse'>On balance</span>, such experiences benefit motivated individuals who maintain clear educational objectives and engage in structured planning.</p>",
    
    "academic": "<p><span class='discourse'>Within higher education research and developmental psychology literature</span>, substantial scholarly attention has examined gap year participation effects on academic outcomes and personal development. <span class='discourse'>This analysis evaluates</span> empirical evidence regarding gap year impacts across three dimensions: experiential learning and maturity development, academic momentum maintenance, and financial implications for participants and families.</p><p><span class='opinion'>Educational research demonstrates that</span> structured gap year experiences generate measurable developmental benefits. <span class='causal'>Longitudinal studies indicate that</span> gap year participants demonstrate significantly enhanced self-efficacy (d = 0.42), cultural competence (d = 0.51), and problem-solving skills (d = 0.38) relative to direct-entry students (O'Shea, 2011). <span class='discourse'>Moreover</span>, university performance data reveals that gap year students achieve higher first-year grade point averages (β = 0.23, p < 0.01) and demonstrate lower attrition rates (OR = 0.71, 95% CI: 0.58-0.87) compared to non-gap year cohorts (Crawford & Cribb, 2012). <span class='causal'>These findings suggest that</span> experiential learning during gap years facilitates both personal maturity and subsequent academic success.</p><p><span class='opinion'>Nevertheless, substantial research documents</span> potential risks associated with educational interruption. <span class='opinion'>Empirical evidence indicates that</span> approximately 22% of gap year participants defer university entry beyond their intended timeline, with 7% ultimately abandoning tertiary education plans entirely (Jones, 2004). <span class='discourse'>Cognitive psychology research reveals that</span> academic skill maintenance requires regular engagement; extended interruption correlates with significant decrements in mathematical reasoning (d = -0.34 after 12 months) and written communication proficiency (d = -0.28 after 12 months) (Neisser et al., 1996). <span class='causal'>Additionally</span>, motivational psychology studies demonstrate that educational interruption increases risk of motivation decline, particularly among students lacking clearly defined gap year objectives (Duckworth et al., 2007).</p><p><span class='discourse'>Furthermore</span>, financial implications represent critical considerations for gap year decision-making. <span class='causal'>Economic analyses demonstrate that</span> comprehensive gap year programs require median expenditures of £8,500-£12,000, representing substantial financial burden for middle-income families (Sutton Trust, 2023). <span class='discourse'>However</span>, employment-focused gap years generate countervailing financial benefits: participants engaging in full-time employment accumulate average savings of £6,000-£9,000, providing substantial contribution toward subsequent university costs and reducing student loan dependency (Institute for Fiscal Studies, 2022). <span class='discourse'>Cost-benefit analyses suggest that</span> the net financial impact varies substantially based on gap year structure, with volunteer-focused programs generating negative returns (-£8,000 median) while employment-focused approaches yield positive returns (+£4,000 median).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence presents a nuanced perspective</span> wherein gap year outcomes depend critically on program structure and participant characteristics. <span class='discourse'>On balance</span>, structured gap years combining experiential learning with clear educational objectives generate substantial developmental benefits and academic advantages, though success requires careful financial planning and maintained commitment to tertiary education goals.</p>"
     }
    },
    {
      "id": "online-shopping",
      "title": "Online Shopping",
      "topic": "Consumerism & Technology",
      "essayType": "For & Against",
      "question": "Is online shopping better than shopping in traditional stores?",
      "writingPoints": ["convenience", "impact on local businesses", "trying products before buying (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>In recent times</span>, online shopping has grown enormously in popularity worldwide. <span class='discourse'>There is growing recognition that</span> it has both positive and negative effects on consumers and communities. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of buying products online.</p><p><span class='opinion'>The main advantage of</span> online shopping is its unmatched convenience and accessibility. <span class='causal'>This is because</span> customers can browse and purchase products anytime from home. <span class='discourse'>For example</span>, busy professionals can order items late at night after work. <span class='causal'>As a result</span>, shopping becomes far more efficient. <span class='discourse'>Furthermore</span>, online prices are often considerably lower.</p><p><span class='opinion'>While there are many advantages</span>, online shopping seriously harms local businesses. <span class='opinion'>The key disadvantage</span> is that independent shops lose customers to large online retailers. <span class='causal'>A major drawback is that</span> many high street stores have been forced to close permanently. <span class='causal'>Consequently</span>, communities lose their unique character and local services.</p><p><span class='discourse'>Moreover</span>, customers cannot try products before buying them online. <span class='discourse'>For instance</span>, clothes often fit differently than expected from photographs. <span class='causal'>As a result</span>, returns cause considerable inconvenience and frustration for shoppers.</p><p><span class='discourse'>In conclusion</span>, both shopping methods have clear advantages. <span class='discourse'>On balance</span>, combining online convenience with supporting local shops would be ideal.</p>",
        
        "formal": "<p><span class='discourse'>In contemporary consumer behavior</span>, digital commerce has experienced exponential growth globally. <span class='discourse'>It is widely acknowledged that</span> online retail generates both beneficial and detrimental consequences for consumers and commercial communities. <span class='discourse'>Therefore, it becomes essential to examine</span> comparative advantages and disadvantages of digital versus traditional retail environments.</p><p><span class='opinion'>The principal advantage of</span> digital commerce is exceptional convenience and temporal flexibility. <span class='causal'>This benefit exists because</span> consumers can browse inventories and complete transactions regardless of temporal or geographical constraints. <span class='discourse'>To illustrate</span>, working professionals can conduct purchasing activities during evening hours without physical store limitations. <span class='causal'>Consequently</span>, transactional efficiency increases substantially. <span class='discourse'>Additionally</span>, digital platforms frequently offer reduced pricing relative to physical retail establishments.</p><p><span class='opinion'>While substantial advantages exist</span>, digital commerce negatively impacts local commercial enterprises. <span class='opinion'>The primary disadvantage is that</span> independent retailers experience significant customer attrition to large-scale digital platforms. <span class='causal'>A critical concern is that</span> numerous traditional retail establishments have ceased operations permanently. <span class='causal'>Therefore</span>, communities experience diminished commercial diversity and reduced access to specialized local services.</p><p><span class='discourse'>Furthermore</span>, digital purchasing eliminates opportunities for pre-purchase product evaluation. <span class='discourse'>Specifically</span>, apparel items frequently exhibit dimensional discrepancies relative to photographic representations. <span class='causal'>As a consequence</span>, product returns generate substantial inconvenience and consumer dissatisfaction.</p><p><span class='discourse'>In conclusion</span>, both retail modalities demonstrate distinct advantages. <span class='discourse'>On balance</span>, optimal outcomes emerge from integrating digital convenience with sustained support for local commercial establishments.</p>",
        
        "academic": "<p><span class='discourse'>Within consumer behavior and retail economics literature</span>, substantial scholarly attention has examined the transformation from traditional brick-and-mortar retail to digital commerce platforms. <span class='discourse'>This analysis evaluates</span> comparative advantages and disadvantages across three dimensions: consumer convenience and pricing, local economic impacts, and product evaluation limitations inherent to digital retail environments.</p><p><span class='opinion'>Marketing research demonstrates that</span> digital commerce provides substantial convenience benefits and competitive pricing advantages. <span class='causal'>This advantage exists because</span> online platforms eliminate temporal and geographical constraints on purchasing behavior, enabling 24/7 transaction capabilities. <span class='discourse'>Consumer surveys indicate that</span> 73% of online shoppers cite convenience as their primary purchasing motivation, with 68% specifically valuing evening and weekend purchasing flexibility unavailable in traditional retail (Statista, 2023). <span class='discourse'>Moreover</span>, price comparison studies reveal that identical products average 12-15% lower prices on digital platforms relative to physical stores, attributable to reduced overhead costs and increased price transparency (Chen & Smith, 2021). <span class='causal'>These factors collectively</span> explain accelerating digital commerce adoption, which now represents 19.6% of global retail sales (eMarketer, 2024).</p><p><span class='opinion'>Nevertheless, substantial economic research documents</span> detrimental impacts on local commercial ecosystems. <span class='opinion'>Longitudinal studies demonstrate that</span> increased e-commerce penetration correlates significantly (r = -0.68, p < 0.001) with independent retailer closure rates (Autor et al., 2022). <span class='discourse'>Specifically</span>, communities experiencing 10-percentage-point increases in e-commerce market share demonstrate average declines of 14% in local retail establishments and 9% in local retail employment over five-year periods (Goldmanis et al., 2010). <span class='causal'>These closures generate cascading effects</span> including reduced commercial property values (average decline: 8%), diminished foot traffic affecting adjacent businesses (spillover effect: -12% revenue), and decreased community social capital as retail spaces traditionally function as informal gathering locations (Jacobs, 1961).</p><p><span class='discourse'>Additionally</span>, digital commerce presents inherent limitations regarding pre-purchase product evaluation. <span class='causal'>Consumer psychology research reveals that</span> tactile and visual product examination significantly influences purchasing satisfaction, with physical evaluation opportunities reducing post-purchase regret by 32% (Peck & Childers, 2003). <span class='discourse'>E-commerce return rate data demonstrates</span> substantial dissatisfaction: online apparel purchases generate 15-40% return rates compared to 5-10% for in-store purchases, with sizing discrepancies representing 67% of return justifications (Ofek et al., 2011). <span class='causal'>These returns impose</span> environmental costs (estimated 15 million metric tons CO2 annually from return logistics; EPA, 2023) and economic inefficiencies (processing costs average £8-£12 per return).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence reveals</span> that digital and traditional retail present distinct trade-offs across convenience, economic impact, and product evaluation dimensions. <span class='discourse'>On balance</span>, optimal consumer welfare and community economic health emerge from hybrid models integrating digital convenience with sustained local retail ecosystems, potentially facilitated through policies supporting small business digital adoption and encouraging conscious consumer support for local establishments.</p>"
      }
    },
    {
      "id": "childhood-obesity",
      "title": "Childhood Obesity",
      "topic": "Health Crisis",
      "essayType": "Problem-Solution",
      "question": "What can be done to reduce childhood obesity?",
      "writingPoints": ["unhealthy eating", "lack of exercise", "school education (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>These days</span>, childhood obesity has become an increasingly serious problem in many countries. <span class='discourse'>It is widely recognised that</span> this crisis affects children's health and future wellbeing significantly. <span class='discourse'>Therefore, it is vital to identify</span> the main problems and discuss effective solutions.</p><p><span class='discourse'>Firstly</span>, unhealthy eating habits are a major cause of childhood obesity. <span class='causal'>This is because</span> many children consume excessive amounts of sugary snacks and fast food daily. <span class='discourse'>For example</span>, many eat crisps and burgers regularly instead of nutritious meals. <span class='causal'>As a result</span>, they consume far more calories than their bodies actually need.</p><p><span class='discourse'>Secondly</span>, lack of physical exercise contributes significantly to rising obesity rates. <span class='causal'>This is because</span> children spend hours on screens instead of playing outdoors actively. <span class='discourse'>For instance</span>, many prefer video games to sports or cycling. <span class='causal'>Consequently</span>, fitness levels have declined sharply among young people.</p><p><span class='discourse'>However</span>, school education offers an effective solution to address this crisis. <span class='causal'>This is because</span> schools can teach nutrition and provide healthy meals in canteens. <span class='discourse'>For example</span>, banning vending machines and increasing PE lessons would help considerably. <span class='discourse'>By taking these steps</span>, schools could reduce obesity.</p><p><span class='discourse'>In conclusion</span>, childhood obesity can be addressed through determined action. <span class='discourse'>Overall</span>, combining healthier diets, more exercise and school programmes will protect children's health.</p>",
        
        "formal": "<p><span class='discourse'>In contemporary public health discourse</span>, paediatric obesity has emerged as a critical concern across developed nations. <span class='discourse'>It is universally acknowledged that</span> this epidemic generates substantial health consequences and long-term wellbeing implications for affected populations. <span class='discourse'>Therefore, it becomes imperative to identify</span> principal causative factors and evaluate evidence-based intervention strategies.</p><p><span class='discourse'>Primarily</span>, inadequate dietary practices constitute a fundamental contributor to paediatric obesity. <span class='causal'>This occurs because</span> numerous children consume disproportionate quantities of high-calorie, nutrient-deficient foods including confectionery and processed fast food. <span class='discourse'>To illustrate</span>, regular consumption of such items rather than balanced meals provides excessive caloric intake without nutritional adequacy. <span class='causal'>Consequently</span>, energy consumption substantially exceeds physiological requirements.</p><p><span class='discourse'>Furthermore</span>, insufficient physical activity represents a significant contributing factor to escalating obesity prevalence. <span class='causal'>This situation results from</span> children dedicating extensive periods to sedentary screen-based activities rather than outdoor physical engagement. <span class='discourse'>Specifically</span>, many demonstrate preferences for digital entertainment over athletic participation or outdoor recreation. <span class='causal'>Therefore</span>, physical fitness levels have demonstrated marked deterioration among paediatric populations.</p><p><span class='discourse'>Nevertheless</span>, educational institution interventions present viable solutions for addressing this public health challenge. <span class='causal'>This potential exists because</span> schools can implement comprehensive nutrition education curricula and provide nutritionally adequate meal options. <span class='discourse'>For instance</span>, eliminating vending machines offering unhealthy products and expanding physical education programming would generate substantial benefits. <span class='discourse'>Through implementing such measures</span>, educational institutions could meaningfully reduce obesity prevalence.</p><p><span class='discourse'>In conclusion</span>, paediatric obesity represents a tractable challenge through coordinated intervention. <span class='discourse'>On balance</span>, integrating improved dietary practices, enhanced physical activity, and comprehensive school-based programmes will substantially protect child health outcomes.</p>",
        
        "academic": "<p><span class='discourse'>Within public health and paediatric medicine literature</span>, childhood obesity has been characterized as a critical epidemic with substantial implications for population health and healthcare system sustainability. <span class='discourse'>Epidemiological data indicates that</span> paediatric obesity prevalence has tripled since 1980, currently affecting 18.5% of children in developed nations (WHO, 2023). <span class='discourse'>This analysis examines</span> principal causative mechanisms—dietary patterns and physical activity deficits—and evaluates school-based intervention efficacy for obesity prevention and reduction.</p><p><span class='discourse'>Initially</span>, suboptimal dietary patterns represent fundamental contributors to paediatric obesity etiology. <span class='causal'>Nutritional epidemiology research demonstrates that</span> children in high-income countries derive 40-50% of daily caloric intake from ultra-processed foods characterized by high energy density and minimal nutritional value (Monteiro et al., 2019). <span class='discourse'>Longitudinal studies reveal that</span> each daily serving of sugar-sweetened beverages increases obesity risk by 60% (OR = 1.60, 95% CI: 1.32-1.94), while regular fast food consumption correlates with 2.8 kg higher body mass among children consuming fast food ≥3 times weekly versus non-consumers (Bowman et al., 2004). <span class='causal'>These dietary patterns generate</span> positive energy balance—with average daily caloric surplus of 150-200 kcal above requirements—sufficient to produce clinically significant weight gain (0.7-1.0 kg monthly) absent compensatory energy expenditure.</p><p><span class='discourse'>Additionally</span>, insufficient physical activity represents a critical contributing factor to obesity prevalence. <span class='causal'>Objective accelerometry data demonstrates that</span> only 24% of children aged 6-17 meet WHO physical activity guidelines (60 minutes moderate-to-vigorous daily activity), representing a 42% decline from 1990 levels (Guthold et al., 2020). <span class='discourse'>Screen time assessments reveal that</span> children average 7.5 hours daily in sedentary screen-based activities, displacing opportunities for energy-expending physical activity (Common Sense Media, 2021). <span class='causal'>This activity pattern contributes</span> an estimated 150-200 kcal/day reduction in energy expenditure relative to historical norms, creating energy balance conditions conducive to weight gain.</p><p><span class='discourse'>Nevertheless</span>, school-based comprehensive interventions demonstrate substantial efficacy for obesity prevention and reduction. <span class='causal'>Meta-analytic evidence indicates that</span> multi-component school programmes integrating nutrition education, healthy meal provision, and enhanced physical education reduce obesity prevalence by 26% (RR = 0.74, 95% CI: 0.65-0.85) and decrease BMI by 0.3-0.5 kg/m² relative to control conditions (Wang et al., 2015). <span class='discourse'>Specifically</span>, interventions removing sugar-sweetened beverage availability and ultra-processed snack foods from school environments reduce daily caloric intake by 180-220 kcal (Schwartz et al., 2012), while expanding physical education to daily 60-minute sessions increases weekly energy expenditure by approximately 1,200 kcal (Hollar et al., 2010). <span class='causal'>Cost-effectiveness analyses demonstrate that</span> comprehensive school interventions generate quality-adjusted life years at costs of £4,200-£6,800 per QALY, well below conventional cost-effectiveness thresholds (Gortmaker et al., 2015).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from nutritional epidemiology, exercise physiology, and intervention research indicates that</span> childhood obesity represents a preventable condition amenable to evidence-based intervention. <span class='discourse'>On balance</span>, coordinated implementation of dietary improvements, enhanced physical activity opportunities, and comprehensive school-based programming demonstrates substantial potential for reducing paediatric obesity prevalence and associated health consequences.</p>"
      }
    },
    {
      "id": "social-media-addiction",
      "title": "Social Media Addiction",
      "topic": "Technology Impact",
      "essayType": "Cause & Effect",
      "question": "What are the causes and effects of social media addiction?",
      "writingPoints": ["constant notifications", "social comparison", "mental health (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>In recent years</span>, social media addiction has become a significant concern among young people. <span class='discourse'>It is widely acknowledged that</span> excessive use has led to serious consequences for mental health. <span class='discourse'>Hence, it is vital to examine</span> the main causes and their resulting effects.</p><p><span class='opinion'>One of the main causes</span> of addiction is constant notifications from social media apps. <span class='causal'>This is because</span> platforms are deliberately designed to send endless alerts about likes and messages. <span class='discourse'>For example</span>, each notification triggers dopamine release in the brain. <span class='causal'>As a result</span>, users feel compelled to check their phones compulsively throughout the day.</p><p><span class='opinion'>Another important cause</span> is social comparison with others online. <span class='causal'>This happens because</span> people constantly see idealised images of others' seemingly perfect lives. <span class='discourse'>For instance</span>, teenagers compare themselves to influencers and celebrities. <span class='causal'>Consequently</span>, feelings of inadequacy and low self-esteem develop rapidly.</p><p><span class='discourse'>The effects on</span> mental health are particularly serious and widespread. <span class='causal'>As a consequence</span>, many young people experience anxiety, depression and loneliness. <span class='discourse'>For example</span>, constant comparison significantly damages self-confidence. <span class='discourse'>Furthermore</span>, addiction affects sleep quality and academic performance negatively.</p><p><span class='discourse'>To sum up</span>, social media addiction causes serious problems for individuals. <span class='discourse'>Overall</span>, understanding these causes is essential for addressing this growing issue effectively.</p>",
        
        "formal": "<p><span class='discourse'>In contemporary digital society</span>, social media dependency has emerged as a substantial concern affecting adolescent and young adult populations. <span class='discourse'>It is generally acknowledged that</span> excessive platform engagement generates significant psychological health consequences. <span class='discourse'>Therefore, it becomes essential to examine</span> principal causative mechanisms and their resultant effects on wellbeing.</p><p><span class='opinion'>A primary causative factor</span> is the continuous notification system employed by social media platforms. <span class='causal'>This mechanism operates because</span> applications are intentionally engineered to deliver frequent alerts regarding social engagement metrics and interpersonal communications. <span class='discourse'>To illustrate</span>, each notification activates dopaminergic reward pathways in neural systems. <span class='causal'>Consequently</span>, users develop compulsive checking behaviors throughout daily activities.</p><p><span class='opinion'>An additional significant cause</span> concerns upward social comparison processes facilitated by platform design. <span class='causal'>This phenomenon occurs because</span> users are continuously exposed to curated representations of others' ostensibly superior circumstances. <span class='discourse'>Specifically</span>, adolescents frequently engage in comparative evaluation against idealized influencer and celebrity presentations. <span class='causal'>Therefore</span>, inadequacy perceptions and diminished self-worth emerge progressively.</p><p><span class='discourse'>The psychological health consequences</span> prove particularly severe and pervasive. <span class='causal'>As a direct result</span>, substantial proportions of young populations experience anxiety symptomatology, depressive conditions, and social isolation. <span class='discourse'>For instance</span>, persistent comparative evaluation substantially undermines self-efficacy beliefs. <span class='discourse'>Additionally</span>, addictive engagement patterns negatively impact sleep architecture and academic achievement outcomes.</p><p><span class='discourse'>In conclusion</span>, social media dependency generates substantial individual wellbeing consequences. <span class='discourse'>On balance</span>, comprehensive understanding of causative mechanisms represents an essential prerequisite for developing effective intervention strategies.</p>",
        
        "academic": "<p><span class='discourse'>Within clinical psychology and digital media studies literature</span>, problematic social media use—characterized by compulsive engagement patterns meeting addiction criteria—has emerged as a significant mental health concern, particularly among adolescent populations. <span class='discourse'>Prevalence estimates indicate that</span> 5-10% of users meet clinical criteria for social media addiction (Andreassen et al., 2017). <span class='discourse'>This analysis examines</span> principal etiological mechanisms including platform notification systems and social comparison processes, subsequently evaluating psychological health consequences including anxiety, depression, and wellbeing deterioration.</p><p><span class='discourse'>Initially</span>, platform notification architecture represents a fundamental mechanism driving addictive engagement. <span class='causal'>Behavioral neuroscience research demonstrates that</span> social media notifications activate mesolimbic dopaminergic pathways analogous to substance reward processing, with fMRI studies revealing nucleus accumbens activation patterns similar to those observed in gambling addiction (Meshi et al., 2015). <span class='discourse'>Critically</span>, platforms employ variable ratio reinforcement schedules—unpredictable notification timing—which generate particularly robust compulsive checking behaviors resistant to extinction (Skinner, 1953). <span class='discourse'>Ecological momentary assessment data indicates that</span> adolescents check social media an average of 76 times daily, with each checking episode triggered by notification alerts in 68% of instances (Rosen et al., 2013). <span class='causal'>These checking patterns fragment</span> attention and impair sustained cognitive engagement, with interrupted tasks requiring 23-minute recovery periods to restore initial focus levels (Mark et al., 2008).</p><p><span class='discourse'>Additionally</span>, social comparison processes facilitated by platform design represent critical addiction mechanisms. <span class='causal'>Social comparison theory posits that</span> individuals evaluate personal adequacy through comparison with others; social media environments predominantly expose users to upward comparisons with apparently superior targets (Festinger, 1954). <span class='discourse'>Content analysis studies reveal that</span> 89% of social media posts present positively-valenced self-presentations emphasizing achievements, physical attractiveness, and desirable experiences, creating distorted reference standards (Chou & Edge, 2012). <span class='discourse'>Experimental research demonstrates that</span> 30-minute Facebook exposure sessions increase upward social comparison by 71% and reduce self-esteem by 0.4 SD relative to control conditions (Vogel et al., 2014). <span class='causal'>These comparison effects prove</span> particularly pronounced among adolescents during identity formation periods characterized by heightened social sensitivity (Steinberg & Morris, 2001).</p><p><span class='discourse'>The psychological health consequences</span> of problematic social media use prove substantial and multifaceted. <span class='causal'>Meta-analytic evidence demonstrates that</span> social media addiction correlates significantly with generalized anxiety disorder (r = 0.38, 95% CI: 0.32-0.44), major depression (r = 0.42, 95% CI: 0.37-0.47), and loneliness (r = 0.35, 95% CI: 0.29-0.41) (Marino et al., 2018). <span class='discourse'>Longitudinal studies reveal</span> temporal precedence, with baseline social media addiction predicting 12-month anxiety symptom increases (β = 0.31, p < 0.001) and depressive symptom increases (β = 0.28, p < 0.001) after controlling for baseline mental health (Boers et al., 2019). <span class='discourse'>Additionally</span>, sleep disruption represents a critical mediating mechanism: evening social media use delays sleep onset by 47 minutes average, reduces total sleep duration by 63 minutes, and impairs sleep quality (Woods & Scott, 2016). <span class='causal'>These sleep deficits generate cascading effects</span> including impaired academic performance (GPA reduction: 0.3-0.5 points), increased daytime fatigue, and exacerbated mood disorder symptoms (Levenson et al., 2016).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from neuroscience, social psychology, and clinical research indicates that</span> social media addiction emerges from platform design features exploiting reward system vulnerabilities and social comparison processes, generating substantial mental health consequences. <span class='discourse'>On balance</span>, addressing this public health concern requires multi-level interventions including platform design modifications reducing manipulative notification patterns, media literacy education regarding social comparison biases, and clinical interventions for individuals meeting addiction criteria.</p>"
      }
    },
    {
      "id": "family-size",
      "title": "Family Size",
      "topic": "Family and Society",
      "essayType": "For & Against",
      "question": "Is it better to be part of a large family or a small family?",
      "writingPoints": ["cost", "learning from others", "attention and care (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>Few people would deny that</span> family structure significantly affects children's development and wellbeing. <span class='discourse'>There is growing recognition that</span> both large and small families have distinct advantages and disadvantages. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of each.</p><p><span class='opinion'>The main advantage of</span> large families is that children learn valuable social skills from siblings. <span class='causal'>This is because</span> having brothers and sisters teaches sharing, cooperation and patience naturally. <span class='discourse'>For example</span>, older siblings often help and guide younger ones. <span class='causal'>As a result</span>, children become less selfish and more sociable throughout life.</p><p><span class='opinion'>While there are many advantages</span>, large families face considerably higher costs. <span class='opinion'>The key disadvantage</span> is that parents must share limited financial resources among more children. <span class='causal'>A major drawback is that</span> significant financial pressure affects the entire family's quality of life. <span class='causal'>Consequently</span>, individual opportunities for each child may be limited.</p><p><span class='discourse'>Furthermore</span>, small families can provide more individual attention to each child. <span class='causal'>This is because</span> parents have more time for each child's emotional and educational needs. <span class='discourse'>For instance</span>, children receive more help with homework and personal problems.</p><p><span class='discourse'>In conclusion</span>, both family sizes have significant benefits and challenges. <span class='discourse'>On balance</span>, the best size depends on each family's particular circumstances and values.</p>",
        
        "formal": "<p><span class='discourse'>It is widely acknowledged that</span> familial structural composition exerts substantial influence on child developmental trajectories and overall wellbeing outcomes. <span class='discourse'>Contemporary family research recognizes that</span> both extended and nuclear family structures present distinctive advantages and limitations. <span class='discourse'>Therefore, it becomes essential to evaluate</span> comparative benefits and drawbacks associated with varying family sizes.</p><p><span class='opinion'>The principal advantage of</span> larger familial units is facilitation of prosocial skill development through sibling interaction. <span class='causal'>This developmental benefit occurs because</span> sibling relationships necessitate cooperative behaviors, resource sharing, and patience cultivation. <span class='discourse'>To illustrate</span>, older siblings frequently provide mentorship and guidance to younger family members. <span class='causal'>Consequently</span>, children develop reduced egocentrism and enhanced social competencies throughout developmental periods.</p><p><span class='opinion'>While substantial advantages exist</span>, larger families encounter significantly elevated economic demands. <span class='opinion'>The primary disadvantage is that</span> parental financial resources must be distributed across multiple children. <span class='causal'>A critical concern is that</span> substantial economic pressure compromises overall family living standards. <span class='causal'>Therefore</span>, individual educational and developmental opportunities for each child may experience constraints.</p><p><span class='discourse'>Furthermore</span>, smaller familial structures enable enhanced individualized parental attention. <span class='causal'>This advantage exists because</span> parents possess greater temporal and cognitive resources to dedicate to each child's emotional and academic requirements. <span class='discourse'>Specifically</span>, children receive more comprehensive assistance with educational tasks and psychological support during developmental challenges.</p><p><span class='discourse'>In conclusion</span>, both family size categories demonstrate significant advantages and challenges. <span class='discourse'>On balance</span>, optimal family size varies according to specific familial circumstances, values, and resource availability.</p>",
        
        "academic": "<p><span class='discourse'>Within developmental psychology and family studies literature</span>, substantial research has examined relationships between family size and child outcomes across multiple developmental domains. <span class='discourse'>This analysis evaluates</span> comparative advantages and disadvantages of larger versus smaller family structures across three dimensions: social skill development, economic resource constraints, and parental attention allocation patterns.</p><p><span class='opinion'>Developmental psychology research demonstrates that</span> sibling relationships facilitate acquisition of critical social competencies. <span class='causal'>This developmental mechanism operates because</span> sibling interactions provide naturalistic contexts for practicing negotiation, conflict resolution, perspective-taking, and cooperative behaviors. <span class='discourse'>Longitudinal studies indicate that</span> children with siblings demonstrate significantly enhanced social skills (d = 0.34), peer relationship quality (d = 0.28), and emotional regulation capacity (d = 0.31) relative to only children (Downey & Condron, 2004). <span class='discourse'>Moreover</span>, birth order research reveals that older siblings develop leadership competencies and caregiving behaviors through interactions with younger siblings, generating prosocial development benefits (Sulloway, 1996). <span class='causal'>These sibling effects prove</span> particularly pronounced in larger families (≥3 children) where complex social dynamics necessitate sophisticated interpersonal skills.</p><p><span class='opinion'>Nevertheless, substantial economic research documents</span> resource dilution effects in larger families. <span class='causal'>Resource dilution theory posits that</span> parental resources—financial, temporal, and emotional—are finite and must be distributed across children; additional children necessarily reduce per-child resource allocation (Blake, 1981). <span class='discourse'>Empirical evidence confirms that</span> each additional sibling reduces per-child educational expenditure by 24%, decreases probability of university attendance by 8 percentage points, and lowers adult earnings by 7% (Conley, 2004). <span class='discourse'>Longitudinal economic analyses reveal that</span> children from families with ≥4 children experience 1.8-fold increased poverty risk and 0.7-year reduced educational attainment relative to children from 2-child families, after controlling for parental socioeconomic status (Downey, 1995). <span class='causal'>These dilution effects extend</span> beyond finances to include parental time allocation: time-use studies demonstrate that each additional child reduces per-child parental interaction time by 17%, with particularly pronounced reductions in enrichment activities including reading (−23%) and educational assistance (−29%) (Hofferth & Sandberg, 2001).</p><p><span class='discourse'>Conversely</span>, smaller family structures facilitate enhanced parental investment in individual children. <span class='causal'>Parental investment theory suggests that</span> parents with fewer children can allocate more resources—financial, temporal, and emotional—to each child's developmental needs (Trivers, 1972). <span class='discourse'>Empirical evidence demonstrates that</span> only children and children from 2-child families receive 47% more parental time in educational activities, 38% more private tutoring, and 56% more extracurricular enrichment opportunities relative to children from families with ≥4 children (Downey, 2001). <span class='discourse'>Academic achievement data reveals</span> that children from smaller families score 0.4-0.6 SD higher on standardized assessments and demonstrate 12-percentage-point higher university completion rates (Steelman et al., 2002). <span class='causal'>These advantages reflect</span> both enhanced resource availability and individualized parental attention enabling targeted support for academic and socioemotional development.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence reveals</span> that family size presents fundamental trade-offs between social development advantages of sibling interaction and resource availability benefits of smaller families. <span class='discourse'>On balance</span>, developmental outcomes depend critically on family-specific factors including parental resources, values prioritizing social versus academic development, and capacity to maintain per-child investment despite larger family size, suggesting no universally optimal family structure.</p>"
       }
    },
      {
      "id": "work-from-home",
      "title": "Working From Home",
      "topic": "Work Culture",
      "essayType": "Agree & Disagree",
      "question": "Do you agree that working from home is better than working in an office?",
      "writingPoints": ["time saving", "comfort", "social interaction (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>Nowadays</span>, working from home has become increasingly common in many professions. <span class='discourse'>There is considerable debate about</span> whether remote work is actually better than traditional office work. <span class='discourse'>Therefore, it is important to examine</span> arguments on both sides of this discussion.</p><p><span class='opinion'>One strong argument in favour of</span> remote work is saving valuable commuting time. <span class='causal'>This is because</span> travelling to offices is eliminated entirely when working from home. <span class='discourse'>For example</span>, workers can save up to two hours daily that would otherwise be wasted. <span class='causal'>As a result</span>, they experience significantly less stress and physical fatigue.</p><p><span class='discourse'>Furthermore</span>, working from home offers much greater comfort and flexibility. <span class='causal'>This is because</span> people can create personalised workspaces that suit their individual preferences. <span class='discourse'>For instance</span>, employees can control temperature, lighting and noise levels. <span class='causal'>Consequently</span>, productivity and job satisfaction often improve considerably.</p><p><span class='discourse'>On the other hand</span>, remote work significantly reduces social interaction with colleagues. <span class='opinion'>Critics argue that</span> isolation can damage both wellbeing and effective teamwork. <span class='discourse'>For example</span>, office workers build friendships and collaborate more easily face-to-face.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I believe</span> working from home offers significant advantages overall. <span class='discourse'>On balance</span>, the benefits outweigh drawbacks when social needs are properly addressed.</p>",
        
        "formal": "<p><span class='discourse'>In contemporary occupational contexts</span>, remote work arrangements have demonstrated substantial growth across numerous professional sectors. <span class='discourse'>Considerable debate exists regarding</span> whether telecommuting provides superior outcomes relative to traditional office-based employment. <span class='discourse'>Therefore, it becomes necessary to evaluate</span> arguments supporting and opposing remote work arrangements.</p><p><span class='opinion'>A compelling argument favouring</span> remote work concerns the elimination of commuting time expenditure. <span class='causal'>This advantage exists because</span> workplace travel requirements are entirely obviated under home-based work arrangements. <span class='discourse'>To illustrate</span>, employees may preserve up to two hours daily previously devoted to transportation. <span class='causal'>Consequently</span>, workers experience substantial reductions in stress levels and physical exhaustion.</p><p><span class='discourse'>Additionally</span>, remote work arrangements facilitate enhanced environmental comfort and schedule flexibility. <span class='causal'>This benefit emerges because</span> individuals can customize workspace configurations according to personal preferences and requirements. <span class='discourse'>Specifically</span>, employees maintain autonomous control over ambient temperature, illumination, and acoustic conditions. <span class='causal'>Therefore</span>, occupational productivity and employment satisfaction frequently demonstrate marked improvement.</p><p><span class='discourse'>Conversely</span>, remote work substantially diminishes interpersonal interaction with professional colleagues. <span class='opinion'>Opponents contend that</span> social isolation may compromise both psychological wellbeing and collaborative effectiveness. <span class='discourse'>For instance</span>, office-based employees develop collegial relationships and achieve more effective cooperation through direct interaction.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>evidence suggests that</span> remote work arrangements provide substantial advantages. <span class='discourse'>On balance</span>, benefits exceed limitations when social connectivity requirements receive adequate attention.</p>",
        
        "academic": "<p><span class='discourse'>Within organizational psychology and workplace behavior literature</span>, remote work arrangements have experienced dramatic expansion, accelerated substantially by pandemic-related workplace transformations. <span class='discourse'>Contemporary research examines</span> comparative advantages and disadvantages of telecommuting versus traditional office-based employment. <span class='discourse'>This analysis evaluates</span> remote work implications across three dimensions: commuting time reduction, workplace comfort and autonomy, and social interaction patterns.</p><p><span class='opinion'>Labor economics research demonstrates that</span> commuting time elimination represents a substantial benefit of remote work. <span class='causal'>This advantage exists because</span> home-based work arrangements obviate daily transportation requirements, which average 54 minutes daily in developed nations (U.S. Census Bureau, 2023). <span class='discourse'>Time-use studies indicate that</span> remote workers reallocate saved commuting time to productive activities (42%), personal wellbeing activities including exercise and sleep (31%), and family engagement (27%) (Barrero et al., 2021). <span class='discourse'>Moreover</span>, eliminating commuting generates measurable stress reduction: cortisol assessments reveal 23% lower morning cortisol levels among remote workers relative to office-based employees (Giurge & Bohns, 2021). <span class='causal'>These temporal and physiological benefits</span> contribute to reported life satisfaction increases (β = 0.28, p < 0.01) among remote workers (Dockery & Bawa, 2020).</p><p><span class='discourse'>Additionally</span>, remote work arrangements facilitate enhanced environmental control and schedule flexibility. <span class='causal'>Environmental psychology research demonstrates that</span> workspace customization significantly influences productivity and wellbeing: personalized environmental control over temperature, lighting, and acoustics improves task performance by 16% and reduces stress by 31% relative to standardized office environments (Vischer, 2007). <span class='discourse'>Schedule flexibility represents</span> a particularly valued dimension, with 87% of remote workers citing flexible timing as a primary benefit (Owl Labs, 2023). <span class='discourse'>Productivity analyses reveal</span> that remote workers demonstrate 13% higher output relative to office-based counterparts, attributable to reduced interruptions (47% fewer than offices), optimized work timing aligned with circadian preferences, and enhanced focus periods (Bloom et al., 2015). <span class='causal'>These autonomy benefits generate</span> substantial job satisfaction increases (d = 0.41) and turnover intention reductions (OR = 0.62) (Gajendran & Harrison, 2007).</p><p><span class='discourse'>Conversely</span>, substantial research documents social interaction deficits associated with remote work. <span class='causal'>Social psychology theory posits that</span> workplace relationships fulfill fundamental belongingness needs and facilitate collaborative effectiveness (Baumeister & Leary, 1995). <span class='discourse'>Empirical evidence demonstrates that</span> remote workers report 28% fewer collegial relationships, 41% reduced informal social interactions, and significantly elevated loneliness (d = 0.52) relative to office-based employees (Faulkner & Menzel, 2021). <span class='discourse'>Moreover</span>, collaboration research reveals that remote arrangements impair team creativity (β = -0.34, p < 0.01) and spontaneous knowledge sharing, with virtual teams generating 23% fewer innovative ideas compared to co-located teams during brainstorming activities (Kiesler & Cummings, 2002). <span class='causal'>These social deficits contribute</span> to career advancement concerns, with remote workers perceiving 18% reduced promotion opportunities and experiencing actual promotion rates 12-percentage-points lower than office-based peers (Emanuel & Harrington, 2023).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence reveals</span> that remote work presents substantial trade-offs between autonomy/efficiency benefits and social interaction costs. <span class='discourse'>On balance</span>, optimal outcomes emerge from hybrid models integrating remote work flexibility with periodic office attendance maintaining social connectivity, with research suggesting 2-3 days weekly office attendance optimizes both productivity (maximizing focused work time) and collaboration (preserving social capital) (Barrero et al., 2023).</p>"
      }
    },
    {
      "id": "fashion-industry",
      "title": "Fashion Industry",
      "topic": "Fashion",
      "essayType": "Opinion",
      "question": "Does the fashion industry have a bad effect on people's lives?",
      "writingPoints": ["appearance pressure", "price of clothes", "environmental impact (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>The fashion industry</span> has a significant and growing influence on modern society. <span class='discourse'>Because of this</span>, there is considerable debate about whether its effects are positive or negative. <span class='opinion'>I firmly believe</span> the fashion industry creates several serious problems for people.</p><p><span class='discourse'>To begin with</span>, pressure to look fashionable damages people's confidence and self-image. <span class='causal'>This is because</span> advertisements constantly promote unrealistic beauty standards. <span class='discourse'>For example</span>, many teenagers feel inadequate trying desperately to follow the latest trends. <span class='causal'>As a result</span>, self-esteem and body image suffer considerably among young people.</p><p><span class='discourse'>Furthermore</span>, fashionable clothing is often extremely expensive for ordinary families. <span class='causal'>This is because</span> designer brands charge premium prices for trendy items each season. <span class='discourse'>For instance</span>, families feel pressured to buy expensive branded products unnecessarily. <span class='causal'>Consequently</span>, this creates unnecessary financial stress and debt.</p><p><span class='discourse'>Moreover</span>, fast fashion damages the environment very significantly. <span class='causal'>This is because</span> cheap, disposable clothing creates enormous amounts of waste globally. <span class='discourse'>For example</span>, millions of tonnes of unwanted clothes end up in landfills annually. <span class='causal'>Therefore</span>, the environmental cost is absolutely devastating for our planet.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> the fashion industry has damaging negative effects. <span class='discourse'>Overall</span>, it creates pressure, encourages overspending and harms the environment badly.</p>",
        
        "formal": "<p><span class='discourse'>The fashion industry</span> exerts considerable influence on contemporary society and consumer behavior patterns. <span class='discourse'>Consequently</span>, substantial debate exists regarding whether this industry generates predominantly beneficial or detrimental societal effects. <span class='opinion'>From a critical perspective</span>, the fashion industry produces multiple problematic consequences for individuals and communities.</p><p><span class='discourse'>Primarily</span>, fashion industry marketing generates substantial psychological pressure regarding physical appearance. <span class='causal'>This occurs because</span> advertising campaigns systematically promote unattainable aesthetic standards. <span class='discourse'>To illustrate</span>, numerous adolescents experience inadequacy perceptions while attempting to conform to perpetually evolving fashion trends. <span class='causal'>Consequently</span>, self-esteem deficits and body image concerns demonstrate elevated prevalence among youth populations.</p><p><span class='discourse'>Furthermore</span>, fashionable apparel frequently requires substantial financial expenditure exceeding typical household budgets. <span class='causal'>This situation exists because</span> premium fashion brands impose elevated pricing for trend-aligned merchandise with limited temporal relevance. <span class='discourse'>Specifically</span>, families experience pressure to acquire expensive branded items without genuine necessity. <span class='causal'>Therefore</span>, unnecessary financial strain and consumer debt accumulation result.</p><p><span class='discourse'>Additionally</span>, fast fashion production models generate substantial environmental degradation. <span class='causal'>This environmental damage results from</span> disposable clothing manufacturing creating extensive waste volumes globally. <span class='discourse'>For instance</span>, millions of metric tons of discarded textiles accumulate in waste disposal sites annually. <span class='causal'>Thus</span>, ecological consequences prove severely detrimental to planetary sustainability.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>critical analysis indicates that</span> the fashion industry generates predominantly negative societal consequences. <span class='discourse'>On balance</span>, it cultivates appearance-related psychological pressure, encourages excessive consumption, and produces substantial environmental harm.</p>",
        
        "academic": "<p><span class='discourse'>Within consumer culture studies and environmental sociology literature</span>, the fashion industry has received substantial critical attention regarding its sociocultural and ecological implications. <span class='discourse'>Global fashion industry valuation</span> exceeds $1.7 trillion annually, with consumption patterns demonstrating 60% growth since 2000 (McKinsey, 2023). <span class='discourse'>This analysis examines</span> fashion industry effects across three dimensions: psychological impacts through appearance norms, economic implications of consumption pressure, and environmental consequences of fast fashion production models.</p><p><span class='discourse'>Initially</span>, fashion industry marketing demonstrably influences body image perceptions and self-esteem, particularly among adolescent populations. <span class='causal'>Social comparison theory posits that</span> exposure to idealized images promotes upward social comparison, generating self-evaluation deficits (Festinger, 1954). <span class='discourse'>Empirical research demonstrates that</span> fashion magazine exposure correlates significantly with body dissatisfaction (r = 0.36, p < 0.001) and eating disorder symptomatology (r = 0.28, p < 0.01) among female adolescents (Grabe et al., 2008). <span class='discourse'>Moreover</span>, experimental studies reveal that brief fashion advertising exposure (15 minutes) significantly reduces state self-esteem by 0.5 SD and increases appearance anxiety by 0.6 SD relative to control conditions (Hawkins et al., 2004). <span class='causal'>These psychological effects prove</span> particularly pronounced given that fashion advertising employs digitally altered imagery creating unattainable aesthetic standards: content analyses reveal 100% of fashion advertisements employ digital manipulation enhancing model appearance (Reaves et al., 2004), with average alterations including 24% waist reduction, 31% leg lengthening, and comprehensive skin texture modification.</p><p><span class='discourse'>Additionally</span>, fashion industry marketing generates substantial financial pressure and consumption patterns exceeding economic rationality. <span class='causal'>Planned obsolescence principles embedded in</span> fast fashion business models—introducing 52 'micro-seasons' annually rather than traditional 2-4 seasons—artificially accelerate style obsolescence, compelling continuous consumption (Fletcher, 2008). <span class='discourse'>Consumer expenditure data indicates that</span> average household fashion spending has increased 76% since 1990 despite 40% declining prices, reflecting pure volume increases (Bureau of Labor Statistics, 2023). <span class='discourse'>Critically</span>, fashion consumption correlates inversely with income adequacy: lower-income households allocate disproportionately higher budget shares to fashion (8.3% vs. 3.2% for high-income households) despite greater financial vulnerability, suggesting social pressure effects (ONS, 2022). <span class='causal'>These consumption patterns contribute</span> to household debt accumulation, with fashion-related credit card debt averaging £2,400 per household in UK populations (Money Charity, 2023).</p><p><span class='discourse'>Furthermore</span>, fast fashion production generates severe environmental consequences across multiple domains. <span class='causal'>Life cycle assessments demonstrate that</span> fashion industry operations produce 10% of global carbon emissions—exceeding international aviation and maritime shipping combined—and consume 1.5 trillion liters of water annually (UNEP, 2019). <span class='discourse'>Textile waste data reveals that</span> 92 million tonnes of clothing waste are generated annually, with 87% incinerated or landfilled rather than recycled (Ellen MacArthur Foundation, 2017). <span class='discourse'>Microplastic pollution analyses indicate that</span> synthetic textile washing releases 500,000 tonnes of microfibers into oceans annually—equivalent to 50 billion plastic bottles—with fashion representing 35% of oceanic microplastic pollution (IUCN, 2017). <span class='causal'>Additionally</span>, textile dyeing processes discharge 20% of global industrial water pollution, with hazardous chemicals including heavy metals and carcinogens contaminating water sources affecting 300 million people globally (World Bank, 2019).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from psychology, economics, and environmental science demonstrates that</span> the fashion industry generates substantial negative externalities across psychological wellbeing, economic rationality, and environmental sustainability dimensions. <span class='discourse'>On balance</span>, addressing these concerns requires multi-level interventions including advertising regulation limiting manipulated imagery, media literacy education regarding manufactured consumption needs, sustainable fashion production standards, and circular economy models prioritizing durability and recycling over disposable consumption patterns.</p>"
      }
    },
    {
      "id": "learning-languages",
      "title": "Learning Foreign Languages",
      "topic": "Languages",
      "essayType": "Opinion",
      "question": "Are there more reasons to learn a foreign language than just passing a test?",
      "writingPoints": ["pleasure", "personal challenge", "career opportunities (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>Learning a foreign language</span> is becoming increasingly important in today's globalised and connected world. <span class='discourse'>Because of this</span>, many people question whether language learning offers benefits beyond passing exams. <span class='opinion'>I firmly believe</span> there are many valuable reasons to learn languages throughout life.</p><p><span class='discourse'>To begin with</span>, learning a language can bring genuine pleasure and enjoyment. <span class='causal'>This is because</span> discovering new words and expressions is intellectually stimulating and exciting. <span class='discourse'>For example</span>, speaking another language while travelling creates wonderful, memorable experiences. <span class='causal'>As a result</span>, language learning becomes personally meaningful and rewarding.</p><p><span class='discourse'>Furthermore</span>, language learning represents a rewarding personal challenge. <span class='causal'>This is because</span> mastering a completely new skill builds confidence and self-esteem significantly. <span class='discourse'>For instance</span>, successfully completing a language course creates genuine pride and achievement. <span class='causal'>Consequently</span>, motivation to continue learning and improving grows naturally.</p><p><span class='discourse'>Moreover</span>, foreign language skills create excellent career opportunities in the modern workplace. <span class='causal'>This is because</span> international companies increasingly need multilingual employees for global business. <span class='discourse'>For example</span>, speaking additional languages often leads to better jobs and higher salaries. <span class='causal'>Therefore</span>, language skills have real, practical professional value.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I strongly believe</span> there are many reasons to learn languages beyond exams. <span class='discourse'>Overall</span>, language learning provides pleasure, personal challenge and career advancement.</p>",
        
        "formal": "<p><span class='discourse'>Foreign language acquisition</span> has assumed increasing significance within contemporary globalized societies. <span class='discourse'>Consequently</span>, substantial consideration should be given to whether linguistic competence provides benefits extending beyond examination success. <span class='opinion'>From an analytical perspective</span>, numerous compelling rationales exist for pursuing language acquisition throughout one's lifespan.</p><p><span class='discourse'>Primarily</span>, language learning generates authentic intellectual enjoyment and personal satisfaction. <span class='causal'>This occurs because</span> discovering novel linguistic structures and vocabulary items provides substantial cognitive stimulation. <span class='discourse'>To illustrate</span>, utilizing foreign language competence during international travel creates profoundly memorable cross-cultural experiences. <span class='causal'>Consequently</span>, language acquisition transcends instrumental purposes, becoming intrinsically rewarding.</p><p><span class='discourse'>Furthermore</span>, language acquisition constitutes a meaningful personal development challenge. <span class='causal'>This occurs because</span> achieving proficiency in entirely novel linguistic systems substantially enhances self-efficacy beliefs and personal confidence. <span class='discourse'>Specifically</span>, successfully attaining communicative competence generates authentic accomplishment perceptions and personal pride. <span class='causal'>Therefore</span>, intrinsic motivation for continued linguistic development emerges organically.</p><p><span class='discourse'>Additionally</span>, multilingual competence creates substantial professional opportunities within contemporary labor markets. <span class='causal'>This advantage exists because</span> multinational organizations increasingly require linguistically diverse workforces to facilitate international operations. <span class='discourse'>For instance</span>, possessing additional language capabilities frequently correlates with enhanced employment prospects and elevated compensation levels. <span class='causal'>Thus</span>, linguistic skills demonstrate tangible vocational utility.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>comprehensive analysis indicates that</span> numerous compelling rationales exist for language acquisition beyond examination purposes. <span class='discourse'>On balance</span>, language learning provides intellectual satisfaction, personal development opportunities, and substantial career advantages.</p>",
        
        "academic": "<p><span class='discourse'>Within applied linguistics and educational psychology literature</span>, substantial research has examined motivations for and benefits of second language acquisition beyond purely instrumental examination-oriented goals. <span class='discourse'>Contemporary language learning theory</span> distinguishes between extrinsic motivation (external rewards including examination success) and intrinsic motivation (inherent satisfaction from learning itself) (Deci & Ryan, 2000). <span class='discourse'>This analysis evaluates</span> non-examination rationales for language learning across three dimensions: hedonic enjoyment and cultural engagement, personal development and self-efficacy enhancement, and professional advancement opportunities.</p><p><span class='discourse'>Initially</span>, language learning generates substantial intrinsic rewards through intellectual stimulation and cross-cultural engagement. <span class='causal'>Self-determination theory posits that</span> activities satisfying basic psychological needs for competence, autonomy, and relatedness generate intrinsic motivation and wellbeing (Ryan & Deci, 2000). <span class='discourse'>Empirical research demonstrates that</span> language learners report significant intrinsic enjoyment (mean rating: 7.2/10) from discovering linguistic patterns, with 78% citing intellectual curiosity as a primary motivation (Csizér & Dörnyei, 2005). <span class='discourse'>Moreover</span>, language proficiency facilitates authentic cross-cultural experiences: multilingual travelers report 64% higher satisfaction with international experiences and 2.3-fold increased likelihood of meaningful local interactions relative to monolingual counterparts (Dewaele & MacIntyre, 2014). <span class='causal'>These experiential benefits</span> contribute to sustained language engagement independent of examination requirements, with intrinsically motivated learners demonstrating 47% higher persistence rates and 0.6 SD superior long-term proficiency outcomes (Noels et al., 2000).</p><p><span class='discourse'>Additionally</span>, language acquisition functions as a meaningful personal development challenge enhancing self-efficacy and identity. <span class='causal'>Growth mindset theory suggests that</span> successfully mastering challenging skills enhances general self-efficacy beliefs and resilience (Dweck, 2006). <span class='discourse'>Longitudinal research reveals that</span> language learning correlates with enhanced general self-efficacy (β = 0.31, p < 0.01) and growth mindset orientation (β = 0.28, p < 0.01) over 12-month periods (Mercer & Ryan, 2010). <span class='discourse'>Identity research demonstrates that</span> multilingualism expands self-concept and identity possibilities, with bilinguals reporting more complex, multifaceted self-descriptions and enhanced cognitive flexibility (Pavlenko, 2006). <span class='causal'>These personal development benefits prove</span> particularly salient for adult learners: qualitative studies reveal that 83% of adult language learners cite personal growth and intellectual challenge as primary motivations, substantially exceeding vocational rationales (Chik & Breidbach, 2014).</p><p><span class='discourse'>Furthermore</span>, multilingual competence generates substantial economic returns in contemporary labor markets. <span class='causal'>Human capital theory posits that</span> skills enhancing productivity command wage premiums (Becker, 1964). <span class='discourse'>Labor economics research demonstrates that</span> multilingualism generates 10-15% wage premiums in developed economies, with particularly pronounced effects in internationally-oriented sectors including finance (19% premium), technology (17% premium), and consulting (16% premium) (Grin, 2001; Williams, 2011). <span class='discourse'>Moreover</span>, multilingual workers demonstrate 23% higher promotion rates and access to 34% more job opportunities relative to monolingual counterparts (Callahan & Gandín, 2014). <span class='causal'>These economic benefits extend</span> beyond wages to include employment security: during economic downturns, multilingual workers experience 28% lower unemployment risk due to enhanced labor market flexibility (Budría & Swedberg, 2015). <span class='discourse'>Projected labor market trends indicate</span> increasing demand for multilingual competence, with 67% of employers citing language skills as valuable for future workforce requirements (British Academy, 2022).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from linguistics, psychology, and economics indicates that</span> language learning provides substantial benefits extending well beyond examination success. <span class='discourse'>On balance</span>, multilingual competence generates intrinsic intellectual rewards, facilitates personal development and identity expansion, and creates significant career advantages in globalized labor markets, suggesting that examination-oriented motivation represents only a limited subset of compelling language learning rationales.</p>"
      }
    },
   {
  "id": "learning-history",
  "title": "Learning History at School",
  "topic": "History",
  "essayType": "Opinion",
  "question": "Should everyone be taught the history of their own country?",
  "writingPoints": ["learning from the past", "future vs past", "national identity (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Learning history</span> is an essential component of education systems worldwide. <span class='discourse'>Because of this</span>, there is considerable debate about whether national history should be compulsory for all students. <span class='opinion'>I firmly believe</span> that everyone should study their own country's history thoroughly.</p><p><span class='discourse'>Firstly</span>, history teaches us invaluable lessons from past events and mistakes. <span class='causal'>This is because</span> understanding previous events helps societies avoid repeating serious errors. <span class='discourse'>For example</span>, learning about past wars teaches younger generations the importance of peace and diplomacy. <span class='causal'>As a result</span>, students become more informed and responsible citizens.</p><p><span class='discourse'>Secondly</span>, focusing only on the future is simply insufficient for understanding the present. <span class='causal'>This is because</span> history provides essential context for interpreting current events and decisions. <span class='discourse'>For instance</span>, political situations become much clearer when historical background is properly understood. <span class='causal'>Consequently</span>, people can make better-informed choices about important issues.</p><p><span class='discourse'>Furthermore</span>, national history strongly strengthens people's sense of identity and belonging. <span class='causal'>This is because</span> understanding our collective past creates meaningful connection to our cultural roots. <span class='discourse'>For example</span>, knowing about significant national events builds genuine community pride and unity.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I strongly believe</span> national history education is essential for everyone. <span class='discourse'>Overall</span>, it provides vital lessons, important context and strengthens national identity.</p>",
    
    "formal": "<p><span class='discourse'>Historical education</span> constitutes a fundamental component of educational curricula internationally. <span class='discourse'>Consequently</span>, substantial debate exists regarding whether national historical instruction should be mandatory for all students. <span class='opinion'>From a pedagogical perspective</span>, compelling arguments support universal national history education.</p><p><span class='discourse'>Primarily</span>, historical study facilitates learning from prior events and collective errors. <span class='causal'>This educational function exists because</span> comprehending past occurrences enables societies to avoid repeating serious mistakes. <span class='discourse'>To illustrate</span>, studying historical conflicts educates subsequent generations regarding peace preservation and diplomatic resolution principles. <span class='causal'>Consequently</span>, students develop enhanced civic awareness and responsible citizenship orientations.</p><p><span class='discourse'>Furthermore</span>, exclusive future orientation proves inadequate for comprehending contemporary circumstances. <span class='causal'>This limitation exists because</span> historical knowledge provides essential contextual frameworks for interpreting current events and policy decisions. <span class='discourse'>Specifically</span>, political developments become substantially more comprehensible when appropriate historical background is understood. <span class='causal'>Therefore</span>, individuals can formulate better-informed judgments regarding significant societal issues.</p><p><span class='discourse'>Additionally</span>, national historical education substantially reinforces collective identity and communal belonging. <span class='causal'>This social function operates because</span> understanding shared historical experiences creates meaningful connections to cultural heritage and traditions. <span class='discourse'>For instance</span>, knowledge of significant national events cultivates authentic community pride and social cohesion.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>comprehensive analysis strongly supports</span> universal national history education requirements. <span class='discourse'>On balance</span>, historical study provides essential learning from past experiences, contextual understanding frameworks, and national identity reinforcement.</p>",
    
    "academic": "<p><span class='discourse'>Within education policy and civic education literature</span>, substantial scholarly debate addresses whether national history instruction should constitute mandatory curriculum requirements. <span class='discourse'>Contemporary educational systems</span> demonstrate significant variation in history education approaches, with some nations mandating comprehensive national history while others adopt more flexible or global history frameworks (Carretero & van Alphen, 2014). <span class='discourse'>This analysis evaluates</span> rationales for mandatory national history education across three dimensions: learning from historical patterns to inform present decisions, providing contextual frameworks for contemporary understanding, and facilitating national identity and social cohesion.</p><p><span class='discourse'>Initially</span>, historical education serves critical functions in facilitating learning from past collective experiences. <span class='causal'>Santayana's principle posits that</span> societies failing to learn from history risk repeating catastrophic errors (Santayana, 1905). <span class='discourse'>Empirical research demonstrates that</span> historical knowledge correlates significantly with enhanced political decision-making quality: citizens with stronger historical knowledge demonstrate 31% greater support for evidence-based policies, 28% higher critical evaluation of political rhetoric, and 42% increased awareness of policy unintended consequences (Wineburg et al., 2007). <span class='discourse'>Moreover</span>, comparative genocide studies reveal that historical education about past atrocities significantly reduces support for dehumanizing rhetoric: populations receiving comprehensive Holocaust education demonstrate 67% lower acceptance of discriminatory policies relative to populations with minimal historical instruction (Salmons, 2003). <span class='causal'>These findings suggest that</span> historical education generates practical wisdom applicable to contemporary challenges.</p><p><span class='discourse'>Additionally</span>, historical knowledge provides essential contextual frameworks for understanding contemporary phenomena. <span class='causal'>Path dependence theory in</span> political science demonstrates that current institutional arrangements reflect historical trajectories, making present circumstances incomprehensible without historical context (Pierson, 2000). <span class='discourse'>Educational research reveals that</span> students lacking historical background demonstrate significantly impaired comprehension of current events: controlled experiments show that historical context provision improves news comprehension by 44%, policy debate understanding by 38%, and causal reasoning about social issues by 51% (VanSledright, 2011). <span class='discourse'>Moreover</span>, longitudinal studies demonstrate that historical education predicts adult civic engagement: each additional year of history instruction correlates with 8-percentage-point higher voter participation rates, 12-percentage-point increased community involvement, and 0.3 SD enhanced political efficacy beliefs (Campbell, 2008). <span class='causal'>These educational outcomes demonstrate</span> that historical knowledge functions as essential infrastructure for democratic citizenship.</p><p><span class='discourse'>Furthermore</span>, national history education facilitates identity formation and social cohesion, though with important caveats. <span class='causal'>Social identity theory suggests that</span> shared historical narratives create collective identity and group cohesion (Tajfel & Turner, 1979). <span class='discourse'>Cross-national research indicates that</span> national history education correlates positively with national identification (r = 0.42), social trust (r = 0.31), and civic participation (r = 0.28) across 38 nations (Torney-Purta et al., 2001). <span class='discourse'>However</span>, critical scholarship warns that nationalist history curricula can promote exclusionary identities and intergroup conflict: content analyses reveal that 73% of national history curricula emphasize national exceptionalism narratives while minimizing historical wrongdoing (Foster & Crawford, 2006). <span class='causal'>This tension suggests that</span> effective history education requires balancing national identity formation with critical historical examination, including uncomfortable historical episodes. <span class='discourse'>Comparative curriculum research demonstrates that</span> countries adopting balanced approaches—acknowledging both achievements and historical injustices—produce students with stronger democratic values (76% vs. 54% support for minority rights) and lower nationalism-related prejudice (effect size: d = -0.38) relative to triumphalist curriculum approaches (Carretero et al., 2012).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from education research, political science, and social psychology indicates that</span> national history education serves essential functions for democratic citizenship and social cohesion. <span class='discourse'>On balance</span>, mandatory history instruction provides mechanisms for learning from past errors, contextualizing contemporary issues, and fostering collective identity, though effectiveness requires pedagogical approaches emphasizing critical thinking and balanced historical narratives rather than nationalist mythmaking.</p>"
  }
},
    {
      "id": "sports-money",
      "title": "Money for Sports People",
      "topic": "Sport and Society",
      "essayType": "Opinion",
      "question": "Are famous sports people paid too much money?",
      "writingPoints": ["the entertainment they provide", "how hard they work", "sponsorship and endorsements (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>In modern society</span>, famous athletes earn extraordinarily high salaries exceeding millions annually. <span class='discourse'>Because of this</span>, many people question whether such enormous payments are actually justified. <span class='opinion'>I believe</span> that many professional sports stars are paid excessively.</p><p><span class='discourse'>Firstly</span>, athletes certainly deserve fair payment for the entertainment they provide to millions. <span class='causal'>This is because</span> major sporting events attract enormous global audiences and generate huge revenues. <span class='discourse'>For example</span>, football matches and Olympic events are watched by billions of viewers worldwide. <span class='causal'>As a result</span>, athletes become extremely valuable entertainers in the modern world.</p><p><span class='discourse'>Furthermore</span>, many professional athletes work incredibly hard to achieve excellence. <span class='causal'>This is because</span> they train intensively for many years, often sacrificing normal social lives. <span class='discourse'>For instance</span>, Olympic athletes typically dedicate several hours daily to rigorous preparation. <span class='causal'>Consequently</span>, their dedication and sacrifice certainly deserve recognition and reward.</p><p><span class='discourse'>However</span>, sponsorship and endorsement deals push athlete earnings unreasonably high. <span class='causal'>This is because</span> some stars earn millions simply for appearing in advertisements. <span class='discourse'>For example</span>, certain athletes earn more from endorsements than from actually playing their sport.</p><p><span class='discourse'>In conclusion</span>, athletes work hard and entertain millions of fans genuinely. <span class='opinion'>However</span>, excessive sponsorship earnings show they are often significantly overpaid. <span class='discourse'>Overall</span>, salaries should be more reasonably balanced.</p>",
        
        "formal": "<p><span class='discourse'>In contemporary society</span>, elite athletes command extraordinarily elevated compensation packages frequently exceeding millions annually. <span class='discourse'>Consequently</span>, substantial public debate exists regarding whether such remuneration levels are appropriately justified. <span class='opinion'>From a critical economic perspective</span>, professional athlete compensation frequently exceeds reasonable levels.</p><p><span class='discourse'>Admittedly</span>, athletes merit appropriate compensation for entertainment value provided to global audiences. <span class='causal'>This rationale exists because</span> major sporting competitions attract massive international viewership and generate substantial commercial revenues. <span class='discourse'>To illustrate</span>, premier football matches and Olympic competitions attract billions of viewers internationally. <span class='causal'>Consequently</span>, athletes function as highly valuable entertainment professionals within contemporary media landscapes.</p><p><span class='discourse'>Furthermore</span>, elite athletes demonstrate exceptional dedication and professional commitment. <span class='causal'>This occurs because</span> achieving sporting excellence requires intensive training regimens sustained over extended periods, frequently necessitating significant personal sacrifices. <span class='discourse'>Specifically</span>, Olympic-level athletes typically dedicate multiple hours daily to demanding physical preparation. <span class='causal'>Therefore</span>, such dedication and sacrifice warrant appropriate recognition and financial compensation.</p><p><span class='discourse'>Nevertheless</span>, commercial sponsorship and endorsement arrangements elevate athlete compensation to excessive levels. <span class='causal'>This occurs because</span> prominent athletes receive substantial payments merely for commercial advertisement participation. <span class='discourse'>For instance</span>, certain elite athletes derive greater income from endorsements than from athletic performance itself.</p><p><span class='discourse'>In conclusion</span>, while athletes demonstrate genuine dedication and provide entertainment value, <span class='opinion'>evidence suggests</span> compensation levels frequently prove excessive. <span class='discourse'>On balance</span>, more equitable compensation structures would be appropriate.</p>",
        
        "academic": "<p><span class='discourse'>Within sports economics and labor market literature</span>, substantial scholarly attention examines athlete compensation levels and their alignment with economic value generation. <span class='discourse'>Contemporary elite athlete earnings</span> demonstrate dramatic escalation, with top-tier professionals earning $20-100+ million annually through combined salaries, bonuses, and endorsements (Forbes, 2023). <span class='discourse'>This analysis evaluates</span> athlete compensation justification across three dimensions: entertainment value and revenue generation, training investment and career sacrifice, and sponsorship market dynamics.</p><p><span class='opinion'>Sports economics research demonstrates that</span> elite athletes generate substantial economic value through entertainment provision. <span class='causal'>Economic theory posits that</span> compensation should align with marginal revenue product—the additional revenue an employee generates for employers (Rosen, 1981). <span class='discourse'>Empirical analyses reveal that</span> star athletes generate enormous revenues: individual superstars increase team revenues by $15-40 million annually through ticket sales, broadcasting rights, and merchandise (Hausman & Leonard, 1997). <span class='discourse'>Moreover</span>, major sporting events generate substantial broader economic impacts: the FIFA World Cup generates $5 billion direct revenue with $14 billion estimated total economic impact, while the Olympics produces $3-7 billion revenue (Baade & Matheson, 2016). <span class='causal'>Given these revenue magnitudes</span>, economic efficiency arguments suggest that athlete compensation reflects value created, with athletes capturing 50-57% of league revenues—proportions consistent with their irreplaceable role in value generation (Fort & Quirk, 1995).</p><p><span class='discourse'>Additionally</span>, elite athletic achievement requires extraordinary training investment and career sacrifice warranting compensation. <span class='causal'>Human capital theory suggests that</span> compensation should reflect skill acquisition investments and opportunity costs (Becker, 1964). <span class='discourse'>Training requirement research reveals that</span> elite performance necessitates approximately 10,000 hours deliberate practice—equivalent to 10+ years full-time training investment—to achieve international competitiveness (Ericsson et al., 1993). <span class='discourse'>Moreover</span>, athletic careers demonstrate severe temporal constraints: average career duration ranges 3-8 years across sports, with median retirement age of 33 (Ingle & Sleap, 2006). <span class='causal'>These career brevity factors necessitate</span> that lifetime earnings be compressed into short peak performance periods. <span class='discourse'>Additionally</span>, injury risks prove substantial: 60-90% of professional athletes experience career-threatening injuries, with 15-20% suffering permanent physical impairments (Drawer & Fuller, 2001). <span class='causal'>These risk factors and</span> opportunity costs (foregone educational and alternative career development) provide partial justification for elevated compensation.</p><p><span class='discourse'>Nevertheless</span>, endorsement market dynamics generate compensation levels substantially exceeding athletic performance value. <span class='causal'>Superstar economics theory posits that</span> small talent differences generate disproportionate earnings when markets demonstrate winner-take-all dynamics (Frank & Cook, 1995). <span class='discourse'>Endorsement data reveals</span> dramatic skewness: top-10 athletes earn $300-900 million lifetime endorsement income, while median professional athletes earn <$50,000 annually from endorsements (Ozanian, 2022). <span class='discourse'>Critically</span>, endorsement earnings frequently exceed athletic performance compensation: for elite athletes, endorsements represent 60-85% of total income, with some athletes (e.g., Roger Federer) earning 95% of income from endorsements despite retirement from competition (Forbes, 2023). <span class='discourse'>Marketing research demonstrates that</span> endorsement value derives partially from actual athletic performance but substantially from brand association and celebrity status somewhat detached from sporting merit (Carlson & Donavan, 2013). <span class='causal'>This endorsement premium represents</span> economic rent—compensation exceeding necessary payment to secure services—suggesting excessive remuneration relative to value creation (Lucifora & Simmons, 2003).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>economic analysis reveals</span> that athlete compensation reflects complex interactions between legitimate value creation and market inefficiencies. <span class='discourse'>On balance</span>, while athletes merit substantial compensation for entertainment value provision and career investments, endorsement market dynamics generate compensation levels for elite athletes substantially exceeding economic justification, suggesting that top-tier athlete earnings are indeed excessive relative to societal contribution, particularly when contrasted with compensation for essential service providers including educators, healthcare workers, and public safety personnel.</p>"
      }
    },
    {
      "id": "self-employment",
      "title": "Self-Employment vs Working for Others",
      "topic": "Work and Lifestyle",
      "essayType": "For & Against",
      "question": "Is it better to be self-employed or to work for somebody else?",
      "writingPoints": ["being independent", "job security", "work-life balance (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>In recent times</span>, self-employment has become an increasingly popular career choice for many people. <span class='discourse'>It is widely recognised that</span> both working independently and for employers have distinct advantages. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of each option carefully.</p><p><span class='opinion'>The main advantage of</span> self-employment is independence and personal freedom. <span class='causal'>This is because</span> people can choose their own working hours, projects and clients freely. <span class='discourse'>For example</span>, freelancers work when they feel most productive and creative. <span class='causal'>As a result</span>, they often feel more motivated and satisfied with their careers.</p><p><span class='opinion'>While there are many advantages</span>, traditional employment offers much greater security. <span class='opinion'>The key disadvantage of</span> self-employment is unpredictable and irregular income throughout the year. <span class='causal'>A major drawback is that</span> freelancers lack guaranteed salaries, paid holidays and employment benefits. <span class='causal'>Consequently</span>, financial planning becomes considerably more difficult and stressful.</p><p><span class='discourse'>Furthermore</span>, work-life balance differs significantly between both working options. <span class='causal'>This is because</span> self-employed people often struggle to separate work time from personal leisure. <span class='discourse'>For instance</span>, they may feel pressured to work constantly without proper breaks or boundaries.</p><p><span class='discourse'>In conclusion</span>, both employment options have significant merits and challenges. <span class='discourse'>On balance</span>, the best choice depends entirely on individual priorities, personality and circumstances.</p>",
        
        "formal": "<p><span class='discourse'>In contemporary labor markets</span>, self-employment has demonstrated substantial growth as a viable career trajectory. <span class='discourse'>It is generally acknowledged that</span> both independent work and traditional employment present distinctive advantages and limitations. <span class='discourse'>Therefore, it becomes essential to evaluate</span> comparative benefits and disadvantages systematically.</p><p><span class='opinion'>The principal advantage of</span> self-employment concerns professional autonomy and operational independence. <span class='causal'>This benefit exists because</span> self-employed individuals maintain autonomous control over work scheduling, project selection, and client relationships. <span class='discourse'>To illustrate</span>, freelance professionals can align work activities with peak productivity periods and personal creative rhythms. <span class='causal'>Consequently</span>, intrinsic motivation and career satisfaction frequently demonstrate substantial enhancement.</p><p><span class='opinion'>While substantial advantages exist</span>, traditional employment provides superior economic security and stability. <span class='opinion'>The primary disadvantage of</span> self-employment is income volatility and unpredictability throughout annual periods. <span class='causal'>A critical concern is that</span> independent workers lack guaranteed compensation, paid leave entitlements, and employer-provided benefit packages. <span class='causal'>Therefore</span>, financial planning and resource management present considerably greater complexity and psychological stress.</p><p><span class='discourse'>Additionally</span>, work-life integration patterns differ substantially between employment modalities. <span class='causal'>This variation occurs because</span> self-employed individuals frequently experience difficulty establishing boundaries between professional and personal domains. <span class='discourse'>Specifically</span>, independent workers may experience pressure toward continuous availability without adequate recovery periods or temporal boundaries.</p><p><span class='discourse'>In conclusion</span>, both employment structures demonstrate significant advantages and challenges. <span class='discourse'>On balance</span>, optimal choice varies according to individual priorities, temperament characteristics, and specific circumstances.</p>",
        
        "academic": "<p><span class='discourse'>Within labor economics and occupational psychology literature</span>, substantial research has examined the comparative advantages and disadvantages of self-employment versus traditional employment relationships. <span class='discourse'>Self-employment prevalence</span> has increased substantially across developed economies, currently representing 15-20% of total employment (OECD, 2023). <span class='discourse'>This analysis evaluates</span> self-employment implications across three dimensions: professional autonomy and job satisfaction, income security and employment protections, and work-life boundary management.</p><p><span class='opinion'>Occupational psychology research demonstrates that</span> self-employment provides substantial autonomy benefits generating enhanced job satisfaction. <span class='causal'>Self-determination theory posits that</span> autonomy represents a fundamental psychological need; satisfying autonomy needs enhances intrinsic motivation and wellbeing (Deci & Ryan, 2000). <span class='discourse'>Empirical evidence confirms that</span> self-employed workers report significantly higher job autonomy (d = 1.2), work meaning (d = 0.6), and overall job satisfaction (d = 0.4) relative to traditionally employed counterparts (Binder & Coad, 2013). <span class='discourse'>Moreover</span>, self-employment enables temporal flexibility: 76% of self-employed workers report ability to adjust schedules for personal needs versus 31% of traditional employees (Mas & Pallais, 2017). <span class='causal'>These autonomy benefits generate</span> substantial subjective wellbeing advantages, with self-employed individuals reporting 0.3 SD higher life satisfaction after controlling for income and demographic factors (Benz & Frey, 2008). <span class='discourse'>Longitudinal studies reveal that</span> transitions into self-employment increase life satisfaction by 0.4 SD on average, with effects persisting 3+ years post-transition (Hanglberger & Merz, 2015).</p><p><span class='opinion'>Nevertheless, substantial economic research documents</span> income insecurity and vulnerability associated with self-employment. <span class='causal'>Income volatility analyses demonstrate that</span> self-employed workers experience 2.5-3.0 times greater year-to-year income fluctuations relative to wage employees, with 40% experiencing income declines >25% across consecutive years (Hamilton, 2000). <span class='discourse'>Median income data reveals</span> that self-employed workers earn 11% less than observably similar wage employees after controlling for hours worked, education, and experience (Levine & Rubinstein, 2017). <span class='discourse'>Critically</span>, self-employment eliminates employer-provided benefits including health insurance, retirement contributions, and paid leave—benefits valued at 30-45% of base compensation for traditional employees (BLS, 2023). <span class='causal'>These security deficits generate</span> substantial economic vulnerability: self-employed workers demonstrate 2.1-fold higher poverty risk and 60% lower retirement savings accumulation relative to traditional employees at equivalent income levels (Zissimopoulos & Karoly, 2007). <span class='discourse'>Moreover</span>, self-employment provides minimal unemployment insurance protection, leaving workers vulnerable during demand shocks (95% of self-employed lack unemployment insurance access; OECD, 2020).</p><p><span class='discourse'>Additionally</span>, self-employment presents complex work-life boundary management challenges. <span class='causal'>Boundary theory posits that</span> role integration—lacking clear temporal and spatial boundaries between work and non-work domains—generates both opportunities and risks (Ashforth et al., 2000). <span class='discourse'>Time-use research reveals that</span> self-employed workers demonstrate greater work hour variability and temporal fragmentation: while average hours are similar to traditional employment (42 vs. 41 hours weekly), self-employed workers experience 73% more work interruptions during personal time and 2.8× higher likelihood of weekend work (Golden, 2001). <span class='discourse'>Moreover</span>, boundary ambiguity generates psychological costs: self-employed workers report 38% higher work-family conflict and 0.4 SD elevated burnout symptoms relative to traditionally employed workers (Parasuraman et al., 1996). <span class='causal'>These boundary management challenges prove</span> particularly pronounced among highly autonomous self-employed individuals who report difficulty "switching off" from work, with 67% reporting guilt or anxiety during non-work time (Annink et al., 2016). <span class='discourse'>However</span>, research also documents successful boundary management strategies: self-employed individuals employing structured scheduling practices and designated workspaces demonstrate work-family conflict levels comparable to traditional employees (Kreiner et al., 2009).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence reveals</span> that self-employment and traditional employment present fundamental trade-offs between autonomy/satisfaction and security/stability. <span class='discourse'>On balance</span>, self-employment suits individuals prioritizing autonomy and possessing financial buffers for income volatility, while traditional employment benefits those prioritizing security and clear work-life boundaries, suggesting no universally optimal employment relationship but rather context-dependent preferences and circumstances.</p>"
      }
    },
    {
      "id": "advertising-society",
      "title": "Advertising and Society",
      "topic": "Media and Consumerism",
      "essayType": "Opinion",
      "question": "Is advertising a very good thing for society?",
      "writingPoints": ["keeping people informed", "competition between companies", "consumer manipulation (your own idea)"],
      "styles": {
        "default": "<p><span class='discourse'>Advertising is everywhere</span> in modern society, appearing on television, online and in public spaces. <span class='discourse'>Because of this constant presence</span>, there is considerable debate about whether it truly benefits society. <span class='opinion'>I believe</span> that advertising often has more harmful than positive effects overall.</p><p><span class='discourse'>Firstly</span>, advertising does keep consumers informed about available products and services. <span class='causal'>This is because</span> companies use advertisements to communicate new offerings and special deals. <span class='discourse'>For example</span>, customers learn about useful innovations and discounts through advertising campaigns. <span class='causal'>As a result</span>, making informed shopping decisions becomes somewhat easier for consumers.</p><p><span class='discourse'>Furthermore</span>, advertising creates healthy competition between businesses in the marketplace. <span class='causal'>This is because</span> companies must constantly improve quality and service to attract customers effectively. <span class='discourse'>For instance</span>, competing brands often lower prices to win market share. <span class='causal'>Consequently</span>, consumers benefit from better products at competitive prices.</p><p><span class='discourse'>However</span>, advertising frequently manipulates consumers through clever psychological techniques. <span class='causal'>This is because</span> marketing deliberately creates artificial needs and desires in people's minds. <span class='discourse'>For example</span>, people buy unnecessary products due to persuasive and misleading advertisements.</p><p><span class='discourse'>In conclusion</span>, advertising has both positive and negative aspects for society. <span class='opinion'>However</span>, manipulation and overconsumption outweigh the informational benefits significantly. <span class='discourse'>Overall</span>, advertising is not always beneficial for society.</p>",
        
        "formal": "<p><span class='discourse'>Advertising constitutes</span> a pervasive element of contemporary society, manifesting across television, digital platforms, and physical environments. <span class='discourse'>Given this ubiquitous presence</span>, substantial debate exists regarding advertising's net societal contribution. <span class='opinion'>From a critical perspective</span>, advertising frequently generates more detrimental than beneficial societal consequences.</p><p><span class='discourse'>Admittedly</span>, advertising serves informational functions regarding product availability and characteristics. <span class='causal'>This utility exists because</span> commercial entities utilize advertising to communicate product innovations and promotional offerings. <span class='discourse'>To illustrate</span>, consumers gain awareness of beneficial innovations and cost-saving opportunities through advertising exposure. <span class='causal'>Consequently</span>, consumer decision-making processes may experience modest facilitation.</p><p><span class='discourse'>Furthermore</span>, advertising stimulates competitive dynamics within commercial markets. <span class='causal'>This competitive effect occurs because</span> firms must continuously enhance product quality and service provision to maintain consumer appeal. <span class='discourse'>Specifically</span>, competing organizations frequently reduce pricing to capture market share. <span class='causal'>Therefore</span>, consumers realize benefits through improved products and competitive pricing structures.</p><p><span class='discourse'>Nevertheless</span>, advertising frequently employs sophisticated psychological manipulation techniques. <span class='causal'>This manipulation occurs because</span> marketing strategies deliberately generate artificial consumer desires and perceived needs. <span class='discourse'>For instance</span>, consumers purchase unnecessary products as a consequence of persuasive and potentially deceptive advertising messages.</p><p><span class='discourse'>In conclusion</span>, while advertising demonstrates certain benefits, <span class='opinion'>critical analysis suggests</span> manipulative practices and consumption excess outweigh informational advantages substantially. <span class='discourse'>On balance</span>, advertising generates predominantly negative societal consequences.</p>",
        
        "academic": "<p><span class='discourse'>Within consumer psychology and media studies literature</span>, substantial scholarly attention examines advertising's societal implications across informational, economic, and psychological dimensions. <span class='discourse'>Global advertising expenditure</span> exceeds $760 billion annually, with average individuals exposed to 4,000-10,000 advertising messages daily (Advertising Association, 2023). <span class='discourse'>This analysis evaluates</span> advertising's societal effects across three dimensions: consumer information provision, market competition facilitation, and psychological manipulation concerns.</p><p><span class='opinion'>Marketing economics research demonstrates that</span> advertising provides certain informational benefits facilitating consumer decision-making. <span class='causal'>Information economics theory posits that</span> advertising reduces information asymmetries between producers and consumers, potentially improving market efficiency (Stigler, 1961). <span class='discourse'>Empirical evidence confirms that</span> informative advertising—communicating objective product attributes, pricing, and availability—enhances consumer welfare by reducing search costs by an estimated 15-20% (Ackerberg, 2001). <span class='discourse'>Moreover</span>, advertising facilitates new product diffusion: innovations with advertising support achieve 34% faster market adoption and 28% higher awareness relative to non-advertised alternatives (Dekimpe & Hanssens, 1995). <span class='causal'>These informational benefits prove</span> particularly pronounced for experience goods where product quality is difficult to assess pre-purchase (Nelson, 1974). <span class='discourse'>However</span>, content analyses reveal that only 23% of contemporary advertising provides substantive product information, with 77% emphasizing emotional appeals, lifestyle associations, and celebrity endorsements rather than objective product attributes (Abernethy & Franke, 1996).</p><p><span class='discourse'>Additionally</span>, advertising can stimulate market competition benefiting consumers through improved quality and pricing. <span class='causal'>Industrial organization theory suggests that</span> advertising reduces entry barriers for new competitors and intensifies competitive pressure on incumbents (Schmalensee, 1972). <span class='discourse'>Empirical research demonstrates that</span> advertising intensity correlates with increased market competition in certain contexts: markets with higher advertising expenditure demonstrate 12% lower price-cost margins and 8% higher product quality ratings (Comanor & Wilson, 1974). <span class='discourse'>Moreover</span>, advertising enables small firms to challenge market leaders: new entrants utilizing advertising achieve 2.3× higher market penetration rates relative to non-advertising entrants (Roberts & Samuelson, 1988). <span class='causal'>However</span>, counter-evidence suggests advertising can create entry barriers through brand loyalty and scale economies: established brands' advertising advantages require new entrants to spend 2.5× incumbents' advertising rates to achieve equivalent awareness, potentially reducing rather than enhancing competition (Sutton, 1991).</p><p><span class='discourse'>Nevertheless</span>, substantial psychological research documents manipulative advertising practices exploiting cognitive vulnerabilities. <span class='causal'>Consumer psychology demonstrates that</span> advertising employs sophisticated persuasion techniques including scarcity framing, social proof manipulation, and emotional conditioning designed to bypass rational evaluation (Cialdini, 2009). <span class='discourse'>Experimental research reveals that</span> advertising exposure significantly increases purchase intentions for objectively unnecessary products: controlled advertising exposure studies demonstrate 34% increased desire for advertised products and 28% actual purchase rate increases, with effects persisting 7-14 days post-exposure (Braun-LaTour et al., 2004). <span class='discourse'>Critically</span>, neuroimaging research reveals that advertising activates reward circuitry (nucleus accumbens) and desire generation while simultaneously suppressing prefrontal control regions associated with rational evaluation, suggesting neurological manipulation (Knutson et al., 2007). <span class='causal'>These manipulation effects generate</span> substantial overconsumption: econometric analyses estimate that advertising increases aggregate consumption by 10-15% above levels predicted by income and prices alone, with marginal consumption providing minimal wellbeing benefits (Layard, 2005). <span class='discourse'>Moreover</span>, advertising particularly targets vulnerable populations: children aged 2-11 view 25,000+ television advertisements annually, with experimental evidence demonstrating that advertising exposure increases children's unhealthy food consumption by 45% and materialism by 0.6 SD (Buijzen & Valkenburg, 2003).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence reveals</span> that while advertising provides modest informational benefits and potentially stimulates competition in limited contexts, these advantages are substantially outweighed by systematic psychological manipulation, overconsumption promotion, and particularly concerning effects on vulnerable populations including children. <span class='discourse'>On balance</span>, advertising's net societal impact appears predominantly negative, suggesting need for enhanced regulation including restrictions on manipulative techniques, advertising volume limitations, and particular protections for children and other vulnerable groups.</p>"
      }
    },
    {
  "id": "helping-others",
  "title": "Helping Other People",
  "topic": "Society and Responsibility",
  "essayType": "Opinion",
  "question": "Should everyone regularly do something to help other people?",
  "writingPoints": ["importance of friends and family", "giving back to society", "personal development (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Helping others</span> is fundamental to building strong, supportive communities everywhere. <span class='discourse'>Because of this</span>, many people argue that everyone should contribute regularly to helping others. <span class='opinion'>I firmly believe</span> that helping others should be an important part of everyone's life.</p><p><span class='discourse'>Firstly</span>, helping friends and family significantly strengthens personal relationships. <span class='causal'>This is because</span> supporting others builds trust, respect and deeper emotional connections. <span class='discourse'>For example</span>, helping a friend during difficult times brings people much closer together. <span class='causal'>As a result</span>, relationships become stronger, more reliable and more meaningful.</p><p><span class='discourse'>Furthermore</span>, giving back to society is extremely important for community wellbeing. <span class='causal'>This is because</span> communities function much better when people actively support each other. <span class='discourse'>For instance</span>, volunteering improves local services, facilities and quality of life for everyone. <span class='causal'>Consequently</span>, society becomes stronger, safer and more united.</p><p><span class='discourse'>Moreover</span>, helping others significantly benefits personal development and happiness. <span class='causal'>This is because</span> volunteering builds empathy, confidence and valuable new skills naturally. <span class='discourse'>For example</span>, people who regularly help others often report increased happiness and life satisfaction. <span class='causal'>Therefore</span>, giving benefits both the helper and recipient equally.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> everyone should regularly dedicate time to helping others. <span class='discourse'>Overall</span>, it strengthens relationships, improves communities and promotes personal growth.</p>",
    
    "formal": "<p><span class='discourse'>Within contemporary social discourse</span>, mutual assistance represents a fundamental component of community cohesion and collective wellbeing. <span class='discourse'>Consequently</span>, substantial consideration should be given to whether individuals should maintain regular helping behaviors. <span class='opinion'>From a civic responsibility perspective</span>, systematic assistance to others should constitute an integral component of individual conduct.</p><p><span class='discourse'>Primarily</span>, providing support to friends and familial networks substantially reinforces interpersonal relationship quality. <span class='causal'>This relationship enhancement occurs because</span> mutual assistance cultivates trust, respect, and profound emotional connectivity. <span class='discourse'>To illustrate</span>, providing support during challenging circumstances significantly deepens interpersonal bonds. <span class='causal'>Consequently</span>, relationships demonstrate enhanced stability, reliability, and personal significance.</p><p><span class='discourse'>Furthermore</span>, contributing to community welfare represents an essential civic obligation. <span class='causal'>This societal importance exists because</span> collective wellbeing depends substantially upon reciprocal support systems. <span class='discourse'>Specifically</span>, volunteer engagement enhances local infrastructure, services, and overall quality of life indicators. <span class='causal'>Therefore</span>, communities achieve greater cohesion, stability, and collective efficacy.</p><p><span class='discourse'>Additionally</span>, altruistic behavior generates substantial personal development and psychological wellbeing outcomes. <span class='causal'>This benefit occurs because</span> helping activities cultivate empathy, self-efficacy beliefs, and competency development. <span class='discourse'>For instance</span>, individuals engaging regularly in helping behaviors report elevated happiness and life satisfaction metrics. <span class='causal'>Thus</span>, altruistic engagement benefits both providers and recipients substantially.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>comprehensive analysis strongly supports</span> regular helping behavior as an essential component of responsible citizenship. <span class='discourse'>On balance</span>, systematic assistance enhances relationship quality, strengthens community infrastructure, and facilitates personal development.</p>",
    
    "academic": "<p><span class='discourse'>Within prosocial behavior research and community psychology literature</span>, substantial scholarly attention examines the individual and societal implications of helping behavior patterns. <span class='discourse'>Altruistic behavior</span>—defined as voluntary actions intended to benefit others—has been documented across all human societies, suggesting evolutionary and cultural significance (Batson, 2011). <span class='discourse'>This analysis evaluates</span> rationales for regular helping behavior across three dimensions: interpersonal relationship maintenance, community social capital generation, and individual psychological wellbeing outcomes.</p><p><span class='opinion'>Social psychology research demonstrates that</span> helping behavior substantially strengthens interpersonal relationship quality through multiple mechanisms. <span class='causal'>Social exchange theory posits that</span> relationships are maintained through reciprocal benefit provision, with helping behaviors generating relationship commitment and trust (Blau, 1964). <span class='discourse'>Longitudinal studies reveal that</span> individuals providing regular instrumental support to friends and family report significantly stronger relationship quality (r = 0.48, p < 0.001) and relationship stability (42% lower dissolution rates over 5-year periods) relative to individuals providing minimal support (Gleason et al., 2003). <span class='discourse'>Moreover</span>, helping behaviors activate neurological bonding mechanisms: fMRI studies demonstrate that providing assistance activates brain regions associated with social bonding and attachment (ventral striatum, septal area), generating positive affect and relationship reinforcement (Inagaki & Eisenberger, 2012). <span class='causal'>These neurological responses suggest</span> that helping behavior represents an evolved mechanism for relationship maintenance critical to human survival.</p><p><span class='discourse'>Additionally</span>, community-level helping behavior generates social capital benefiting collective wellbeing. <span class='causal'>Social capital theory posits that</span> networks of reciprocal assistance create community resources facilitating collective action and mutual support (Putnam, 2000). <span class='discourse'>Empirical research demonstrates that</span> communities with higher volunteering rates (>30% resident participation) exhibit superior outcomes across multiple domains including 23% lower crime rates, 34% higher civic engagement, 18% better public health indicators, and 0.4 SD higher reported quality of life relative to low-volunteering communities (Putnam, 2000; Piliavin & Siegl, 2007). <span class='discourse'>Economic analyses reveal that</span> volunteer labor contributes approximately £50 billion annual value to UK economy—equivalent to 3.1% of GDP—providing essential services including healthcare support, youth mentoring, and emergency response (NCVO, 2023). <span class='causal'>These community-level benefits demonstrate</span> that individual helping behaviors generate substantial positive externalities extending beyond immediate beneficiaries.</p><p><span class='discourse'>Furthermore</span>, helping behavior produces significant psychological wellbeing benefits for helpers themselves. <span class='causal'>The 'helper's high' phenomenon—documented neurologically through</span> endorphin and oxytocin release during altruistic acts—generates immediate positive affect and stress reduction (Post, 2005). <span class='discourse'>Meta-analytic evidence indicates that</span> regular volunteering correlates significantly with enhanced life satisfaction (r = 0.31), reduced depression symptoms (d = -0.42), and improved physical health outcomes including 24% lower mortality risk after controlling for demographic and health covariates (Jenkinson et al., 2013). <span class='discourse'>Longitudinal research reveals that</span> volunteering 100+ hours annually produces wellbeing benefits equivalent to income increases of £15,000-£20,000, suggesting substantial non-monetary value (Meier & Stutzer, 2008). <span class='causal'>Additionally</span>, helping behaviors facilitate skill development and social network expansion: volunteers report enhanced competencies in leadership (71%), communication (68%), and problem-solving (62%), with 34% reporting subsequent employment benefits (Corporation for National and Community Service, 2007).</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>convergent evidence from psychology, sociology, and public health research indicates that</span> regular helping behavior generates substantial benefits across individual, relational, and community levels. <span class='discourse'>On balance</span>, systematic engagement in helping activities strengthens interpersonal bonds, generates community social capital, and enhances helper psychological wellbeing, providing compelling rationale for incorporating regular helping behavior into normative social expectations and individual practice.</p>"
  }
},
{
  "id": "online-learning",
  "title": "Online Learning",
  "topic": "Education Technology",
  "essayType": "For & Against",
  "question": "Is online learning better than traditional classroom learning?",
  "writingPoints": ["flexibility", "interaction", "self-discipline (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent times</span>, online learning has become increasingly widespread across all educational levels. <span class='discourse'>It is widely recognised that</span> both online and traditional classroom learning have significant advantages. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of each approach carefully.</p><p><span class='opinion'>The main advantage of</span> online learning is its exceptional flexibility and accessibility. <span class='causal'>This is because</span> students can study anytime and anywhere with internet access. <span class='discourse'>For example</span>, learners can access recorded lessons at times that suit their personal schedules. <span class='causal'>As a result</span>, education becomes more accessible to people with busy lives.</p><p><span class='opinion'>While there are many advantages</span>, classrooms provide valuable face-to-face interaction. <span class='opinion'>The key disadvantage of</span> online learning is significantly limited social contact with teachers and classmates. <span class='causal'>A major drawback is that</span> students miss real discussions, friendships and immediate feedback. <span class='causal'>Consequently</span>, learning online can feel quite isolating for many students.</p><p><span class='discourse'>Furthermore</span>, online learning requires strong self-discipline and personal motivation. <span class='causal'>This is because</span> students must organise themselves effectively without direct teacher supervision. <span class='discourse'>For instance</span>, many students struggle with procrastination when studying alone at home.</p><p><span class='discourse'>In conclusion</span>, both learning methods have significant advantages and challenges. <span class='discourse'>On balance</span>, combining online flexibility with classroom interaction may prove most effective overall.</p>",
    
    "formal": "<p><span class='discourse'>In contemporary educational contexts</span>, digital learning platforms have demonstrated substantial growth across all instructional levels. <span class='discourse'>It is generally acknowledged that</span> both online and traditional classroom instruction present distinctive advantages and limitations. <span class='discourse'>Therefore, it becomes essential to evaluate</span> comparative benefits and drawbacks systematically.</p><p><span class='opinion'>The principal advantage of</span> online education concerns exceptional temporal and spatial flexibility. <span class='causal'>This flexibility exists because</span> learners can engage with instructional content independently of fixed schedules or physical locations. <span class='discourse'>To illustrate</span>, students can access recorded lectures at times aligned with personal obligations and preferences. <span class='causal'>Consequently</span>, educational access expands substantially for individuals managing complex life circumstances.</p><p><span class='opinion'>While substantial advantages exist</span>, traditional classrooms facilitate valuable interpersonal engagement. <span class='opinion'>The primary disadvantage of</span> digital instruction is substantially reduced face-to-face interaction with instructors and peers. <span class='causal'>A critical concern is that</span> students forgo authentic dialogue, collegial relationships, and immediate instructional feedback. <span class='causal'>Therefore</span>, online learning environments may generate social isolation experiences for numerous learners.</p><p><span class='discourse'>Additionally</span>, online education necessitates exceptional self-regulation and intrinsic motivation. <span class='causal'>This requirement exists because</span> students must maintain autonomous organization and progress monitoring without direct instructor oversight. <span class='discourse'>Specifically</span>, numerous students experience procrastination challenges when engaging with coursework in unsupervised domestic environments.</p><p><span class='discourse'>In conclusion</span>, both instructional modalities demonstrate significant advantages and challenges. <span class='discourse'>On balance</span>, hybrid approaches integrating online flexibility with classroom interaction may optimize educational outcomes.</p>",
    
    "academic": "<p><span class='discourse'>Within educational technology and learning sciences literature</span>, substantial research examines comparative effectiveness of online versus traditional face-to-face instruction. <span class='discourse'>Online learning enrollment</span> has expanded dramatically, with 43% of tertiary students enrolled in at least one online course and fully-online degree programs increasing 356% over the past decade (NCES, 2023). <span class='discourse'>This analysis evaluates</span> online learning implications across three dimensions: temporal and spatial flexibility, social interaction and pedagogical immediacy, and self-regulated learning requirements.</p><p><span class='opinion'>Educational access research demonstrates that</span> online learning provides substantial flexibility benefits expanding educational participation. <span class='causal'>This accessibility advantage exists because</span> asynchronous online formats eliminate temporal and geographical constraints characteristic of traditional instruction. <span class='discourse'>Enrollment data reveals that</span> online learning disproportionately serves non-traditional students: 58% of online learners are employed full-time versus 27% of campus-based students, while 42% are parents versus 19% of campus cohorts (Clinefelter & Aslanian, 2016). <span class='discourse'>Moreover</span>, geographical barriers are substantially reduced: students in rural areas demonstrate 73% higher online enrollment relative to campus-based programs, accessing institutions previously unavailable due to distance constraints (Johnson & Mejia, 2014). <span class='causal'>These flexibility benefits generate</span> measurable participation increases: controlling for demographics, online program availability increases tertiary enrollment by 9-12 percentage points among working adults and 15-18 percentage points among parents (Deming et al., 2015).</p><p><span class='opinion'>Nevertheless, substantial pedagogical research documents</span> significant interaction and engagement deficits in online environments. <span class='causal'>Social presence theory posits that</span> learning effectiveness depends partially on perceived interpersonal connection and immediacy—dimensions substantially reduced in online contexts (Short et al., 1976). <span class='discourse'>Comparative studies reveal that</span> online students report 47% fewer peer interactions, 52% reduced informal faculty contact, and 0.6 SD lower sense of belonging relative to campus-based counterparts (Jaggars & Xu, 2016). <span class='discourse'>Moreover</span>, pedagogical immediacy—defined as temporal proximity between student responses and instructor feedback—averages 24-48 hours in online contexts versus real-time in classrooms, potentially impeding misconception correction and scaffolded learning (Bernard et al., 2009). <span class='causal'>These interaction deficits correlate with</span> learning outcomes: meta-analytic evidence indicates that purely online instruction produces 0.14 SD lower learning outcomes relative to face-to-face instruction, with effects particularly pronounced for less-prepared students (d = -0.28) and quantitative subjects (d = -0.22) (Means et al., 2013). <span class='discourse'>Retention data demonstrates</span> concerning patterns, with online courses exhibiting 10-15 percentage points higher withdrawal rates and 8-12 percentage points lower completion rates relative to equivalent campus courses (Xu & Jaggars, 2014).</p><p><span class='discourse'>Additionally</span>, online learning success depends critically on self-regulated learning competencies often underdeveloped among students. <span class='causal'>Self-regulated learning theory posits that</span> effective independent learning requires metacognitive monitoring, strategic planning, and volitional control—competencies requiring deliberate cultivation (Zimmerman, 2002). <span class='discourse'>Empirical research demonstrates that</span> only 31% of undergraduate students possess adequate self-regulated learning skills for online success, with deficits particularly pronounced in time management (68% deficient), goal-setting (54% deficient), and help-seeking behaviors (61% deficient) (Broadbent & Poon, 2015). <span class='discourse'>Predictive analyses reveal that</span> self-regulation scores predict online course performance (β = 0.44, p < 0.001) more strongly than traditional classroom performance (β = 0.28, p < 0.01), suggesting differential competency requirements (Barnard et al., 2009). <span class='causal'>These self-regulation demands generate</span> equity concerns: students from lower socioeconomic backgrounds demonstrate 0.4 SD lower self-regulation scores and experience disproportionately negative online learning outcomes (Xu & Jaggars, 2013), potentially exacerbating educational inequality despite accessibility improvements.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>empirical evidence reveals</span> that online and traditional learning present fundamental trade-offs between flexibility/access and interaction/support. <span class='discourse'>On balance</span>, research suggests that hybrid models integrating online flexibility with periodic face-to-face interaction optimize outcomes, with studies demonstrating that 25-50% online instruction combined with in-person sessions produces learning gains 0.35 SD higher than purely online or purely face-to-face formats (Means et al., 2013), suggesting that blended approaches leverage advantages while mitigating limitations of each modality.</p>"
 
    }
  }
}
