{
 "opinion": [
{
  "id": "life-better-today",
  "title": "Life Better Today",
  "topic": "Quality of Life: Past vs Present",
  "essayType": "Opinion",
  "question": "'Life is better today than it was 100 years ago.' Do you agree?",
  "writingPoints": ["health", "entertainment", "technology and communication (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Nowadays</span>, there is considerable debate about whether life today is better than in the past. <span class='opinion'>From my perspective</span>, modern life is significantly better due to remarkable advances in health, entertainment and communication.</p><p><span class='opinion'>I firmly believe that</span> healthcare plays an essential role in improving our lives. <span class='causal'>This is because</span> diseases that once killed millions can now be treated effectively. <span class='discourse'>For example</span>, vaccines have eliminated deadly illnesses like polio and smallpox. <span class='causal'>As a result</span>, life expectancy has increased dramatically worldwide.</p><p><span class='discourse'>Furthermore</span>, entertainment options have expanded enormously. <span class='causal'>This is because</span> streaming platforms provide unlimited access to films and music instantly. <span class='discourse'>For instance</span>, we can enjoy any content from home at any time. <span class='causal'>Consequently</span>, people have far more ways to relax and enjoy themselves.</p><p><span class='discourse'>In addition</span>, technology has transformed how we communicate globally. Video calls allow families to stay connected across continents daily. <span class='opinion'>While some argue</span> this causes stress, <span class='opinion'>I believe</span> the benefits of instant global communication far outweigh any drawbacks.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I am convinced that</span> life today is much better than a century ago. <span class='discourse'>Overall</span>, improvements in health, entertainment and technology demonstrate remarkable human progress.</p>",
    
    "alternative1": "<p><span class='discourse'>It is widely recognised that</span> considerable discussion exists about quality of life today compared to the past. <span class='opinion'>In my view</span>, contemporary life offers substantial improvements, particularly regarding healthcare, entertainment and communication technology.</p><p><span class='opinion'>It seems to me that</span> medical advances represent the most important improvement in modern life. <span class='causal'>This is because</span> illnesses that previously caused widespread death are now preventable or curable. <span class='discourse'>To illustrate</span>, vaccination programmes have virtually eradicated diseases like smallpox and polio. <span class='causal'>Consequently</span>, people worldwide now live much longer, healthier lives.</p><p><span class='discourse'>Secondly</span>, entertainment possibilities have grown tremendously over recent decades. <span class='causal'>This is because</span> digital services offer instant access to countless films, shows and music. <span class='discourse'>For example</span>, streaming platforms let us watch anything we want whenever convenient. <span class='causal'>As a result</span>, leisure time has become far more enjoyable and varied.</p><p><span class='discourse'>Moreover</span>, communication technology has revolutionized how people stay in touch. Modern technology enables families separated by vast distances to video call daily. <span class='opinion'>Although critics claim</span> constant connectivity creates pressure, <span class='opinion'>I would argue</span> that staying connected across the world provides enormous benefits.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I strongly believe</span> life has improved dramatically over the past century. <span class='discourse'>Taking everything into account</span>, advances in medicine, entertainment and communication show significant progress.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent times</span>, many people debate whether modern life surpasses life in previous centuries. <span class='opinion'>From my point of view</span>, today's world is considerably better, especially concerning healthcare, entertainment and communication.</p><p><span class='opinion'>The main advantage of</span> modern life is vastly improved medical care and treatment. <span class='causal'>This is because</span> dangerous diseases that killed countless people are now easily prevented or treated. <span class='discourse'>As an example</span>, medical breakthroughs have eliminated killers like polio and smallpox through vaccination. <span class='causal'>Therefore</span>, global life expectancy has risen remarkably.</p><p><span class='discourse'>Additionally</span>, entertainment choices have increased massively in the modern era. <span class='causal'>This is because</span> technology provides unlimited on-demand access to media and music. <span class='discourse'>For instance</span>, we can instantly watch virtually any film or show from our homes. <span class='causal'>As a consequence</span>, people enjoy significantly more entertainment opportunities than ever before.</p><p><span class='discourse'>Furthermore</span>, modern technology has completely transformed global communication. Communication tools enable families living on different continents to maintain daily video contact. <span class='opinion'>Despite arguments that</span> digital connectivity generates stress, <span class='opinion'>I am convinced</span> the advantages of worldwide instant communication clearly exceed any disadvantages.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> contemporary life far surpasses life a century ago. <span class='discourse'>On balance</span>, healthcare, entertainment and communication improvements represent tremendous human advancement.</p>"
  }
},
{
  "id": "work-money-enjoyment",
  "title": "Work: Money vs Enjoyment",
  "topic": "Work and Happiness",
  "essayType": "For & Against",
  "question": "Is it better to earn a lot of money or to enjoy your job?",
  "writingPoints": ["how much time is spent at work", "the type of work which is done", "job satisfaction and mental health (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Few people would deny that</span> work is an essential part of modern life. <span class='discourse'>In recent times</span>, there has been considerable debate about job satisfaction versus high salaries. <span class='discourse'>Therefore, it is vital we analyse</span> the benefits and drawbacks of both options.</p><p><span class='opinion'>The main advantage of</span> earning a high salary is financial security and stability. <span class='causal'>This is because</span> well-paid workers can afford comfortable lifestyles and support their families. <span class='discourse'>For example</span>, they can pay for quality healthcare and education. <span class='opinion'>Another strong point is that</span> we spend nearly a third of our lives working, so earning good money makes those hours worthwhile.</p><p><span class='opinion'>While there are many advantages to</span> high salaries, job satisfaction matters greatly too. <span class='opinion'>The key disadvantage of</span> focusing only on money is that personal happiness suffers considerably. <span class='discourse'>For instance</span>, boring or stressful jobs often lead to unhappiness regardless of salary.</p><p><span class='discourse'>Moreover</span>, mental health is significantly affected by job satisfaction. <span class='causal'>This is because</span> unfulfilling work can cause burnout, anxiety and depression. <span class='causal'>Consequently</span>, finding meaningful work protects our overall wellbeing.</p><p><span class='discourse'>In conclusion</span>, both money and enjoyment have clear advantages. <span class='discourse'>On balance</span>, finding work that provides both purpose and reasonable income would be the ideal solution.</p>",
    
    "alternative1": "<p><span class='discourse'>It is widely recognised that</span> work plays a central role in our daily lives. <span class='discourse'>Nowadays</span>, many people debate whether earning lots of money or enjoying your job is more important. <span class='discourse'>Hence, it is essential to consider</span> the advantages and disadvantages of each.</p><p><span class='opinion'>One key benefit of</span> high-paying jobs is that they provide excellent financial security. <span class='causal'>This is because</span> people with good salaries can afford better housing, holidays and lifestyle choices. <span class='discourse'>For instance</span>, they rarely worry about paying bills or unexpected expenses. <span class='discourse'>Furthermore</span>, considering we spend approximately one-third of our entire lives at work, good pay feels like fair compensation.</p><p><span class='opinion'>Despite these benefits</span>, enjoying your work brings important advantages too. <span class='opinion'>A major drawback of</span> chasing money alone is that it damages happiness and life satisfaction. <span class='discourse'>For example</span>, people in dull or high-pressure jobs feel miserable even when earning excellent salaries.</p><p><span class='discourse'>Additionally</span>, job satisfaction has serious effects on mental wellbeing. <span class='causal'>This is because</span> unrewarding work often leads to stress-related illnesses and emotional exhaustion. <span class='causal'>As a result</span>, choosing satisfying employment helps maintain good mental health.</p><p><span class='discourse'>To sum up</span>, both high earnings and job enjoyment offer real benefits. <span class='discourse'>On balance</span>, the ideal situation combines meaningful work with adequate financial rewards.</p>",
    
    "alternative2": "<p><span class='discourse'>It is common knowledge that</span> employment occupies a huge portion of our lives. <span class='discourse'>Recently</span>, considerable discussion has emerged about whether money or job satisfaction should be prioritized. <span class='discourse'>Therefore, it is important to examine</span> both sides of this debate carefully.</p><p><span class='opinion'>The primary advantage of</span> earning excellent money is achieving financial stability and freedom. <span class='causal'>This is because</span> high earners can provide comfortable homes and opportunities for their families. <span class='discourse'>To illustrate</span>, they access better schools, medical care and retirement security. <span class='opinion'>It is also worth noting that</span> since work occupies roughly a third of our waking hours, earning well makes this time investment worthwhile.</p><p><span class='opinion'>Although high salaries have benefits</span>, workplace happiness also deserves serious consideration. <span class='opinion'>The main disadvantage of</span> prioritizing salary above everything else is reduced personal wellbeing and satisfaction. <span class='discourse'>As an example</span>, many well-paid professionals in boring roles report feeling deeply unhappy.</p><p><span class='discourse'>In addition</span>, mental health depends heavily on finding fulfilling employment. <span class='causal'>This is because</span> dissatisfying jobs frequently cause serious problems like burnout and depression. <span class='causal'>Therefore</span>, choosing work you find meaningful protects your psychological health.</p><p><span class='discourse'>In conclusion</span>, salary and satisfaction both provide significant advantages. <span class='discourse'>Taking everything into account</span>, combining enjoyable work with decent pay represents the best outcome.</p>"
  }
},
{
  "id": "endangered-animals",
  "title": "Saving Endangered Animals",
  "topic": "Environmental Protection",
  "essayType": "Opinion",
  "question": "Should we do everything possible to save endangered animals?",
  "writingPoints": ["the kind of animals in danger", "reasons for protecting them", "ecosystem balance (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent years</span>, protecting endangered animals has attracted increasing attention from both the public and environmental experts worldwide. <span class='opinion'>I strongly believe that</span> we should do everything possible to save them for future generations.</p><p><span class='discourse'>To begin with</span>, many magnificent species are currently in serious danger of extinction. <span class='causal'>This is largely because</span> hunting and habitat destruction have reduced their numbers drastically. <span class='discourse'>For example</span>, tigers, rhinos and elephants face critical threats. <span class='causal'>As a result</span>, we are losing irreplaceable wildlife at an alarming rate.</p><p><span class='discourse'>Furthermore</span>, there are compelling reasons to protect these endangered animals. <span class='causal'>This is because</span> every species plays vital roles in maintaining natural balance. <span class='discourse'>For instance</span>, bees pollinate crops that humans depend on for food. <span class='causal'>Consequently</span>, losing animal species threatens our own survival too.</p><p><span class='discourse'>In addition</span>, ecosystem balance depends entirely on biodiversity. <span class='causal'>This is because</span> each animal contributes to complex food chains. <span class='discourse'>For example</span>, wolves control deer populations and protect forests. <span class='causal'>Therefore</span>, protecting wildlife maintains environmental stability for everyone.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> endangered animals must be protected urgently. <span class='discourse'>Taking everything into account</span>, conservation benefits both nature and humanity significantly.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, the protection of endangered species has become a major concern for environmentalists and governments globally. <span class='opinion'>From my perspective</span>, maximum effort should be dedicated to saving threatened wildlife.</p><p><span class='discourse'>Firstly</span>, numerous incredible animal species face the threat of complete extinction. <span class='causal'>This happens because</span> illegal hunting and habitat loss have caused populations to decline dramatically. <span class='discourse'>To illustrate</span>, iconic animals like tigers, elephants and rhinos are disappearing rapidly. <span class='causal'>Consequently</span>, unique species are vanishing forever at a frightening speed.</p><p><span class='discourse'>Secondly</span>, protecting endangered animals makes sense for important practical reasons. <span class='causal'>This is because</span> all creatures perform essential functions within nature. <span class='discourse'>As an example</span>, bees pollinate the plants that produce much of our food supply. <span class='causal'>As a result</span>, when animals disappear, human food security becomes threatened.</p><p><span class='discourse'>Moreover</span>, biodiversity is absolutely essential for healthy ecosystems. <span class='causal'>This is because</span> animals form interconnected relationships in food webs. <span class='discourse'>For instance</span>, predators like wolves keep herbivore numbers balanced, preventing forest damage. <span class='causal'>Thus</span>, saving wildlife helps maintain nature's delicate balance.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I am convinced that</span> protecting endangered species should be an urgent priority. <span class='discourse'>Overall</span>, wildlife conservation protects both natural ecosystems and human interests.</p>",
    
    "alternative2": "<p><span class='discourse'>Over recent decades</span>, endangered animal conservation has emerged as a critical environmental issue worldwide. <span class='opinion'>In my view</span>, society must make every effort to prevent species extinction.</p><p><span class='discourse'>To start with</span>, countless remarkable animals currently risk disappearing forever. <span class='causal'>This serious situation exists because</span> poaching and environmental destruction have devastated animal populations. <span class='discourse'>For example</span>, majestic creatures such as elephants, rhinos and tigers face extinction. <span class='causal'>Therefore</span>, precious wildlife is being lost permanently at an extremely concerning pace.</p><p><span class='discourse'>Additionally</span>, strong reasons exist for prioritizing animal protection efforts. <span class='causal'>This is because</span> each species fulfils important roles in nature's systems. <span class='discourse'>For instance</span>, bees are crucial for pollinating crops that feed human populations. <span class='causal'>Consequently</span>, species loss creates direct dangers for humanity's survival.</p><p><span class='discourse'>What is more</span>, balanced ecosystems require diverse animal populations. <span class='causal'>This is because</span> creatures depend on each other within food chains. <span class='discourse'>As an example</span>, wolves regulate deer numbers, which prevents overgrazing and protects vegetation. <span class='causal'>As a result</span>, conserving wildlife preserves environmental health for all.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I completely agree that</span> endangered animals deserve maximum protection. <span class='discourse'>On balance</span>, conservation efforts benefit both the natural world and human wellbeing.</p>"
  }
},
  {
  "id": "friends-vs-family",
  "title": "Friends vs Family",
  "topic": "Relationships",
  "essayType": "For & Against",
  "question": "Which is more important – friends or family?",
  "writingPoints": ["who you enjoy yourself with", "who will help you when you have problems", "life stages (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>It is widely recognised that</span> relationships are essential to our happiness and wellbeing. <span class='discourse'>In recent times</span>, there has been considerable debate about the value of friendships compared with family ties. <span class='discourse'>Hence, it is vital to consider</span> the benefits of both.</p><p><span class='opinion'>The main advantage of</span> friends is that they provide enjoyment and shared interests. <span class='causal'>This is because</span> we choose friends who share our hobbies, tastes and values. <span class='discourse'>For example</span>, teenagers select friends to socialise and have fun with. <span class='causal'>As a result</span>, friendships create happiness and memorable experiences throughout life.</p><p><span class='opinion'>While there are many advantages to</span> friendships, family provides stronger support during difficult times. <span class='opinion'>The key disadvantage of</span> relying only on friends is that they may not always help during serious problems. <span class='discourse'>In contrast</span>, family members typically offer unconditional support during crises without hesitation.</p><p><span class='discourse'>Additionally</span>, different relationships matter at different life stages. <span class='causal'>This is because</span> teenagers often prioritise friends, while adults tend to value family more. <span class='causal'>Consequently</span>, both types of relationships serve important purposes throughout our lives.</p><p><span class='discourse'>In conclusion</span>, both friends and family are extremely valuable. <span class='discourse'>On balance</span>, family support proves more reliable, but both contribute significantly to our happiness.</p>",
    
    "alternative1": "<p><span class='discourse'>Few people would deny that</span> personal relationships play a crucial role in our lives. <span class='discourse'>Nowadays</span>, many people discuss whether friendships or family connections matter most. <span class='discourse'>Therefore, it is important to analyse</span> the advantages of each type of relationship.</p><p><span class='opinion'>One key benefit of</span> friendships is the fun and enjoyment they bring. <span class='causal'>This is because</span> we select friends based on common interests, hobbies and personalities. <span class='discourse'>For instance</span>, young people choose friends who enjoy similar activities and entertainment. <span class='causal'>Consequently</span>, friendships generate joy and create lasting positive memories.</p><p><span class='opinion'>Despite these benefits</span>, family relationships offer superior reliability when problems arise. <span class='opinion'>A major drawback of</span> depending exclusively on friends is their potential unavailability during emergencies. <span class='discourse'>By comparison</span>, relatives usually provide unwavering support regardless of circumstances.</p><p><span class='discourse'>Moreover</span>, the importance of each relationship type varies throughout life. <span class='causal'>This is because</span> young people typically focus on friendships, whereas older adults increasingly appreciate family bonds. <span class='causal'>As a result</span>, both relationship categories fulfill valuable roles at different times.</p><p><span class='discourse'>To sum up</span>, friendships and family both offer significant value. <span class='discourse'>Taking everything into account</span>, family proves more dependable, though both relationships enhance wellbeing considerably.</p>",
    
    "alternative2": "<p><span class='discourse'>It is common knowledge that</span> strong relationships are fundamental to human happiness. <span class='discourse'>Recently</span>, considerable discussion has emerged about whether friends or family matter more. <span class='discourse'>Hence, it is essential to examine</span> what each type of relationship offers.</p><p><span class='opinion'>The primary advantage of</span> having good friends is the pleasure and shared experiences they provide. <span class='causal'>This is because</span> friends are chosen based on matching interests, values and personalities. <span class='discourse'>As an example</span>, teenagers befriend others who enjoy the same music, sports and activities. <span class='causal'>Therefore</span>, friendships bring genuine happiness and unforgettable moments.</p><p><span class='opinion'>Although friendships have benefits</span>, family offers more dependable support in difficult situations. <span class='opinion'>The main disadvantage of</span> counting on friends alone is that they might not help during serious crises. <span class='discourse'>Conversely</span>, family members almost always provide help without conditions or expectations.</p><p><span class='discourse'>Furthermore</span>, which relationships we prioritize changes as we age. <span class='causal'>This is because</span> adolescents generally value friends most highly, while mature adults often prioritize family. <span class='causal'>Thus</span>, both friendship and family fulfill important needs at various life stages.</p><p><span class='discourse'>In conclusion</span>, both relationship types are highly valuable. <span class='discourse'>On balance</span>, family connections prove more reliable, yet both contribute meaningfully to happiness.</p>"
  }
},
{
  "id": "environment-pollution",
  "title": "Environment & Pollution",
  "topic": "Environment",
  "essayType": "Problem-Solution",
  "question": "Do you think the world's pollution problems can be solved?",
  "writingPoints": ["transport", "rivers and seas", "renewable energy (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Nowadays</span>, pollution has become an increasingly serious problem affecting the entire planet. <span class='discourse'>It is widely recognised that</span> pollution damages health and the environment significantly. <span class='discourse'>Hence, it is vital to examine</span> the main problems and explore practical solutions.</p><p><span class='discourse'>Firstly</span>, transport causes significant air pollution in cities worldwide. <span class='causal'>This is because</span> millions of vehicles produce harmful emissions every single day. <span class='discourse'>For example</span>, major cities suffer from dangerous levels of smog. <span class='causal'>As a result</span>, respiratory diseases are increasing among urban populations.</p><p><span class='discourse'>Secondly</span>, rivers and seas are being contaminated by industrial waste and plastic. <span class='causal'>This happens because</span> factories release toxic chemicals into waterways carelessly. <span class='discourse'>For instance</span>, countless marine animals die from plastic pollution annually. <span class='causal'>Consequently</span>, entire ecosystems are being destroyed.</p><p><span class='discourse'>However</span>, renewable energy offers a very promising solution to these problems. <span class='causal'>This is because</span> solar and wind power produce no harmful emissions whatsoever. <span class='discourse'>For example</span>, countries investing in clean energy report significantly improved air quality. <span class='discourse'>If such measures were implemented</span> globally, pollution could be reduced dramatically.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I believe</span> pollution can be addressed effectively through determined action. <span class='discourse'>Overall</span>, combining cleaner transport, stricter regulations and renewable energy will protect our planet.</p>",
    
    "alternative1": "<p><span class='discourse'>These days</span>, pollution represents a growing threat to environmental and human health globally. <span class='discourse'>Few people would deny that</span> pollution causes serious damage to nature and people alike. <span class='discourse'>Therefore, it is important to identify</span> key pollution sources and discuss effective solutions.</p><p><span class='discourse'>To begin with</span>, vehicle emissions create severe air pollution problems in urban areas. <span class='causal'>This is because</span> cars, buses and trucks release dangerous gases continuously throughout each day. <span class='discourse'>To illustrate</span>, many cities experience hazardous smog that blankets entire regions. <span class='causal'>Consequently</span>, breathing problems and lung diseases are rising dramatically in cities.</p><p><span class='discourse'>Additionally</span>, water pollution from industry and plastic waste threatens aquatic life. <span class='causal'>This occurs because</span> companies dump harmful chemicals and waste into rivers and oceans. <span class='discourse'>As an example</span>, thousands of sea creatures perish each year from consuming plastic debris. <span class='causal'>As a result</span>, marine ecosystems face catastrophic damage.</p><p><span class='discourse'>Nevertheless</span>, renewable energy sources provide an effective answer to pollution challenges. <span class='causal'>This is because</span> technologies like solar panels and wind turbines generate clean electricity without pollution. <span class='discourse'>For instance</span>, nations adopting green energy technologies show remarkable air quality improvements. <span class='discourse'>Should governments adopt</span> these technologies worldwide, pollution levels would decrease substantially.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>it seems to me that</span> pollution problems can be solved through committed efforts. <span class='discourse'>Taking everything into account</span>, sustainable transport, environmental laws and clean energy offer real solutions.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent years</span>, pollution has emerged as one of humanity's most urgent environmental challenges. <span class='discourse'>It is generally acknowledged that</span> pollution harms both ecosystems and public health severely. <span class='discourse'>Hence, it is essential to analyse</span> major pollution causes and evaluate potential remedies.</p><p><span class='discourse'>One serious problem is that</span> transportation generates massive air pollution in metropolitan areas. <span class='causal'>This happens because</span> countless motor vehicles emit toxic fumes constantly every day. <span class='discourse'>For example</span>, large cities frequently experience thick, dangerous smog conditions. <span class='causal'>Therefore</span>, respiratory illnesses continue spreading rapidly among city residents.</p><p><span class='discourse'>Another major issue is that</span> industrial pollution and plastic contaminate water bodies extensively. <span class='causal'>This is because</span> manufacturing plants discharge poisonous substances directly into natural waterways. <span class='discourse'>For instance</span>, enormous quantities of marine wildlife die from ingesting plastic waste yearly. <span class='causal'>Thus</span>, vital ocean and river ecosystems suffer devastating harm.</p><p><span class='discourse'>Fortunately</span>, clean energy technology presents a viable solution to pollution crises. <span class='causal'>This is because</span> renewable sources like wind and solar generate power without creating pollution. <span class='discourse'>As an example</span>, countries embracing renewable energy experience measurable air quality gains. <span class='discourse'>Were these technologies adopted</span> on a global scale, pollution could be reduced significantly.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>from my perspective</span>, pollution challenges are solvable with serious commitment. <span class='discourse'>On balance</span>, implementing eco-friendly transport, tougher regulations and renewable power will safeguard the environment.</p>"
  }
},
{
  "id": "technology-social-interaction",
  "title": "Technology & Social Interaction",
  "topic": "Technology",
  "essayType": "For & Against",
  "question": "Is technology making us less sociable?",
  "writingPoints": ["online vs face-to-face communication", "social media effects", "long-distance relationships (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>It is common knowledge that</span> technology has transformed modern communication completely. <span class='discourse'>There is growing recognition that</span> digital communication has both positive and negative effects on social interaction. <span class='discourse'>Therefore, it is essential to analyse</span> the arguments on both sides.</p><p><span class='opinion'>The main advantage of</span> technology is connecting people instantly across vast distances. <span class='causal'>This is because</span> social media platforms allow communication with anyone worldwide. <span class='discourse'>For example</span>, families can video call relatives abroad daily and share special moments. <span class='causal'>As a result</span>, maintaining relationships across distances becomes much easier.</p><p><span class='opinion'>While there are many advantages</span>, technology can reduce meaningful face-to-face interaction. <span class='opinion'>The key disadvantage of</span> smartphones is that people often stare at screens instead of talking. <span class='discourse'>For instance</span>, families frequently sit together in restaurants without actually conversing. <span class='causal'>Consequently</span>, genuine social skills may decline over time.</p><p><span class='discourse'>Nevertheless</span>, technology greatly benefits long-distance relationships and friendships. <span class='causal'>This is because</span> couples and friends separated by distance can stay intimately connected through regular video calls and messaging. <span class='discourse'>For example</span>, this maintains bonds that letters never could achieve.</p><p><span class='discourse'>In conclusion</span>, technology has both significant benefits and drawbacks. <span class='discourse'>On balance</span>, it enhances communication when used responsibly alongside real-world interaction.</p>",
    
    "alternative1": "<p><span class='discourse'>It is widely recognised that</span> technology has revolutionized how people communicate today. <span class='discourse'>Nowadays</span>, considerable debate exists about whether digital tools improve or harm our social lives. <span class='discourse'>Hence, it is important to examine</span> both perspectives carefully.</p><p><span class='opinion'>One key benefit of</span> modern technology is its ability to connect people regardless of location. <span class='causal'>This is because</span> messaging apps and social networks enable instant global communication. <span class='discourse'>To illustrate</span>, families living on different continents can video chat regularly and remain closely involved in each other's lives. <span class='causal'>Consequently</span>, geographical separation no longer prevents close relationships.</p><p><span class='opinion'>Despite these benefits</span>, digital devices can damage face-to-face social connections. <span class='opinion'>A major drawback of</span> constant phone use is that people ignore those physically present around them. <span class='discourse'>As an example</span>, dinner companions often check their phones rather than engaging in conversation. <span class='causal'>As a result</span>, real interpersonal skills may gradually weaken.</p><p><span class='discourse'>However</span>, technology provides crucial support for long-distance relationships. <span class='causal'>This is because</span> separated couples and friends can maintain daily contact through calls and messages. <span class='discourse'>For instance</span>, this creates emotional closeness impossible through traditional mail.</p><p><span class='discourse'>To sum up</span>, technology offers both advantages and disadvantages for socializing. <span class='discourse'>Taking everything into account</span>, balanced technology use alongside in-person interaction produces the best outcomes.</p>",
    
    "alternative2": "<p><span class='discourse'>Few people would deny that</span> technology has fundamentally changed human communication patterns. <span class='discourse'>Recently</span>, many people question whether digital communication strengthens or weakens our social bonds. <span class='discourse'>Therefore, it is vital to consider</span> arguments supporting both viewpoints.</p><p><span class='opinion'>The primary advantage of</span> communication technology is enabling instant worldwide connections. <span class='causal'>This is because</span> digital platforms facilitate real-time communication across any distance. <span class='discourse'>For example</span>, people can easily video call family members living in different countries and participate in important events virtually. <span class='causal'>Therefore</span>, technology removes traditional barriers created by geographical separation.</p><p><span class='opinion'>Although technology has benefits</span>, excessive screen time undermines face-to-face social interaction. <span class='opinion'>The main disadvantage of</span> digital devices is that users often prioritize screens over personal conversations. <span class='discourse'>For instance</span>, groups of friends sitting together frequently focus on their phones rather than each other. <span class='causal'>Thus</span>, essential communication abilities may deteriorate gradually.</p><p><span class='discourse'>On the other hand</span>, technology proves invaluable for maintaining distant relationships. <span class='causal'>This is because</span> modern communication tools allow separated individuals to stay emotionally connected daily. <span class='discourse'>As an example</span>, this enables intimacy levels that older communication methods could never provide.</p><p><span class='discourse'>In conclusion</span>, technology presents both clear advantages and notable disadvantages. <span class='discourse'>On balance</span>, combining digital convenience with regular face-to-face contact creates healthiest social habits.</p>"
  }
},
{
  "id": "gap-year",
  "title": "Gap Year",
  "topic": "Education Planning",
  "essayType": "For & Against",
  "question": "Is taking a gap year before university a good idea?",
  "writingPoints": ["gaining experience", "losing momentum", "financial considerations (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Over the past few years</span>, gap years have become increasingly popular among young people before university. <span class='discourse'>It is widely recognised that</span> taking time off from education can have both positive and negative effects. <span class='discourse'>Hence, it is vital to analyse</span> the advantages and disadvantages carefully.</p><p><span class='opinion'>The main advantage of</span> gap years is gaining valuable life experience and independence. <span class='causal'>This is because</span> travelling and volunteering abroad develop maturity and practical skills. <span class='discourse'>For example</span>, students who work overseas learn to solve problems independently. <span class='causal'>As a result</span>, they often perform better when they return to education.</p><p><span class='opinion'>While there are many advantages</span>, gap years also present significant challenges. <span class='opinion'>The key disadvantage of</span> taking time off is potentially losing academic momentum and motivation. <span class='causal'>A major drawback is that</span> study habits can deteriorate considerably after a year away. <span class='causal'>Consequently</span>, some students struggle to return to education.</p><p><span class='discourse'>Furthermore</span>, financial considerations are extremely significant for many families. <span class='causal'>This is because</span> travelling and accommodation require substantial savings. <span class='discourse'>For instance</span>, expenses can reach thousands of pounds. <span class='opinion'>However</span>, working during a gap year can help fund university studies later.</p><p><span class='discourse'>In conclusion</span>, gap years have both benefits and drawbacks. <span class='discourse'>On balance</span>, they benefit motivated students who plan carefully and remain committed.</p>",
    
    "alternative1": "<p><span class='discourse'>In recent times</span>, taking a gap year has grown considerably in popularity before starting university. <span class='discourse'>Few people would deny that</span> pausing education temporarily creates both opportunities and risks. <span class='discourse'>Therefore, it is important to examine</span> the benefits and drawbacks of this choice.</p><p><span class='opinion'>One key benefit of</span> gap years is developing valuable real-world experience and self-reliance. <span class='causal'>This is because</span> working or travelling abroad helps young people mature and gain practical abilities. <span class='discourse'>To illustrate</span>, students living independently overseas become better problem-solvers. <span class='causal'>Consequently</span>, many demonstrate improved academic performance after their gap year.</p><p><span class='opinion'>Despite these benefits</span>, gap years carry notable risks too. <span class='opinion'>A major drawback of</span> interrupting studies is the possible loss of educational focus and drive. <span class='causal'>One serious concern is that</span> academic skills and routines can decline significantly during extended breaks. <span class='causal'>As a result</span>, returning to formal study proves challenging for certain students.</p><p><span class='discourse'>Moreover</span>, money matters represent important factors in gap year decisions. <span class='causal'>This is because</span> travel costs and living expenses demand considerable financial resources. <span class='discourse'>As an example</span>, total costs frequently exceed several thousand pounds. <span class='opinion'>That said</span>, earning money throughout the gap year can contribute toward future university costs.</p><p><span class='discourse'>To sum up</span>, gap years offer both advantages and disadvantages. <span class='discourse'>Taking everything into account</span>, they suit well-organized students with clear goals and strong determination.</p>",
    
    "alternative2": "<p><span class='discourse'>Nowadays</span>, many school leavers choose to take gap years before beginning university courses. <span class='discourse'>It is common knowledge that</span> delaying higher education presents both positive and negative aspects. <span class='discourse'>Hence, it is essential to consider</span> what gap years offer and what challenges they pose.</p><p><span class='opinion'>The primary advantage of</span> taking a gap year is acquiring meaningful experience and personal independence. <span class='causal'>This is because</span> travelling, volunteering or working abroad builds character and useful capabilities. <span class='discourse'>For example</span>, young people managing life in foreign countries develop excellent self-sufficiency. <span class='causal'>Therefore</span>, they frequently excel academically upon resuming their education.</p><p><span class='opinion'>Although gap years have benefits</span>, they also involve considerable risks. <span class='opinion'>The main disadvantage of</span> postponing university is potentially weakening academic commitment and enthusiasm. <span class='causal'>A significant problem is that</span> learning habits and knowledge can fade substantially after prolonged absences. <span class='causal'>Thus</span>, some individuals find restarting formal education extremely difficult.</p><p><span class='discourse'>Additionally</span>, financial issues play crucial roles in gap year planning. <span class='causal'>This is because</span> international travel and living abroad demand significant funds. <span class='discourse'>For instance</span>, overall expenses often total many thousands of pounds. <span class='opinion'>Nevertheless</span>, gap year employment can generate savings for later educational expenses.</p><p><span class='discourse'>In conclusion</span>, gap years present both clear benefits and challenges. <span class='discourse'>On balance</span>, they work best for disciplined students who maintain focus and plan thoroughly.</p>"
  }
},
   {
  "id": "online-shopping",
  "title": "Online Shopping",
  "topic": "Consumerism & Technology",
  "essayType": "For & Against",
  "question": "Is online shopping better than shopping in traditional stores?",
  "writingPoints": ["convenience", "impact on local businesses", "trying products before buying (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent times</span>, online shopping has grown enormously in popularity worldwide. <span class='discourse'>There is growing recognition that</span> it has both positive and negative effects on consumers and communities. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of buying products online.</p><p><span class='opinion'>The main advantage of</span> online shopping is its unmatched convenience and accessibility. <span class='causal'>This is because</span> customers can browse and purchase products anytime from home. <span class='discourse'>For example</span>, busy professionals can order items late at night after work. <span class='causal'>As a result</span>, shopping becomes far more efficient. <span class='discourse'>Furthermore</span>, online prices are often considerably lower.</p><p><span class='opinion'>While there are many advantages</span>, online shopping seriously harms local businesses. <span class='opinion'>The key disadvantage</span> is that independent shops lose customers to large online retailers. <span class='causal'>A major drawback is that</span> many high street stores have been forced to close permanently. <span class='causal'>Consequently</span>, communities lose their unique character and local services.</p><p><span class='discourse'>Moreover</span>, customers cannot try products before buying them online. <span class='discourse'>For instance</span>, clothes often fit differently than expected from photographs. <span class='causal'>As a result</span>, returns cause considerable inconvenience and frustration for shoppers.</p><p><span class='discourse'>In conclusion</span>, both shopping methods have clear advantages. <span class='discourse'>On balance</span>, combining online convenience with supporting local shops would be ideal.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, internet shopping has become extremely widespread across the globe. <span class='discourse'>It is widely recognised that</span> purchasing online creates both benefits and problems for shoppers and society. <span class='discourse'>Hence, it is important to examine</span> the advantages and disadvantages of digital shopping.</p><p><span class='opinion'>One key benefit of</span> buying online is extraordinary convenience and ease of access. <span class='causal'>This is because</span> people can shop whenever suits them without leaving their homes. <span class='discourse'>To illustrate</span>, working people can browse and buy items during evenings or weekends. <span class='causal'>Consequently</span>, shopping requires much less time and effort. <span class='discourse'>Additionally</span>, internet retailers frequently offer cheaper prices than physical stores.</p><p><span class='opinion'>Despite these benefits</span>, online shopping damages traditional local retailers significantly. <span class='opinion'>A major drawback of</span> internet commerce is that small independent stores cannot compete with giant online companies. <span class='causal'>One serious concern is that</span> countless town center shops have closed down completely. <span class='causal'>As a result</span>, neighborhoods lose distinctive shops and valuable community spaces.</p><p><span class='discourse'>What is more</span>, shoppers cannot examine or test products physically before purchase. <span class='discourse'>As an example</span>, clothing items frequently look different or fit poorly compared to online images. <span class='causal'>Therefore</span>, returning unsuitable goods creates significant hassle and disappointment.</p><p><span class='discourse'>To sum up</span>, online and traditional shopping both offer distinct advantages. <span class='discourse'>Taking everything into account</span>, using internet shopping while also supporting local businesses represents the best approach.</p>",
    
    "alternative2": "<p><span class='discourse'>Over recent years</span>, purchasing goods online has expanded dramatically worldwide. <span class='discourse'>Few people would deny that</span> digital commerce brings both positive and negative consequences for individuals and communities. <span class='discourse'>Therefore, it is essential to analyse</span> what online shopping offers and what problems it creates.</p><p><span class='opinion'>The primary advantage of</span> internet shopping is remarkable convenience and availability. <span class='causal'>This is because</span> consumers can view and buy products at any hour from anywhere. <span class='discourse'>For example</span>, people with demanding jobs can complete purchases during late evenings. <span class='causal'>Thus</span>, shopping becomes dramatically more time-efficient. <span class='discourse'>Moreover</span>, online platforms typically provide lower prices than conventional shops.</p><p><span class='opinion'>Although online shopping has benefits</span>, it causes severe damage to neighborhood businesses. <span class='opinion'>The main disadvantage of</span> digital retail is that local independent stores cannot survive against massive online corporations. <span class='causal'>A critical problem is that</span> numerous traditional high street shops have shut down for good. <span class='causal'>Consequently</span>, towns and villages lose their special atmosphere and local amenities.</p><p><span class='discourse'>In addition</span>, online shoppers cannot physically handle products before purchasing. <span class='discourse'>For instance</span>, garments often appear different or fit incorrectly compared to website pictures. <span class='causal'>As a consequence</span>, sending back unwanted items proves extremely inconvenient.</p><p><span class='discourse'>In conclusion</span>, both shopping approaches present notable advantages. <span class='discourse'>On balance</span>, balancing online convenience with patronizing local stores offers the optimal solution.</p>"
  }
},
  {
  "id": "childhood-obesity",
  "title": "Childhood Obesity",
  "topic": "Health Crisis",
  "essayType": "Problem-Solution",
  "question": "What can be done to reduce childhood obesity?",
  "writingPoints": ["unhealthy eating", "lack of exercise", "school education (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>These days</span>, childhood obesity has become an increasingly serious problem in many countries. <span class='discourse'>It is widely recognised that</span> this crisis affects children's health and future wellbeing significantly. <span class='discourse'>Therefore, it is vital to identify</span> the main problems and discuss effective solutions.</p><p><span class='discourse'>Firstly</span>, unhealthy eating habits are a major cause of childhood obesity. <span class='causal'>This is because</span> many children consume excessive amounts of sugary snacks and fast food daily. <span class='discourse'>For example</span>, many eat crisps and burgers regularly instead of nutritious meals. <span class='causal'>As a result</span>, they consume far more calories than their bodies actually need.</p><p><span class='discourse'>Secondly</span>, lack of physical exercise contributes significantly to rising obesity rates. <span class='causal'>This is because</span> children spend hours on screens instead of playing outdoors actively. <span class='discourse'>For instance</span>, many prefer video games to sports or cycling. <span class='causal'>Consequently</span>, fitness levels have declined sharply among young people.</p><p><span class='discourse'>However</span>, school education offers an effective solution to address this crisis. <span class='causal'>This is because</span> schools can teach nutrition and provide healthy meals in canteens. <span class='discourse'>For example</span>, banning vending machines and increasing PE lessons would help considerably. <span class='discourse'>By taking these steps</span>, schools could reduce obesity.</p><p><span class='discourse'>In conclusion</span>, childhood obesity can be addressed through determined action. <span class='discourse'>Overall</span>, combining healthier diets, more exercise and school programmes will protect children's health.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, childhood obesity represents a growing health crisis in numerous nations. <span class='discourse'>Few people would deny that</span> this epidemic threatens children's current and future health seriously. <span class='discourse'>Hence, it is important to examine</span> key causes and explore practical solutions.</p><p><span class='discourse'>One major problem is that</span> poor dietary habits drive childhood obesity rates upward. <span class='causal'>This happens because</span> countless children eat too much junk food, sweets and fizzy drinks every day. <span class='discourse'>To illustrate</span>, many regularly choose unhealthy snacks over proper balanced meals. <span class='causal'>Consequently</span>, their calorie intake greatly exceeds healthy requirements.</p><p><span class='discourse'>Another serious issue is that</span> insufficient physical activity contributes heavily to weight problems. <span class='causal'>This occurs because</span> young people spend excessive time using devices rather than exercising outdoors. <span class='discourse'>As an example</span>, most would rather play computer games than participate in sports. <span class='causal'>As a result</span>, physical fitness among children has deteriorated dramatically.</p><p><span class='discourse'>Fortunately</span>, educational programmes in schools provide a powerful solution. <span class='causal'>This is because</span> schools can educate students about healthy eating and offer nutritious lunch options. <span class='discourse'>For instance</span>, removing unhealthy vending machines and expanding physical education would make real differences. <span class='discourse'>Should schools implement</span> these measures, obesity rates would decrease.</p><p><span class='discourse'>To sum up</span>, childhood obesity problems can be solved with serious effort. <span class='discourse'>Taking everything into account</span>, improved nutrition, increased activity and school initiatives will safeguard young people's health.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent years</span>, obesity among children has emerged as a critical health challenge worldwide. <span class='discourse'>It is common knowledge that</span> this growing problem damages children's physical and mental health substantially. <span class='discourse'>Therefore, it is essential to analyse</span> major contributing factors and consider effective remedies.</p><p><span class='discourse'>To begin with</span>, poor nutrition represents a primary cause of childhood obesity. <span class='causal'>This is because</span> numerous young people regularly consume unhealthy foods high in sugar and fat. <span class='discourse'>For example</span>, children frequently eat fast food and sweets rather than vegetables and fruit. <span class='causal'>Therefore</span>, they take in excessive calories that lead to weight gain.</p><p><span class='discourse'>Additionally</span>, inadequate exercise levels contribute significantly to the obesity epidemic. <span class='causal'>This problem exists because</span> modern children dedicate far too much time to screens instead of physical activities. <span class='discourse'>For instance</span>, television and gaming replace outdoor play and organized sports. <span class='causal'>Thus</span>, children's physical condition has worsened considerably.</p><p><span class='discourse'>Nevertheless</span>, school-based interventions offer realistic solutions to this crisis. <span class='causal'>This is because</span> educational institutions can teach proper nutrition and supply wholesome food choices. <span class='discourse'>As an example</span>, eliminating junk food sales and requiring daily PE classes would produce significant improvements. <span class='discourse'>Were these policies adopted</span> widely, childhood obesity would decline.</p><p><span class='discourse'>In conclusion</span>, childhood obesity can be tackled successfully through committed action. <span class='discourse'>On balance</span>, better eating habits, regular physical activity and comprehensive school programs will protect children's wellbeing.</p>"
  }
},
   {
  "id": "social-media-addiction",
  "title": "Social Media Addiction",
  "topic": "Technology Impact",
  "essayType": "Cause & Effect",
  "question": "What are the causes and effects of social media addiction?",
  "writingPoints": ["constant notifications", "social comparison", "mental health (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent years</span>, social media addiction has become a significant concern among young people. <span class='discourse'>It is widely acknowledged that</span> excessive use has led to serious consequences for mental health. <span class='discourse'>Hence, it is vital to examine</span> the main causes and their resulting effects.</p><p><span class='opinion'>One of the main causes</span> of addiction is constant notifications from social media apps. <span class='causal'>This is because</span> platforms are deliberately designed to send endless alerts about likes and messages. <span class='discourse'>For example</span>, each notification triggers dopamine release in the brain. <span class='causal'>As a result</span>, users feel compelled to check their phones compulsively throughout the day.</p><p><span class='opinion'>Another important cause</span> is social comparison with others online. <span class='causal'>This happens because</span> people constantly see idealised images of others' seemingly perfect lives. <span class='discourse'>For instance</span>, teenagers compare themselves to influencers and celebrities. <span class='causal'>Consequently</span>, feelings of inadequacy and low self-esteem develop rapidly.</p><p><span class='discourse'>The effects on</span> mental health are particularly serious and widespread. <span class='causal'>As a consequence</span>, many young people experience anxiety, depression and loneliness. <span class='discourse'>For example</span>, constant comparison significantly damages self-confidence. <span class='discourse'>Furthermore</span>, addiction affects sleep quality and academic performance negatively.</p><p><span class='discourse'>To sum up</span>, social media addiction causes serious problems for individuals. <span class='discourse'>Overall</span>, understanding these causes is essential for addressing this growing issue effectively.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, addiction to social media has emerged as a major problem affecting young people worldwide. <span class='discourse'>Few people would deny that</span> overuse creates significant mental health challenges. <span class='discourse'>Therefore, it is important to identify</span> key causes and examine the resulting consequences.</p><p><span class='discourse'>The main cause of</span> this addiction is the continuous stream of notifications from apps. <span class='causal'>This occurs because</span> social media companies intentionally create systems that send constant alerts and updates. <span class='discourse'>To illustrate</span>, every like, comment or message activates reward centers in our brains. <span class='causal'>Consequently</span>, people develop addictive checking behaviors throughout every day.</p><p><span class='discourse'>A further significant cause is</span> comparing ourselves unfavorably to others on social platforms. <span class='causal'>This stems from</span> being constantly exposed to carefully edited highlights of other people's lives. <span class='discourse'>As an example</span>, young people measure themselves against unrealistic celebrity and influencer standards. <span class='causal'>As a result</span>, self-doubt and poor body image spread quickly.</p><p><span class='discourse'>One major effect of</span> social media addiction is deteriorating mental wellbeing. <span class='causal'>This leads to</span> widespread problems including depression, anxiety and social isolation among users. <span class='discourse'>For instance</span>, endless comparisons seriously undermine confidence and happiness. <span class='discourse'>Moreover</span>, addictive use disrupts sleep patterns and harms school performance.</p><p><span class='discourse'>In conclusion</span>, social media addiction generates substantial individual harm. <span class='discourse'>Taking everything into account</span>, recognizing these causes helps develop solutions to this serious problem.</p>",
    
    "alternative2": "<p><span class='discourse'>Over recent years</span>, social media addiction has grown into a critical issue particularly among teenagers. <span class='discourse'>It is common knowledge that</span> excessive social media use produces severe mental health impacts. <span class='discourse'>Hence, it is essential to explore</span> underlying causes and analyze their effects.</p><p><span class='discourse'>A primary cause of</span> addiction involves the relentless notifications that platforms generate. <span class='causal'>This is rooted in</span> deliberate app design that creates constant interruptions through alerts and messages. <span class='discourse'>For example</span>, each notification produces pleasure chemicals in the brain. <span class='causal'>Therefore</span>, users become trapped in compulsive phone-checking cycles.</p><p><span class='discourse'>Another key cause is</span> unhealthy social comparison with online content. <span class='causal'>This happens because</span> users face continuous exposure to glamorized, filtered versions of others' lives. <span class='discourse'>For instance</span>, adolescents judge themselves against impossible influencer beauty standards. <span class='causal'>Thus</span>, insecurity and damaged self-worth develop extensively.</p><p><span class='discourse'>The main effect of</span> addiction is severely compromised mental health. <span class='causal'>This results in</span> rising rates of depression, anxiety disorders and loneliness among heavy users. <span class='discourse'>As an example</span>, constant negative comparisons destroy self-esteem progressively. <span class='discourse'>Additionally</span>, addiction creates poor sleep and declining academic achievement.</p><p><span class='discourse'>In conclusion</span>, social media addiction produces damaging consequences for young people. <span class='discourse'>On balance</span>, understanding root causes provides crucial insights for tackling this escalating concern.</p>"
  }
},
   {
  "id": "family-size",
  "title": "Family Size",
  "topic": "Family and Society",
  "essayType": "For & Against",
  "question": "Is it better to be part of a large family or a small family?",
  "writingPoints": ["cost", "learning from others", "attention and care (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Few people would deny that</span> family structure significantly affects children's development and wellbeing. <span class='discourse'>There is growing recognition that</span> both large and small families have distinct advantages and disadvantages. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of each.</p><p><span class='opinion'>The main advantage of</span> large families is that children learn valuable social skills from siblings. <span class='causal'>This is because</span> having brothers and sisters teaches sharing, cooperation and patience naturally. <span class='discourse'>For example</span>, older siblings often help and guide younger ones. <span class='causal'>As a result</span>, children become less selfish and more sociable throughout life.</p><p><span class='opinion'>While there are many advantages to</span> large families, they face considerably higher costs. <span class='opinion'>The key disadvantage</span> is that parents must share limited financial resources among more children. <span class='causal'>A major drawback is that</span> significant financial pressure affects the entire family's quality of life. <span class='causal'>Consequently</span>, individual opportunities for each child may be limited.</p><p><span class='discourse'>Furthermore</span>, small families can provide more individual attention to each child. <span class='causal'>This is because</span> parents have more time for each child's emotional and educational needs. <span class='discourse'>For instance</span>, children receive more help with homework and personal problems.</p><p><span class='discourse'>In conclusion</span>, both family sizes have significant benefits and challenges. <span class='discourse'>On balance</span>, the best size depends on each family's particular circumstances and values.</p>",
    
    "alternative1": "<p><span class='discourse'>It is widely recognised that</span> family size plays an important role in children's upbringing and happiness. <span class='discourse'>Nowadays</span>, considerable debate exists about whether large or small families are preferable. <span class='discourse'>Hence, it is important to examine</span> the advantages and disadvantages of different family sizes.</p><p><span class='opinion'>One key benefit of</span> larger families is that children develop excellent social abilities through sibling relationships. <span class='causal'>This is because</span> growing up with brothers and sisters naturally teaches sharing, teamwork and compromise. <span class='discourse'>To illustrate</span>, older children frequently mentor and support their younger siblings. <span class='causal'>Consequently</span>, they grow into less self-centered and more socially skilled individuals.</p><p><span class='opinion'>Despite these benefits</span>, large families encounter much greater financial challenges. <span class='opinion'>A major drawback of</span> having many children is that family income must stretch across more people. <span class='causal'>One serious concern is that</span> economic strain can reduce living standards for everyone. <span class='causal'>As a result</span>, each child may receive fewer educational and recreational opportunities.</p><p><span class='discourse'>Moreover</span>, smaller families allow parents to focus more closely on individual children. <span class='causal'>This is because</span> fewer children means more available time for each child's specific needs. <span class='discourse'>As an example</span>, parents can provide more homework assistance and emotional support.</p><p><span class='discourse'>To sum up</span>, both large and small families offer important advantages. <span class='discourse'>Taking everything into account</span>, the ideal size varies based on individual family situations and priorities.</p>",
    
    "alternative2": "<p><span class='discourse'>It is common knowledge that</span> family size considerably influences how children grow and develop. <span class='discourse'>Recently</span>, many people have debated which family size benefits children most. <span class='discourse'>Therefore, it is essential to consider</span> what each family structure offers.</p><p><span class='opinion'>The primary advantage of</span> having numerous siblings is learning crucial interpersonal skills. <span class='causal'>This is because</span> living with brothers and sisters provides constant practice in cooperation, sharing and empathy. <span class='discourse'>For example</span>, eldest children commonly teach and care for younger family members. <span class='causal'>Therefore</span>, children develop into more considerate and socially competent people.</p><p><span class='opinion'>Although large families have benefits</span>, they also experience substantial financial difficulties. <span class='opinion'>The main disadvantage of</span> numerous children is that money and resources become stretched thin. <span class='causal'>A critical problem is that</span> financial stress can compromise everyone's standard of living. <span class='causal'>Thus</span>, children might miss out on valuable experiences and advantages.</p><p><span class='discourse'>In addition</span>, smaller families enable greater parental attention for each child. <span class='causal'>This is because</span> with fewer children, parents possess more time to dedicate individually. <span class='discourse'>For instance</span>, each child benefits from increased help with schoolwork and personal challenges.</p><p><span class='discourse'>In conclusion</span>, different family sizes present unique benefits and difficulties. <span class='discourse'>On balance</span>, the optimal choice depends entirely on specific family circumstances and personal values.</p>"
  }
},
     {
  "id": "work-from-home",
  "title": "Working From Home",
  "topic": "Work Culture",
  "essayType": "Agree & Disagree",
  "question": "Do you agree that working from home is better than working in an office?",
  "writingPoints": ["time saving", "comfort", "social interaction (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Nowadays</span>, working from home has become increasingly common in many professions. <span class='discourse'>There is considerable debate about</span> whether remote work is actually better than traditional office work. <span class='discourse'>Therefore, it is important to examine</span> arguments on both sides of this discussion.</p><p><span class='opinion'>One strong argument in favour of</span> remote work is saving valuable commuting time. <span class='causal'>This is because</span> travelling to offices is eliminated entirely when working from home. <span class='discourse'>For example</span>, workers can save up to two hours daily that would otherwise be wasted. <span class='causal'>As a result</span>, they experience significantly less stress and physical fatigue.</p><p><span class='discourse'>Furthermore</span>, working from home offers much greater comfort and flexibility. <span class='causal'>This is because</span> people can create personalised workspaces that suit their individual preferences. <span class='discourse'>For instance</span>, employees can control temperature, lighting and noise levels. <span class='causal'>Consequently</span>, productivity and job satisfaction often improve considerably.</p><p><span class='discourse'>On the other hand</span>, remote work significantly reduces social interaction with colleagues. <span class='opinion'>Critics argue that</span> isolation can damage both wellbeing and effective teamwork. <span class='discourse'>For example</span>, office workers build friendships and collaborate more easily face-to-face.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I believe</span> working from home offers significant advantages overall. <span class='discourse'>On balance</span>, the benefits outweigh drawbacks when social needs are properly addressed.</p>",
    
    "alternative1": "<p><span class='discourse'>In recent times</span>, remote working has grown dramatically across numerous industries. <span class='discourse'>It is widely recognised that</span> considerable discussion exists about whether home working surpasses office-based employment. <span class='discourse'>Hence, it is essential to consider</span> perspectives supporting and opposing this arrangement.</p><p><span class='opinion'>I agree that</span> avoiding daily commutes represents a major benefit of remote work. <span class='causal'>This is because</span> workers no longer waste time travelling to and from offices. <span class='discourse'>To illustrate</span>, many people reclaim two or more hours previously spent commuting. <span class='causal'>Consequently</span>, stress levels decrease substantially and energy improves.</p><p><span class='discourse'>Moreover</span>, home working provides exceptional comfort and personal control. <span class='causal'>This is because</span> individuals can design ideal working environments matching their specific needs. <span class='discourse'>As an example</span>, remote workers adjust their surroundings for optimal comfort and focus. <span class='causal'>As a result</span>, work quality and satisfaction typically increase noticeably.</p><p><span class='discourse'>However</span>, working remotely limits valuable social contact with coworkers significantly. <span class='opinion'>Opponents claim that</span> loneliness harms mental health and makes collaboration harder. <span class='discourse'>For instance</span>, office environments naturally encourage relationship building and teamwork.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I would argue</span> remote working provides clear overall benefits. <span class='discourse'>Taking everything into account</span>, advantages exceed disadvantages provided workers maintain social connections.</p>",
    
    "alternative2": "<p><span class='discourse'>These days</span>, home-based work has become widespread in many professional fields. <span class='discourse'>Few people would deny that</span> substantial debate surrounds whether remote work beats traditional office employment. <span class='discourse'>Therefore, it is vital to analyse</span> both supporting and opposing viewpoints.</p><p><span class='opinion'>I completely agree that</span> eliminating commuting time is a huge advantage. <span class='causal'>This is because</span> home workers avoid lengthy daily journeys to workplaces. <span class='discourse'>For example</span>, employees often save multiple hours each day previously lost to travel. <span class='causal'>Therefore</span>, they feel less exhausted and more energized.</p><p><span class='discourse'>Additionally</span>, remote work delivers superior comfort and environmental control. <span class='causal'>This is because</span> workers customize their spaces exactly as they prefer. <span class='discourse'>For instance</span>, people regulate temperature, sound and lighting perfectly. <span class='causal'>Thus</span>, efficiency and workplace happiness generally improve markedly.</p><p><span class='discourse'>Conversely</span>, home working severely reduces interaction with colleagues. <span class='opinion'>Critics maintain that</span> social isolation damages psychological wellbeing and team effectiveness. <span class='discourse'>As an example</span>, traditional offices promote natural friendship development and cooperative work.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I am convinced that</span> working from home offers substantial overall advantages. <span class='discourse'>On balance</span>, benefits outweigh limitations when people actively maintain social engagement.</p>"
  }
},
    {
  "id": "fashion-industry",
  "title": "Fashion Industry",
  "topic": "Fashion",
  "essayType": "Opinion",
  "question": "Does the fashion industry have a bad effect on people's lives?",
  "writingPoints": ["appearance pressure", "price of clothes", "environmental impact (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>The fashion industry</span> has a significant and growing influence on modern society. <span class='discourse'>Because of this</span>, there is considerable debate about whether its effects are positive or negative. <span class='opinion'>I firmly believe</span> the fashion industry creates several serious problems for people.</p><p><span class='discourse'>To begin with</span>, pressure to look fashionable damages people's confidence and self-image. <span class='causal'>This is because</span> advertisements constantly promote unrealistic beauty standards. <span class='discourse'>For example</span>, many teenagers feel inadequate trying desperately to follow the latest trends. <span class='causal'>As a result</span>, self-esteem and body image suffer considerably among young people.</p><p><span class='discourse'>Furthermore</span>, fashionable clothing is often extremely expensive for ordinary families. <span class='causal'>This is because</span> designer brands charge premium prices for trendy items each season. <span class='discourse'>For instance</span>, families feel pressured to buy expensive branded products unnecessarily. <span class='causal'>Consequently</span>, this creates unnecessary financial stress and debt.</p><p><span class='discourse'>Moreover</span>, fast fashion damages the environment very significantly. <span class='causal'>This is because</span> cheap, disposable clothing creates enormous amounts of waste globally. <span class='discourse'>For example</span>, millions of tonnes of unwanted clothes end up in landfills annually. <span class='causal'>Therefore</span>, the environmental cost is absolutely devastating for our planet.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> the fashion industry has damaging negative effects. <span class='discourse'>Overall</span>, it creates pressure, encourages overspending and harms the environment badly.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, the fashion industry exerts massive influence over contemporary culture. <span class='discourse'>Because of this widespread impact</span>, many debate whether fashion benefits or harms society. <span class='opinion'>From my perspective</span>, the fashion industry produces predominantly negative consequences.</p><p><span class='discourse'>Firstly</span>, fashion marketing creates harmful pressure about physical appearance. <span class='causal'>This happens because</span> fashion advertising relentlessly pushes impossible beauty ideals. <span class='discourse'>To illustrate</span>, countless young people develop insecurity while chasing constantly changing trends. <span class='causal'>Consequently</span>, confidence and positive body image decline dramatically, especially among teenagers.</p><p><span class='discourse'>Secondly</span>, trendy fashion items carry excessively high price tags for most people. <span class='causal'>This is because</span> popular brands demand huge amounts for clothing that quickly goes out of style. <span class='discourse'>As an example</span>, ordinary families experience pressure purchasing overpriced designer items. <span class='causal'>As a result</span>, many accumulate worrying debts and financial strain.</p><p><span class='discourse'>What is more</span>, fast fashion production causes severe environmental destruction. <span class='causal'>This occurs because</span> throwaway clothing generates massive quantities of pollution and waste worldwide. <span class='discourse'>For instance</span>, countless tons of discarded garments pollute landfills every year. <span class='causal'>Thus</span>, fashion's environmental impact proves catastrophic for the planet.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I strongly believe</span> fashion causes more harm than good. <span class='discourse'>Taking everything into account</span>, it damages self-esteem, creates financial problems and destroys the environment.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent years</span>, the fashion world has gained tremendous influence over modern life. <span class='discourse'>Given this considerable reach</span>, substantial discussion exists about fashion's overall impact. <span class='opinion'>In my view</span>, the fashion industry generates predominantly harmful effects on society.</p><p><span class='discourse'>To start with</span>, fashion advertising damages how people perceive themselves. <span class='causal'>This is because</span> marketing continuously promotes unattainable appearance standards. <span class='discourse'>For example</span>, numerous adolescents feel worthless while attempting to match unrealistic trends. <span class='causal'>Therefore</span>, self-worth and healthy body image deteriorate significantly among youth.</p><p><span class='discourse'>Additionally</span>, fashionable clothes cost far too much for average households. <span class='causal'>This is because</span> brand-name companies charge enormous prices for items that rapidly become outdated. <span class='discourse'>For instance</span>, families face pressure buying expensive labels that aren't truly necessary. <span class='causal'>Consequently</span>, serious financial difficulties and debt problems develop.</p><p><span class='discourse'>Beyond this</span>, disposable fashion causes terrible environmental harm. <span class='causal'>This is because</span> cheaply made clothing produces extraordinary amounts of global waste. <span class='discourse'>As an example</span>, enormous quantities of unwanted garments pile up in dumps yearly. <span class='causal'>As a result</span>, fashion's environmental damage proves extremely serious for Earth.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I am convinced that</span> fashion's effects are predominantly negative. <span class='discourse'>On balance</span>, it undermines confidence, causes financial hardship and severely damages the environment.</p>"
  }
},
    {
  "id": "learning-languages",
  "title": "Learning Foreign Languages",
  "topic": "Languages",
  "essayType": "Opinion",
  "question": "Are there more reasons to learn a foreign language than just passing a test?",
  "writingPoints": ["pleasure", "personal challenge", "career opportunities (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Learning a foreign language</span> is becoming increasingly important in today's globalised and connected world. <span class='discourse'>Because of this</span>, many people question whether language learning offers benefits beyond passing exams. <span class='opinion'>I firmly believe</span> there are many valuable reasons to learn languages throughout life.</p><p><span class='discourse'>To begin with</span>, learning a language can bring genuine pleasure and enjoyment. <span class='causal'>This is because</span> discovering new words and expressions is intellectually stimulating and exciting. <span class='discourse'>For example</span>, speaking another language while travelling creates wonderful, memorable experiences. <span class='causal'>As a result</span>, language learning becomes personally meaningful and rewarding.</p><p><span class='discourse'>Furthermore</span>, language learning represents a rewarding personal challenge. <span class='causal'>This is because</span> mastering a completely new skill builds confidence and self-esteem significantly. <span class='discourse'>For instance</span>, successfully completing a language course creates genuine pride and achievement. <span class='causal'>Consequently</span>, motivation to continue learning and improving grows naturally.</p><p><span class='discourse'>Moreover</span>, foreign language skills create excellent career opportunities in the modern workplace. <span class='causal'>This is because</span> international companies increasingly need multilingual employees for global business. <span class='discourse'>For example</span>, speaking additional languages often leads to better jobs and higher salaries. <span class='causal'>Therefore</span>, language skills have real, practical professional value.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I strongly believe</span> there are many reasons to learn languages beyond exams. <span class='discourse'>Overall</span>, language learning provides pleasure, personal challenge and career advancement.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, foreign language acquisition has grown tremendously important in our interconnected world. <span class='discourse'>Given this reality</span>, considerable discussion exists about whether languages offer value beyond examination success. <span class='opinion'>From my perspective</span>, numerous compelling reasons exist for learning languages throughout one's lifetime.</p><p><span class='discourse'>Firstly</span>, language study delivers authentic enjoyment and intellectual satisfaction. <span class='causal'>This is because</span> exploring new linguistic systems provides fascinating mental stimulation. <span class='discourse'>To illustrate</span>, using foreign languages during travel produces incredibly enriching experiences. <span class='causal'>Consequently</span>, language learning transforms into something deeply fulfilling and worthwhile.</p><p><span class='discourse'>Secondly</span>, mastering languages presents a meaningful personal achievement. <span class='causal'>This is because</span> developing proficiency in entirely new skills dramatically enhances self-confidence. <span class='discourse'>As an example</span>, reaching fluency generates strong feelings of accomplishment and pride. <span class='causal'>As a result</span>, learners naturally develop greater enthusiasm for continued improvement.</p><p><span class='discourse'>What is more</span>, language abilities unlock valuable professional advantages in today's economy. <span class='causal'>This is because</span> global corporations constantly seek employees who speak multiple languages. <span class='discourse'>For instance</span>, multilingual workers typically secure superior positions with better compensation. <span class='causal'>Thus</span>, language competence offers genuine practical career benefits.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I am convinced</span> many important reasons exist for language learning beyond tests. <span class='discourse'>Taking everything into account</span>, languages bring enjoyment, personal growth and professional opportunities.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent times</span>, studying foreign languages has become increasingly relevant in our globalized society. <span class='discourse'>For this reason</span>, many debate whether language study delivers benefits beyond simply passing examinations. <span class='opinion'>In my view</span>, countless valuable reasons justify lifelong language learning.</p><p><span class='discourse'>To start with</span>, language acquisition provides real pleasure and intellectual engagement. <span class='causal'>This is because</span> learning new vocabulary and grammar structures proves genuinely fascinating. <span class='discourse'>For example</span>, communicating in foreign languages abroad creates extraordinary memorable moments. <span class='causal'>Therefore</span>, language study becomes inherently satisfying and personally enriching.</p><p><span class='discourse'>Additionally</span>, language mastery constitutes a significant personal accomplishment. <span class='causal'>This is because</span> achieving fluency in new languages substantially boosts confidence and self-belief. <span class='discourse'>For instance</span>, completing language qualifications produces authentic feelings of success. <span class='causal'>Consequently</span>, learners develop increased drive for further language development.</p><p><span class='discourse'>Beyond this</span>, language proficiency generates important workplace advantages today. <span class='causal'>This is because</span> modern employers highly value multilingual staff for international operations. <span class='discourse'>As an example</span>, language speakers frequently obtain better employment with improved earnings. <span class='causal'>As a result</span>, language abilities provide tangible professional advantages.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I completely agree</span> numerous reasons support language learning beyond examinations. <span class='discourse'>On balance</span>, language study offers intellectual pleasure, personal achievement and career enhancement.</p>"
  }
},
 {
  "id": "learning-history",
  "title": "Learning History at School",
  "topic": "History",
  "essayType": "Opinion",
  "question": "Should everyone be taught the history of their own country?",
  "writingPoints": ["learning from the past", "future vs past", "national identity (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Learning history</span> is an essential component of education systems worldwide. <span class='discourse'>Because of this</span>, there is considerable debate about whether national history should be compulsory for all students. <span class='opinion'>I firmly believe</span> that everyone should study their own country's history thoroughly.</p><p><span class='discourse'>Firstly</span>, history teaches us invaluable lessons from past events and mistakes. <span class='causal'>This is because</span> understanding previous events helps societies avoid repeating serious errors. <span class='discourse'>For example</span>, learning about past wars teaches younger generations the importance of peace and diplomacy. <span class='causal'>As a result</span>, students become more informed and responsible citizens.</p><p><span class='discourse'>Secondly</span>, focusing only on the future is simply insufficient for understanding the present. <span class='causal'>This is because</span> history provides essential context for interpreting current events and decisions. <span class='discourse'>For instance</span>, political situations become much clearer when historical background is properly understood. <span class='causal'>Consequently</span>, people can make better-informed choices about important issues.</p><p><span class='discourse'>Furthermore</span>, national history strongly strengthens people's sense of identity and belonging. <span class='causal'>This is because</span> understanding our collective past creates meaningful connection to our cultural roots. <span class='discourse'>For example</span>, knowing about significant national events builds genuine community pride and unity.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I strongly believe</span> national history education is essential for everyone. <span class='discourse'>Overall</span>, it provides vital lessons, important context and strengthens national identity.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, history education represents a fundamental part of school curricula globally. <span class='discourse'>Given this importance</span>, considerable discussion exists about whether national history should be mandatory. <span class='opinion'>From my perspective</span>, all students should receive comprehensive instruction in their country's history.</p><p><span class='discourse'>To begin with</span>, studying history prevents societies from repeating dangerous mistakes. <span class='causal'>This is because</span> examining past failures helps us recognize and avoid similar problems today. <span class='discourse'>To illustrate</span>, studying historical conflicts helps young people appreciate diplomacy and peaceful resolution. <span class='causal'>Consequently</span>, educated citizens make wiser, more thoughtful decisions.</p><p><span class='discourse'>Moreover</span>, understanding only future possibilities proves inadequate without historical perspective. <span class='causal'>This is because</span> history supplies crucial context for comprehending contemporary situations. <span class='discourse'>As an example</span>, current political developments make far more sense with proper historical knowledge. <span class='causal'>As a result</span>, informed citizens can evaluate important matters more effectively.</p><p><span class='discourse'>What is more</span>, national history education powerfully reinforces cultural identity and social cohesion. <span class='causal'>This is because</span> learning shared heritage creates strong connections to national culture. <span class='discourse'>For instance</span>, understanding important historical moments fosters genuine pride and unity.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I am convinced</span> teaching national history to everyone is absolutely essential. <span class='discourse'>Taking everything into account</span>, history offers crucial lessons, vital context and strengthens collective identity.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent years</span>, history has remained a core subject in educational systems worldwide. <span class='discourse'>For this reason</span>, many debate whether learning national history should be required for all pupils. <span class='opinion'>In my view</span>, every student should study their nation's history comprehensively.</p><p><span class='discourse'>Firstly</span>, historical education helps humanity avoid repeating catastrophic errors. <span class='causal'>This is because</span> studying what went wrong previously enables us to prevent similar disasters. <span class='discourse'>For example</span>, examining historical wars helps students understand why peace matters so greatly. <span class='causal'>Therefore</span>, historically educated people become thoughtful, responsible members of society.</p><p><span class='discourse'>Additionally</span>, concentrating solely on tomorrow neglects essential understanding of today. <span class='causal'>This is because</span> historical knowledge provides necessary frameworks for interpreting present circumstances. <span class='discourse'>For instance</span>, contemporary politics becomes comprehensible only with historical foundation. <span class='causal'>Thus</span>, knowledgeable citizens form better judgments on significant questions.</p><p><span class='discourse'>Beyond this</span>, studying national history significantly strengthens cultural belonging and identity. <span class='causal'>This is because</span> discovering shared heritage connects people to their cultural traditions. <span class='discourse'>As an example</span>, learning about key national achievements creates authentic pride and solidarity.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I completely agree</span> everyone must learn their country's history. <span class='discourse'>On balance</span>, history education delivers critical lessons, essential perspective and reinforces national belonging.</p>"
  }
},
   {
  "id": "sports-money",
  "title": "Money for Sports People",
  "topic": "Sport and Society",
  "essayType": "Opinion",
  "question": "Are famous sports people paid too much money?",
  "writingPoints": ["the entertainment they provide", "how hard they work", "sponsorship and endorsements (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In modern society</span>, famous athletes earn extraordinarily high salaries exceeding millions annually. <span class='discourse'>Because of this</span>, many people question whether such enormous payments are actually justified. <span class='opinion'>I believe</span> that many professional sports stars are paid excessively.</p><p><span class='discourse'>Firstly</span>, athletes certainly deserve fair payment for the entertainment they provide to millions. <span class='causal'>This is because</span> major sporting events attract enormous global audiences and generate huge revenues. <span class='discourse'>For example</span>, football matches and Olympic events are watched by billions of viewers worldwide. <span class='causal'>As a result</span>, athletes become extremely valuable entertainers in the modern world.</p><p><span class='discourse'>Furthermore</span>, many professional athletes work incredibly hard to achieve excellence. <span class='causal'>This is because</span> they train intensively for many years, often sacrificing normal social lives. <span class='discourse'>For instance</span>, Olympic athletes typically dedicate several hours daily to rigorous preparation. <span class='causal'>Consequently</span>, their dedication and sacrifice certainly deserve recognition and reward.</p><p><span class='discourse'>However</span>, sponsorship and endorsement deals push athlete earnings unreasonably high. <span class='causal'>This is because</span> some stars earn millions simply for appearing in advertisements. <span class='discourse'>For example</span>, certain athletes earn more from endorsements than from actually playing their sport.</p><p><span class='discourse'>In conclusion</span>, athletes work hard and entertain millions of fans genuinely. <span class='opinion'>However</span>, excessive sponsorship earnings show they are often significantly overpaid. <span class='discourse'>Overall</span>, salaries should be more reasonably balanced.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, top professional athletes receive incredibly large salaries worth many millions each year. <span class='discourse'>Given these enormous sums</span>, considerable debate exists about whether such high pay is appropriate. <span class='opinion'>From my perspective</span>, many sports professionals receive excessive compensation.</p><p><span class='discourse'>To begin with</span>, athletes merit reasonable payment for entertaining huge audiences globally. <span class='causal'>This is because</span> major competitions draw massive viewership and create substantial revenue. <span class='discourse'>To illustrate</span>, prestigious sporting events like World Cups attract billions of spectators internationally. <span class='causal'>Consequently</span>, successful athletes function as highly valuable entertainment providers.</p><p><span class='discourse'>Moreover</span>, elite athletes demonstrate exceptional dedication and commitment throughout their careers. <span class='causal'>This is because</span> reaching professional levels requires years of demanding training and personal sacrifice. <span class='discourse'>As an example</span>, top-level competitors train multiple hours every single day. <span class='causal'>As a result</span>, their extraordinary efforts and sacrifices warrant appropriate financial compensation.</p><p><span class='discourse'>Nevertheless</span>, commercial sponsorships inflate athlete income to unreasonable levels. <span class='causal'>This happens because</span> famous athletes receive enormous payments merely for product advertisements. <span class='discourse'>For instance</span>, some sports stars' endorsement income exceeds their actual sporting earnings.</p><p><span class='discourse'>To sum up</span>, while athletes train hard and entertain millions, <span class='opinion'>I would argue</span> sponsorship deals make them overpaid. <span class='discourse'>Taking everything into account</span>, more balanced compensation levels would be fairer.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent years</span>, elite professional athletes command massive salaries often reaching millions yearly. <span class='discourse'>For this reason</span>, many question whether such extraordinary pay levels are truly justified. <span class='opinion'>In my view</span>, numerous sports stars receive disproportionately high compensation.</p><p><span class='discourse'>Firstly</span>, athletes do deserve fair compensation for entertaining vast global audiences. <span class='causal'>This is because</span> premier sporting competitions generate enormous viewing figures and substantial income. <span class='discourse'>For example</span>, international championships like Olympics command billions of worldwide viewers. <span class='causal'>Therefore</span>, successful athletes provide tremendous entertainment value.</p><p><span class='discourse'>Additionally</span>, professional athletes display remarkable dedication and hard work. <span class='causal'>This is because</span> achieving elite status demands decades of intensive training and sacrifice. <span class='discourse'>For instance</span>, professional competitors devote countless hours to demanding physical preparation. <span class='causal'>Thus</span>, their commitment and personal sacrifices merit appropriate recognition.</p><p><span class='discourse'>On the other hand</span>, advertising contracts drive earnings to unjustifiable heights. <span class='causal'>This is because</span> celebrity athletes receive massive sums simply for promoting products. <span class='discourse'>As an example</span>, many earn substantially more from advertisements than from competing.</p><p><span class='discourse'>In conclusion</span>, although athletes train intensely and entertain millions, <span class='opinion'>I am convinced</span> sponsorship income makes them excessively paid. <span class='discourse'>On balance</span>, compensation structures require better balance.</p>"
  }
},
    {
  "id": "self-employment",
  "title": "Self-Employment vs Working for Others",
  "topic": "Work and Lifestyle",
  "essayType": "For & Against",
  "question": "Is it better to be self-employed or to work for somebody else?",
  "writingPoints": ["being independent", "job security", "work-life balance (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent times</span>, self-employment has become an increasingly popular career choice for many people. <span class='discourse'>It is widely recognised that</span> both working independently and for employers have distinct advantages. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of each option carefully.</p><p><span class='opinion'>The main advantage of</span> self-employment is independence and personal freedom. <span class='causal'>This is because</span> people can choose their own working hours, projects and clients freely. <span class='discourse'>For example</span>, freelancers work when they feel most productive and creative. <span class='causal'>As a result</span>, they often feel more motivated and satisfied with their careers.</p><p><span class='opinion'>While there are many advantages</span>, traditional employment offers much greater security. <span class='opinion'>The key disadvantage of</span> self-employment is unpredictable and irregular income throughout the year. <span class='causal'>A major drawback is that</span> freelancers lack guaranteed salaries, paid holidays and employment benefits. <span class='causal'>Consequently</span>, financial planning becomes considerably more difficult and stressful.</p><p><span class='discourse'>Furthermore</span>, work-life balance differs significantly between both working options. <span class='causal'>This is because</span> self-employed people often struggle to separate work time from personal leisure. <span class='discourse'>For instance</span>, they may feel pressured to work constantly without proper breaks or boundaries.</p><p><span class='discourse'>In conclusion</span>, both employment options have significant merits and challenges. <span class='discourse'>On balance</span>, the best choice depends entirely on individual priorities, personality and circumstances.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, self-employment has grown substantially as a viable career path for workers. <span class='discourse'>Few people would deny that</span> both independent work and traditional jobs offer unique benefits. <span class='discourse'>Hence, it is important to examine</span> what each employment type provides.</p><p><span class='opinion'>One key benefit of</span> working independently is complete autonomy and flexibility. <span class='causal'>This is because</span> self-employed individuals control their schedules, choose projects and select clients independently. <span class='discourse'>To illustrate</span>, freelance workers operate during their most productive hours. <span class='causal'>Consequently</span>, job satisfaction and motivation typically increase substantially.</p><p><span class='opinion'>Despite these benefits</span>, regular employment provides superior financial stability. <span class='opinion'>A major drawback of</span> independent work is highly variable and uncertain earnings. <span class='causal'>One serious concern is that</span> freelancers miss out on steady paychecks, holiday pay and workplace benefits. <span class='causal'>As a result</span>, managing finances proves much more challenging and anxiety-inducing.</p><p><span class='discourse'>Moreover</span>, achieving work-life balance varies greatly between these options. <span class='causal'>This is because</span> independent workers frequently find separating professional and personal time extremely difficult. <span class='discourse'>As an example</span>, self-employed individuals often experience pressure working continuously without adequate rest.</p><p><span class='discourse'>To sum up</span>, both employment models present important advantages and disadvantages. <span class='discourse'>Taking everything into account</span>, the optimal choice reflects personal preferences, character and specific situations.</p>",
    
    "alternative2": "<p><span class='discourse'>Over recent years</span>, working for oneself has emerged as an increasingly common career option. <span class='discourse'>It is common knowledge that</span> both self-employment and traditional jobs present distinctive pros and cons. <span class='discourse'>Therefore, it is essential to consider</span> the comparative strengths and weaknesses carefully.</p><p><span class='opinion'>The primary advantage of</span> being self-employed is having complete independence and control. <span class='causal'>This is because</span> independent workers make autonomous decisions about schedules, assignments and clientele. <span class='discourse'>For example</span>, self-employed professionals work during their peak effectiveness periods. <span class='causal'>Therefore</span>, career fulfillment and drive commonly improve dramatically.</p><p><span class='opinion'>Although self-employment has benefits</span>, conventional employment delivers greater financial certainty. <span class='opinion'>The main disadvantage of</span> working independently is inconsistent and unreliable earnings. <span class='causal'>A critical problem is that</span> independent workers forgo reliable income, vacation pay and employee protections. <span class='causal'>Thus</span>, financial management becomes significantly harder and more stressful.</p><p><span class='discourse'>In addition</span>, balancing work and personal life presents different challenges. <span class='causal'>This is because</span> self-employed workers commonly struggle establishing clear boundaries between job and leisure. <span class='discourse'>For instance</span>, independent professionals may feel obligated working non-stop without appropriate rest periods.</p><p><span class='discourse'>In conclusion</span>, both work arrangements offer meaningful benefits and challenges. <span class='discourse'>On balance</span>, the ideal selection depends on individual values, temperament and particular circumstances.</p>"
  }
},
    {
  "id": "advertising-society",
  "title": "Advertising and Society",
  "topic": "Media and Consumerism",
  "essayType": "Opinion",
  "question": "Is advertising a very good thing for society?",
  "writingPoints": ["keeping people informed", "competition between companies", "consumer manipulation (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Advertising is everywhere</span> in modern society, appearing on television, online and in public spaces. <span class='discourse'>Because of this constant presence</span>, there is considerable debate about whether it truly benefits society. <span class='opinion'>I believe</span> that advertising often has more harmful than positive effects overall.</p><p><span class='discourse'>Firstly</span>, advertising does keep consumers informed about available products and services. <span class='causal'>This is because</span> companies use advertisements to communicate new offerings and special deals. <span class='discourse'>For example</span>, customers learn about useful innovations and discounts through advertising campaigns. <span class='causal'>As a result</span>, making informed shopping decisions becomes somewhat easier for consumers.</p><p><span class='discourse'>Furthermore</span>, advertising creates healthy competition between businesses in the marketplace. <span class='causal'>This is because</span> companies must constantly improve quality and service to attract customers effectively. <span class='discourse'>For instance</span>, competing brands often lower prices to win market share. <span class='causal'>Consequently</span>, consumers benefit from better products at competitive prices.</p><p><span class='discourse'>However</span>, advertising frequently manipulates consumers through clever psychological techniques. <span class='causal'>This is because</span> marketing deliberately creates artificial needs and desires in people's minds. <span class='discourse'>For example</span>, people buy unnecessary products due to persuasive and misleading advertisements.</p><p><span class='discourse'>In conclusion</span>, advertising has both positive and negative aspects for society. <span class='opinion'>However</span>, manipulation and overconsumption outweigh the informational benefits significantly. <span class='discourse'>Overall</span>, advertising is not always beneficial for society.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, advertisements surround us constantly throughout daily life. <span class='discourse'>Given this ubiquitous presence</span>, many debate whether advertising truly serves society positively. <span class='opinion'>From my perspective</span>, advertising produces predominantly negative societal consequences.</p><p><span class='discourse'>To begin with</span>, advertising does provide useful information about products and services. <span class='causal'>This is because</span> businesses use ads to announce new products and promotional offers. <span class='discourse'>To illustrate</span>, consumers discover helpful innovations and savings opportunities through advertisements. <span class='causal'>Consequently</span>, shoppers can make slightly better-informed purchasing choices.</p><p><span class='discourse'>Moreover</span>, advertising encourages beneficial competition among companies. <span class='causal'>This is because</span> businesses must continually enhance their offerings to attract buyers. <span class='discourse'>As an example</span>, rival firms frequently reduce prices to capture customers. <span class='causal'>As a result</span>, consumers enjoy improved quality and lower costs.</p><p><span class='discourse'>Nevertheless</span>, advertising employs manipulative tactics that exploit consumers psychologically. <span class='causal'>This happens because</span> marketers intentionally manufacture false needs and wants. <span class='discourse'>For instance</span>, sophisticated advertising convinces people to purchase completely unnecessary items.</p><p><span class='discourse'>To sum up</span>, while advertising offers some benefits, <span class='opinion'>I would argue</span> its manipulative nature causes greater harm. <span class='discourse'>Taking everything into account</span>, advertising's negative impacts exceed its positive contributions.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent times</span>, advertising has become an inescapable feature of contemporary life. <span class='discourse'>For this reason</span>, substantial discussion exists about advertising's overall societal value. <span class='opinion'>In my view</span>, advertising generates more harm than benefit for society.</p><p><span class='discourse'>Firstly</span>, advertising does communicate information about available goods and services. <span class='causal'>This is because</span> companies employ advertising to publicize products and special promotions. <span class='discourse'>For example</span>, people gain awareness of valuable new products and price reductions. <span class='causal'>Therefore</span>, consumers achieve marginally better shopping decisions.</p><p><span class='discourse'>Additionally</span>, advertising stimulates productive business competition. <span class='causal'>This is because</span> firms must continuously upgrade quality and value to win customers. <span class='discourse'>For instance</span>, competing businesses regularly cut prices to increase sales. <span class='causal'>Thus</span>, buyers receive enhanced products at more affordable rates.</p><p><span class='discourse'>On the other hand</span>, advertising relies heavily on psychological manipulation techniques. <span class='causal'>This occurs because</span> advertisers purposefully generate artificial consumer desires. <span class='discourse'>As an example</span>, effective marketing persuades individuals to buy things they genuinely don't need.</p><p><span class='discourse'>In conclusion</span>, despite certain advantages, <span class='opinion'>I am convinced</span> advertising's manipulative practices cause greater societal damage. <span class='discourse'>On balance</span>, advertising's detrimental effects substantially outweigh its informational value.</p>"
  }
},
   {
  "id": "helping-others",
  "title": "Helping Other People",
  "topic": "Society and Responsibility",
  "essayType": "Opinion",
  "question": "Should everyone regularly do something to help other people?",
  "writingPoints": ["importance of friends and family", "giving back to society", "personal development (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>Helping others</span> is fundamental to building strong, supportive communities everywhere. <span class='discourse'>Because of this</span>, many people argue that everyone should contribute regularly to helping others. <span class='opinion'>I firmly believe</span> that helping others should be an important part of everyone's life.</p><p><span class='discourse'>Firstly</span>, helping friends and family significantly strengthens personal relationships. <span class='causal'>This is because</span> supporting others builds trust, respect and deeper emotional connections. <span class='discourse'>For example</span>, helping a friend during difficult times brings people much closer together. <span class='causal'>As a result</span>, relationships become stronger, more reliable and more meaningful.</p><p><span class='discourse'>Furthermore</span>, giving back to society is extremely important for community wellbeing. <span class='causal'>This is because</span> communities function much better when people actively support each other. <span class='discourse'>For instance</span>, volunteering improves local services, facilities and quality of life for everyone. <span class='causal'>Consequently</span>, society becomes stronger, safer and more united.</p><p><span class='discourse'>Moreover</span>, helping others significantly benefits personal development and happiness. <span class='causal'>This is because</span> volunteering builds empathy, confidence and valuable new skills naturally. <span class='discourse'>For example</span>, people who regularly help others often report increased happiness and life satisfaction. <span class='causal'>Therefore</span>, giving benefits both the helper and recipient equally.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I firmly believe</span> everyone should regularly dedicate time to helping others. <span class='discourse'>Overall</span>, it strengthens relationships, improves communities and promotes personal growth.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, helping others represents a cornerstone of thriving communities worldwide. <span class='discourse'>Given this importance</span>, considerable debate exists about whether everyone should regularly assist others. <span class='opinion'>From my perspective</span>, regular helping behavior should be universal practice.</p><p><span class='discourse'>To begin with</span>, assisting friends and relatives greatly enhances interpersonal bonds. <span class='causal'>This is because</span> providing support generates trust, mutual respect and emotional closeness. <span class='discourse'>To illustrate</span>, supporting someone through challenges creates powerful connections. <span class='causal'>Consequently</span>, relationships grow more robust, dependable and significant.</p><p><span class='discourse'>Moreover</span>, contributing to community welfare proves essential for collective health. <span class='causal'>This is because</span> societies thrive when members actively help one another. <span class='discourse'>As an example</span>, volunteer work enhances public services, infrastructure and overall living standards. <span class='causal'>As a result</span>, communities become more cohesive, secure and prosperous.</p><p><span class='discourse'>What is more</span>, helping behaviors deliver substantial personal growth and wellbeing benefits. <span class='causal'>This is because</span> assisting others naturally develops compassion, self-assurance and practical abilities. <span class='discourse'>For instance</span>, regular volunteers frequently experience enhanced happiness and fulfillment. <span class='causal'>Thus</span>, helping creates mutual benefits for everyone involved.</p><p><span class='discourse'>To sum up</span>, <span class='opinion'>I am convinced</span> everyone should make helping others a regular priority. <span class='discourse'>Taking everything into account</span>, it reinforces bonds, strengthens society and fosters individual development.</p>",
    
    "alternative2": "<p><span class='discourse'>In recent years</span>, helping others has remained essential for healthy, functioning communities. <span class='discourse'>For this reason</span>, many question whether regular helping should be everyone's responsibility. <span class='opinion'>In my view</span>, all individuals should consistently engage in helping behaviors.</p><p><span class='discourse'>Firstly</span>, supporting close friends and family members substantially strengthens those relationships. <span class='causal'>This is because</span> offering assistance cultivates trust, appreciation and profound connections. <span class='discourse'>For example</span>, being there for loved ones during hardship creates lasting bonds. <span class='causal'>Therefore</span>, relationships become more solid, trustworthy and deeply meaningful.</p><p><span class='discourse'>Additionally</span>, contributing to broader society proves vital for communal prosperity. <span class='causal'>This is because</span> communities flourish when residents support one another actively. <span class='discourse'>For instance</span>, volunteering enhances shared resources, amenities and everyone's quality of life. <span class='causal'>Consequently</span>, neighborhoods grow more connected, stable and vibrant.</p><p><span class='discourse'>Beyond this</span>, helping activities generate considerable personal benefits and fulfillment. <span class='causal'>This is because</span> assisting others cultivates empathy, confidence and useful capabilities. <span class='discourse'>As an example</span>, consistent helpers commonly report greater life satisfaction and joy. <span class='causal'>As a result</span>, helping enriches both givers and receivers alike.</p><p><span class='discourse'>In conclusion</span>, <span class='opinion'>I completely agree</span> everyone should regularly commit to helping others. <span class='discourse'>On balance</span>, it deepens relationships, builds communities and enhances personal wellbeing.</p>"
  }
},
   {
  "id": "online-learning",
  "title": "Online Learning",
  "topic": "Education Technology",
  "essayType": "For & Against",
  "question": "Is online learning better than traditional classroom learning?",
  "writingPoints": ["flexibility", "interaction", "self-discipline (your own idea)"],
  "styles": {
    "default": "<p><span class='discourse'>In recent times</span>, online learning has become increasingly widespread across all educational levels. <span class='discourse'>It is widely recognised that</span> both online and traditional classroom learning have significant advantages. <span class='discourse'>Therefore, it is vital to analyse</span> the benefits and drawbacks of each approach carefully.</p><p><span class='opinion'>The main advantage of</span> online learning is its exceptional flexibility and accessibility. <span class='causal'>This is because</span> students can study anytime and anywhere with internet access. <span class='discourse'>For example</span>, learners can access recorded lessons at times that suit their personal schedules. <span class='causal'>As a result</span>, education becomes more accessible to people with busy lives.</p><p><span class='opinion'>While there are many advantages</span>, classrooms provide valuable face-to-face interaction. <span class='opinion'>The key disadvantage of</span> online learning is significantly limited social contact with teachers and classmates. <span class='causal'>A major drawback is that</span> students miss real discussions, friendships and immediate feedback. <span class='causal'>Consequently</span>, learning online can feel quite isolating for many students.</p><p><span class='discourse'>Furthermore</span>, online learning requires strong self-discipline and personal motivation. <span class='causal'>This is because</span> students must organise themselves effectively without direct teacher supervision. <span class='discourse'>For instance</span>, many students struggle with procrastination when studying alone at home.</p><p><span class='discourse'>In conclusion</span>, both learning methods have significant advantages and challenges. <span class='discourse'>On balance</span>, combining online flexibility with classroom interaction may prove most effective overall.</p>",
    
    "alternative1": "<p><span class='discourse'>Nowadays</span>, digital education has expanded dramatically across every level of schooling. <span class='discourse'>Few people would deny that</span> both online and classroom-based learning offer distinct benefits. <span class='discourse'>Hence, it is important to examine</span> the strengths and weaknesses of each method.</p><p><span class='opinion'>One key benefit of</span> digital learning is outstanding flexibility and convenience. <span class='causal'>This is because</span> learners can study whenever and wherever suits them best. <span class='discourse'>To illustrate</span>, students access course materials at times matching their individual routines. <span class='causal'>Consequently</span>, education reaches people who face scheduling or location barriers.</p><p><span class='opinion'>Despite these benefits</span>, traditional classrooms deliver important personal interaction. <span class='opinion'>A major drawback of</span> digital education is severely reduced face-to-face contact with instructors and peers. <span class='causal'>One serious concern is that</span> online students lose authentic conversations, social connections and instant guidance. <span class='causal'>As a result</span>, remote learning often creates feelings of loneliness and disconnection.</p><p><span class='discourse'>Moreover</span>, succeeding online demands considerable self-control and drive. <span class='causal'>This is because</span> learners must manage their time and progress independently. <span class='discourse'>As an example</span>, numerous students face procrastination challenges without classroom structure.</p><p><span class='discourse'>To sum up</span>, both educational approaches present important advantages and difficulties. <span class='discourse'>Taking everything into account</span>, blending online convenience with in-person engagement might work best.</p>",
    
 "alternative2": "<p><span class='discourse'>Over recent years</span>, internet-based education has grown substantially throughout all school levels. <span class='discourse'>It is common knowledge that</span> both digital and traditional learning provide unique advantages. <span class='discourse'>Therefore, it is essential to consider</span> what each teaching method offers.</p><p><span class='opinion'>The primary advantage of</span> internet learning is remarkable flexibility and access. <span class='causal'>This is because</span> pupils can engage with lessons at any time from any location. <span class='discourse'>For example</span>, students review recorded content during periods convenient for them. <span class='causal'>Therefore</span>, educational opportunities expand for those with complex schedules.</p><p><span class='opinion'>Although online learning has benefits</span>, physical classrooms enable crucial personal interactions. <span class='opinion'>The main disadvantage of</span> remote education is drastically reduced direct contact with educators and classmates. <span class='causal'>A critical problem is that</span> digital learners forfeit meaningful discussions, peer relationships and immediate instructor feedback. <span class='causal'>Thus</span>, online environments frequently feel isolating and lonely.</p><p><span class='discourse'>In addition</span>, online success requires exceptional self-management abilities. <span class='causal'>This is because</span> students must independently regulate their learning without supervision. <span class='discourse'>For instance</span>, many experience difficulty maintaining focus while studying at home alone.</p><p><span class='discourse'>In conclusion</span>, both learning formats present notable strengths and weaknesses. <span class='discourse'>On balance</span>, integrating online flexibility with classroom engagement potentially delivers optimal results.</p>"
  }
 }
]
}
