{
  "opinion": [
    {
      "id": "life-better-today",
      "title": "Life Better Today",
      "topic": "Quality of Life: Past vs Present",
      "essayType": "Opinion",
      "question": "'Life is better today than it was 100 years ago.' Do you agree?",
      "writingPoints": ["health", "entertainment", "technology and communication (your own idea)"],
      "structure": {
        "introduction": [
          "Few people would deny that life has changed dramatically over the past century.",
          "In recent times, debates about quality of life have sparked considerable discussion.",
          "There is a growing recognition that modern advances have transformed daily existence.",
          "Therefore, I firmly believe that life today is significantly better than life 100 years ago."
        ],
        "paragraph2_health": [
          "The main advantage of modern life is that healthcare has revolutionized human wellbeing.",
          "One major benefit is that vaccines and antibiotics prevent diseases that once killed millions.",
          "For example, medical science can now treat infections that were previously fatal.",
          "As a result, average life expectancy has increased by 30-40 years globally.",
          "Consequently, people today live longer, healthier lives than ever before."
        ],
        "paragraph3_entertainment": [
          "Another strong point is that entertainment and communication have been transformed by technology.",
          "A further positive aspect is that streaming services provide unlimited access to global content.",
          "For instance, people can connect instantly with friends and family anywhere in the world.",
          "This in turn enriches cultural experiences and maintains relationships across distances.",
          "Therefore, modern technology has democratized access to information and entertainment."
        ],
        "paragraph4_technology": [
          "Furthermore, technology enables instant global connection through video calls and remote work.",
          "Although some argue that modern life brings stress and environmental challenges, I would argue that the benefits vastly outweigh these concerns.",
          "While there are drawbacks, the advantages of advanced healthcare, technology, and opportunities are more significant."
        ],
        "conclusion": [
          "In conclusion, I am convinced that life today is significantly better than a century ago.",
          "On balance, progress in health, communication, and quality of life represents genuine improvement.",
          "Taking everything into account, modern advances have created unprecedented opportunities for humanity."
        ]
      }
    },
    {
      "id": "work-money-enjoyment",
      "title": "Work: Money vs Enjoyment",
      "topic": "Career Priorities",
      "essayType": "Opinion",
      "question": "Is it better to earn a lot of money or to enjoy your job?",
      "writingPoints": ["how much time is spent at work", "the type of work which is done", "financial security for family (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, there is an ongoing debate about career priorities.",
          "It is widely argued that job satisfaction plays an important role in modern life.",
          "Many people believe that money matters most, while others hold the opposite view.",
          "Personally, I am convinced that enjoying your work is ultimately more important, though financial security also matters."
        ],
        "paragraph2_time": [
          "I firmly believe that job enjoyment plays an essential role in life quality.",
          "The main reason for this is that we spend the majority of our adult lives at work.",
          "For example, someone working from age 20 to 65 spends approximately 90,000 hours at work.",
          "As a result, job satisfaction becomes crucial for overall happiness and mental health.",
          "This is because spending decades in unfulfilling employment can lead to depression and burnout."
        ],
        "paragraph3_work_type": [
          "I strongly agree that the nature of work contributes positively to wellbeing.",
          "Another point supporting this view is that meaningful work provides purpose.",
          "For instance, teachers or healthcare workers often report high satisfaction despite modest salaries.",
          "Consequently, this sense of contribution often matters more to happiness than material possessions.",
          "It seems to me that purpose has improved quality of life considerably."
        ],
        "paragraph4_financial": [
          "Admittedly, adequate income is essential for meeting basic needs and reducing stress.",
          "However, I would argue that the solution is finding work that offers both reasonable compensation and satisfaction.",
          "For example, parents working unfulfilling but well-paid jobs can provide better education for their children.",
          "Nevertheless, choosing one extreme over finding balance creates long-term problems."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that job enjoyment has brought about positive change in how we view careers.",
          "To sum up, my view is that while financial security matters, job satisfaction plays a crucial role in improving long-term wellbeing.",
          "Overall, I am convinced that the advantages of meaningful work far outweigh any drawbacks."
        ]
      }
    },
    {
      "id": "endangered-animals",
      "title": "Saving Endangered Animals",
      "topic": "Wildlife Conservation",
      "essayType": "Opinion",
      "question": "'We should do everything we can to save animals which are in danger of disappearing from our planet.' Do you agree?",
      "writingPoints": ["the kind of animals which are in danger", "the reasons for protecting these animals", "human responsibility and future generations (your own idea)"],
      "structure": {
        "introduction": [
          "It is widely believed that protecting endangered species plays a crucial role in our world.",
          "There is no doubt that thousands of animals have had a major influence on ecosystem balance.",
          "It is often argued that conservation contributes positively to the environment.",
          "From my perspective, I completely agree that we must do everything possible to save endangered animals."
        ],
        "paragraph2_ecosystem": [
          "I firmly believe that biodiversity plays an essential role in ecosystem survival.",
          "The main reason why I support conservation is because every species serves a crucial function.",
          "For example, bees pollinate crops that feed billions of people, while predators control prey populations.",
          "As a result, losing species creates cascading effects that ultimately threaten human survival.",
          "There is no doubt in my mind that protecting animals is beneficial for our own future."
        ],
        "paragraph3_responsibility": [
          "I am of the opinion that humans have caused most modern extinctions.",
          "One of the most effective reasons to act is that habitat destruction, pollution, and climate change are human-caused.",
          "For instance, industrial activity has destroyed rainforests and poisoned oceans with plastic.",
          "Consequently, we have a moral obligation to reverse the damage we have created.",
          "It seems to me that human responsibility has improved awareness considerably in recent years."
        ],
        "paragraph4_costs": [
          "While critics argue that conservation is expensive, I would argue that ecosystem collapse would cost humanity far more.",
          "Consider how losing pollinators would devastate global food production.",
          "Although conservation requires investment, the alternative of environmental disaster is unacceptable.",
          "Therefore, the benefits clearly outweigh the financial concerns."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that saving endangered species has brought about positive change.",
          "To sum up, my view is that conservation plays a crucial role in improving Earth's future.",
          "Overall, it seems clear that protecting biodiversity deserves full support from governments and individuals."
        ]
      }
    },
    {
      "id": "friends-vs-family",
      "title": "Friends vs Family",
      "topic": "Personal Relationships",
      "essayType": "Opinion",
      "question": "Which is more important – friends or family?",
      "writingPoints": ["who you can enjoy yourself with", "who will help you when you have problems", "different life stages and changing needs (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of relationships has become a subject of widespread discussion.",
          "It is widely believed that both friends and family play crucial roles in shaping our lives.",
          "Many people today hold the view that friends are more important, while others take a different stance.",
          "In my opinion, family relationships have more positive than negative aspects and ultimately matter more."
        ],
        "paragraph2_permanent": [
          "I firmly believe that family bonds play an essential role in providing stability.",
          "The main reason is that family relationships are permanent and unconditional.",
          "For example, parents continue loving and supporting children through failures and poor decisions.",
          "As a result, family provides a foundation of acceptance that remains constant.",
          "There is no doubt in my mind that this permanent support is beneficial for long-term wellbeing."
        ],
        "paragraph3_practical": [
          "I strongly agree that family contributes positively to practical support during crises.",
          "Another key factor is that family typically provides more substantial help.",
          "For instance, parents help adult children with housing deposits, medical emergencies, and childcare.",
          "Consequently, family offers tangible assistance that exceeds what most friendships provide.",
          "It seems to me that family obligation has improved survival rates during difficult times considerably."
        ],
        "paragraph4_friends": [
          "Admittedly, friends understand current life situations better and share interests more naturally.",
          "However, I would argue that this situational compatibility matters less than permanent family support.",
          "While friends are important for enjoyment and shared activities, family provides irreplaceable stability.",
          "Nevertheless, the ideal situation combines both strong family bonds and good friendships."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that family relationships have brought about more lasting support.",
          "To sum up, my view is that family plays a crucial role in improving overall life stability.",
          "On balance, it seems clear that family deserves slightly more importance, though both relationships are valuable."
        ]
      }
    },
    {
      "id": "social-media-effects",
      "title": "Social Media Effects",
      "topic": "Technology and Society",
      "essayType": "Opinion",
      "question": "Do you think social media has a positive or negative effect on society?",
      "writingPoints": ["connecting people", "spreading misinformation", "mental health impact (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of social media has become a subject of widespread discussion.",
          "It is widely believed that technology plays a crucial role in shaping our modern world.",
          "Many people today hold the view that social media is beneficial, while others take a different stance.",
          "From my perspective, I believe social media has more negative than positive aspects for society."
        ],
        "paragraph2_counter": [
          "Admittedly, social media does connect people across distances effectively.",
          "For example, families separated by continents can stay in touch easily.",
          "However, I would argue that these benefits are outweighed by serious negative consequences.",
          "This is because the connections formed are often superficial rather than genuinely meaningful."
        ],
        "paragraph3_misinformation": [
          "I firmly believe that misinformation plays a destructive role in modern society.",
          "The main reason is that social media rapidly spreads false claims and conspiracy theories.",
          "For instance, incorrect information about health and politics can reach millions within hours.",
          "As a result, society becomes increasingly polarized and people distrust legitimate sources.",
          "There is no doubt in my mind that this is harmful for democracy and public health."
        ],
        "paragraph4_mental_health": [
          "I strongly agree that social media contributes negatively to mental health.",
          "Another pressing concern is that constant social comparison damages wellbeing.",
          "For example, cyberbullying, fear of missing out, and unrealistic standards contribute to anxiety.",
          "Consequently, heavy social media use correlates with increased rates of depression.",
          "It seems to me that mental health problems have worsened considerably since social media became widespread."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that social media has brought about more harm than good.",
          "To sum up, my view is that regulation plays a crucial role in improving online safety.",
          "Overall, I am convinced that the disadvantages of social media far outweigh any benefits."
        ]
      }
    },
    {
      "id": "university-education",
      "title": "University Education",
      "topic": "Higher Education",
      "essayType": "Opinion",
      "question": "Should everyone go to university?",
      "writingPoints": ["career opportunities", "cost and debt", "alternative paths to success (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of higher education has become a subject of widespread discussion.",
          "It is widely believed that university plays a crucial role in career success.",
          "Many people today hold the view that everyone should pursue degrees, while others take a different stance.",
          "In my opinion, university education is not suitable for everyone and has more negative than positive aspects for some people."
        ],
        "paragraph2_counter": [
          "Admittedly, university degrees do open doors to certain professions.",
          "For example, careers in medicine, law, and engineering require university qualifications.",
          "However, I would argue that many other careers offer excellent prospects without degrees.",
          "Consider how skilled trades like electricians and plumbers often earn more than graduates while avoiding debt."
        ],
        "paragraph3_debt": [
          "I firmly believe that student debt plays a destructive role in young people's lives.",
          "The main reason is that university education creates enormous financial burdens.",
          "For instance, students often graduate with tens of thousands of pounds in debt.",
          "As a result, many young people delay major life decisions like buying homes or starting families.",
          "There is no doubt in my mind that this financial pressure is harmful for society."
        ],
        "paragraph4_alternatives": [
          "I strongly agree that alternative paths contribute positively to career success.",
          "Another important factor is that apprenticeships, vocational training, and entrepreneurship lead to fulfilling careers.",
          "For example, many successful business owners never attended university.",
          "Consequently, pushing everyone toward university wastes both individual potential and social resources.",
          "It seems to me that diverse educational paths have improved employment opportunities considerably."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that universal university attendance has brought about unnecessary debt.",
          "To sum up, my view is that valuing diverse educational paths plays a crucial role in improving society.",
          "Overall, I am convinced that the disadvantages of pressuring everyone toward university far outweigh any benefits."
        ]
      }
    },
    {
      "id": "homework-amount",
      "title": "Homework Amount",
      "topic": "Education Practices",
      "essayType": "Opinion",
      "question": "Do school children have too much homework these days?",
      "writingPoints": ["academic performance", "stress and mental health", "time for other activities (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of homework has become a subject of widespread discussion.",
          "It is widely believed that homework plays a crucial role in academic success.",
          "Many people today hold the view that homework improves learning, while others take a different stance.",
          "In my opinion, modern children receive far too much homework and this has more negative than positive aspects."
        ],
        "paragraph2_counter": [
          "Admittedly, homework can improve academic performance by reinforcing classroom learning.",
          "For example, practice helps students remember what they studied.",
          "However, I would argue that excessive homework actually reduces effectiveness.",
          "Research shows that beyond two hours daily, homework provides diminishing returns and can harm learning."
        ],
        "paragraph3_stress": [
          "I firmly believe that excessive homework plays a destructive role in mental health.",
          "The main reason is that too much homework creates severe stress in young children.",
          "For instance, children as young as 10 report feeling overwhelmed and anxious about completing assignments.",
          "As a result, rates of childhood anxiety and depression have increased dramatically.",
          "There is no doubt in my mind that this pressure is harmful for child development."
        ],
        "paragraph4_activities": [
          "I strongly agree that free time contributes positively to healthy development.",
          "Another significant problem is that excessive homework prevents crucial activities.",
          "For example, children need time for physical exercise, creative play, family interaction, and adequate sleep.",
          "Consequently, when homework consumes all free time, children miss out on essential experiences.",
          "It seems to me that balanced childhood activities have improved wellbeing considerably when allowed."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that excessive homework has brought about unnecessary stress.",
          "To sum up, my view is that reducing homework plays a crucial role in improving child wellbeing.",
          "Overall, I am convinced that the disadvantages of too much homework far outweigh any academic benefits."
        ]
      }
    },
    {
      "id": "school-uniforms",
      "title": "School Uniforms",
      "topic": "Education Policy",
      "essayType": "Opinion",
      "question": "Should students be required to wear school uniforms?",
      "writingPoints": ["equality among students", "self-expression", "cost to families (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of school uniforms has become a subject of widespread discussion.",
          "It is widely believed that dress codes play a crucial role in educational environments.",
          "Many people today hold the view that uniforms are essential, while others take a different stance.",
          "From my perspective, school uniforms should be mandatory as they have more positive than negative aspects."
        ],
        "paragraph2_equality": [
          "I firmly believe that uniforms play an essential role in creating equality.",
          "The main reason is that when everyone wears the same clothes, socioeconomic differences become less visible.",
          "For example, students from less wealthy families don't feel embarrassed or excluded.",
          "As a result, uniforms eliminate the pressure to wear expensive, fashionable brands.",
          "There is no doubt in my mind that this equality is beneficial for student wellbeing."
        ],
        "paragraph3_distraction": [
          "I strongly agree that uniforms contribute positively to learning focus.",
          "Another significant benefit is that uniforms minimize distractions.",
          "For instance, without uniforms, students often spend considerable time choosing outfits and comparing appearances.",
          "Consequently, uniforms allow both students and teachers to concentrate on education rather than fashion.",
          "It seems to me that academic focus has improved considerably in schools with uniform policies."
        ],
        "paragraph4_expression": [
          "Admittedly, some argue that uniforms suppress individual self-expression.",
          "However, I would argue that students can express themselves through countless other ways.",
          "For example, students show individuality through their ideas, talents, and after-school activities.",
          "Additionally, uniforms actually cost families less than constantly buying new fashionable clothes."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that school uniforms have brought about substantial benefits.",
          "To sum up, my view is that uniforms play a crucial role in improving equality and focus.",
          "Overall, I am convinced that the advantages of mandatory uniforms far outweigh any concerns about self-expression."
        ]
      }
    },
    {
      "id": "public-transport",
      "title": "Public Transport Investment",
      "topic": "Urban Planning",
      "essayType": "Opinion",
      "question": "Should governments invest more money in public transport rather than roads?",
      "writingPoints": ["environmental benefits", "traffic congestion", "accessibility for all (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of transportation infrastructure has become a subject of widespread discussion.",
          "It is widely believed that transport systems play a crucial role in modern cities.",
          "Many people today hold the view that roads are more important, while others take a different stance.",
          "In my opinion, governments should prioritize public transport as it has more positive than negative aspects."
        ],
        "paragraph2_environment": [
          "I firmly believe that public transport plays an essential role in protecting the environment.",
          "The main reason is that excellent public transport dramatically reduces pollution.",
          "For example, one train can carry the same number of passengers as hundreds of cars while producing far fewer emissions.",
          "As a result, cities with extensive public transport networks have significantly better air quality.",
          "There is no doubt in my mind that this environmental benefit is crucial for public health."
        ],
        "paragraph3_congestion": [
          "I strongly agree that public transport contributes positively to reducing traffic problems.",
          "Another important advantage is that good public transport reduces congestion.",
          "For instance, when people have reliable, convenient public transport options, fewer choose to drive.",
          "Consequently, this frees up road space for essential vehicles and reduces commute times for everyone.",
          "It seems to me that traffic flow has improved considerably in cities that invested in public transport."
        ],
        "paragraph4_accessibility": [
          "I tend to believe that accessibility offers clear advantages in terms of social equity.",
          "One crucial factor is that public transport provides mobility for people who cannot drive.",
          "For example, elderly people, young people, and those with disabilities or low incomes depend on public transport.",
          "Therefore, adequate investment ensures equal access to work, education, and healthcare for all citizens.",
          "This represents a positive development in creating fair societies."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that public transport investment has brought about positive change.",
          "To sum up, my view is that prioritizing public transport plays a crucial role in improving cities.",
          "Overall, I am convinced that the advantages of public transport investment far outweigh road building."
        ]
      }
    },
    {
      "id": "celebrity-role-models",
      "title": "Celebrity Role Models",
      "topic": "Media and Society",
      "essayType": "Opinion",
      "question": "Are celebrities good role models for young people?",
      "writingPoints": ["their achievements", "their behavior", "media influence (your own idea)"],
      "structure": {
        "introduction": [
          "Nowadays, the issue of celebrity influence has become a subject of widespread discussion.",
          "It is widely believed that famous people play a crucial role in shaping youth behavior.",
          "Many people today hold the view that celebrities inspire young people, while others take a different stance.",
          "In my opinion, most celebrities are poor role models and have more negative than positive aspects."
        ],
        "paragraph2_counter": [
          "Admittedly, some celebrities have achieved remarkable success through talent and hard work.",
          "For example, athletes and musicians often demonstrate dedication and perseverance.",
          "However, I would argue that this is overshadowed by negative aspects of celebrity culture.",
          "Young people tend to imitate the wrong behaviors rather than learning from achievements."
        ],
        "paragraph3_behavior": [
          "I firmly believe that poor behavior plays a destructive role in youth development.",
          "The main reason is that many celebrities exhibit bad values and irresponsible actions.",
          "For instance, drug use, excessive drinking, and wasteful spending are often glamorized.",
          "As a result, young people may perceive these behaviors as acceptable or even desirable.",
          "There is no doubt in my mind that this influence is harmful for impressionable teenagers."
        ],
        "paragraph4_unrealistic": [
          "I strongly agree that celebrity culture contributes negatively to self-esteem.",
          "Another significant problem is that celebrities promote unrealistic lifestyles.",
          "For example, social media shows perfect appearances, luxury possessions, and seemingly effortless success.",
          "Consequently, young people develop unrealistic expectations and feel inadequate when comparing themselves.",
          "It seems to me that body image problems have worsened considerably since social media became widespread."
        ],
        "conclusion": [
          "In conclusion, I strongly believe that celebrity culture has brought about negative influences.",
          "To sum up, my view is that looking up to real people plays a crucial role in improving youth development.",
          "Overall, I am convinced that the disadvantages of celebrity role models far outweigh any inspirational benefits."
        ]
      }
    }
  ]
}
