{
  "life-better-today": [
    {
      "label": "Introduction",
      "sentences": [
        "Nowadays, there is considerable debate about whether life today is better than in the past.",
        "From my perspective, modern life is significantly better due to remarkable advances in health, entertainment and communication."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "I firmly believe that healthcare plays an essential role in improving our lives.",
        "This is because diseases that once killed millions can now be treated effectively.",
        "For example, vaccines have eliminated deadly illnesses like polio and smallpox.",
        "As a result, life expectancy has increased dramatically worldwide."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, entertainment options have expanded enormously.",
        "This is because streaming platforms provide unlimited access to films and music instantly.",
        "For instance, we can enjoy any content from home at any time.",
        "Consequently, people have far more ways to relax and enjoy themselves."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "In addition, technology has transformed how we communicate globally.",
        "Video calls allow families to stay connected across continents daily.",
        "While some argue this causes stress, I believe the benefits of instant global communication far outweigh any drawbacks."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I am convinced that life today is much better than a century ago.",
        "Overall, improvements in health, entertainment and technology demonstrate remarkable human progress."
      ]
    }
  ],
  "work-money-enjoyment": [
    {
      "label": "Introduction",
      "sentences": [
        "Few people would deny that work is an essential part of modern life.",
        "In recent times, there has been considerable debate about job satisfaction versus high salaries.",
        "Therefore, it is vital we analyse the benefits and drawbacks of both options."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of earning a high salary is financial security and stability.",
        "This is because well-paid workers can afford comfortable lifestyles and support their families.",
        "For example, they can pay for quality healthcare and education.",
        "Another strong point is that we spend nearly a third of our lives working, so earning good money makes those hours worthwhile."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages to high salaries, job satisfaction matters greatly too.",
        "The key disadvantage of focusing only on money is that personal happiness suffers considerably.",
        "For instance, boring or stressful jobs often lead to unhappiness regardless of salary."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Moreover, mental health is significantly affected by job satisfaction.",
        "This is because unfulfilling work can cause burnout, anxiety and depression.",
        "Consequently, finding meaningful work protects our overall wellbeing."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, both money and enjoyment have clear advantages.",
        "On balance, finding work that provides both purpose and reasonable income would be the ideal solution."
      ]
    }
  ],
  "endangered-animals": [
    {
      "label": "Introduction",
      "sentences": [
        "In recent years, protecting endangered animals has attracted increasing attention from both the public and environmental experts worldwide.",
        "I strongly believe that we should do everything possible to save them for future generations."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "To begin with, many magnificent species are currently in serious danger of extinction.",
        "This is largely because hunting and habitat destruction have reduced their numbers drastically.",
        "For example, tigers, rhinos and elephants face critical threats.",
        "As a result, we are losing irreplaceable wildlife at an alarming rate."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, there are compelling reasons to protect these endangered animals.",
        "This is because every species plays vital roles in maintaining natural balance.",
        "For instance, bees pollinate crops that humans depend on for food.",
        "Consequently, losing animal species threatens our own survival too."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "In addition, ecosystem balance depends entirely on biodiversity.",
        "This is because each animal contributes to complex food chains.",
        "For example, wolves control deer populations and protect forests.",
        "Therefore, protecting wildlife maintains environmental stability for everyone."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I firmly believe endangered animals must be protected urgently.",
        "Taking everything into account, conservation benefits both nature and humanity significantly."
      ]
    }
  ],
  "friends-vs-family": [
    {
      "label": "Introduction",
      "sentences": [
        "It is widely recognised that relationships are essential to our happiness and wellbeing.",
        "In recent times, there has been considerable debate about the value of friendships compared with family ties.",
        "Hence, it is vital to consider the benefits of both."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of friends is that they provide enjoyment and shared interests.",
        "This is because we choose friends who share our hobbies, tastes and values.",
        "For example, teenagers select friends to socialise and have fun with.",
        "As a result, friendships create happiness and memorable experiences throughout life."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages to friendships, family provides stronger support during difficult times.",
        "The key disadvantage of relying only on friends is that they may not always help during serious problems.",
        "In contrast, family members typically offer unconditional support during crises without hesitation."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Additionally, different relationships matter at different life stages.",
        "This is because teenagers often prioritise friends, while adults tend to value family more.",
        "Consequently, both types of relationships serve important purposes throughout our lives."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, both friends and family are extremely valuable.",
        "On balance, family support proves more reliable, but both contribute significantly to our happiness."
      ]
    }
  ],
  "environment-pollution": [
    {
      "label": "Introduction",
      "sentences": [
        "Nowadays, pollution has become an increasingly serious problem affecting the entire planet.",
        "It is widely recognised that pollution damages health and the environment significantly.",
        "Hence, it is vital to examine the main problems and explore practical solutions."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "Firstly, transport causes significant air pollution in cities worldwide.",
        "This is because millions of vehicles produce harmful emissions every single day.",
        "For example, major cities suffer from dangerous levels of smog.",
        "As a result, respiratory diseases are increasing among urban populations."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Secondly, rivers and seas are being contaminated by industrial waste and plastic.",
        "This happens because factories release toxic chemicals into waterways carelessly.",
        "For instance, countless marine animals die from plastic pollution annually.",
        "Consequently, entire ecosystems are being destroyed."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "However, renewable energy offers a very promising solution to these problems.",
        "This is because solar and wind power produce no harmful emissions whatsoever.",
        "For example, countries investing in clean energy report significantly improved air quality.",
        "If such measures were implemented globally, pollution could be reduced dramatically."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I believe pollution can be addressed effectively through determined action.",
        "Overall, combining cleaner transport, stricter regulations and renewable energy will protect our planet."
      ]
    }
  ],
  "technology-social-interaction": [
    {
      "label": "Introduction",
      "sentences": [
        "It is common knowledge that technology has transformed modern communication completely.",
        "There is growing recognition that digital communication has both positive and negative effects on social interaction.",
        "Therefore, it is essential to analyse the arguments on both sides."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of technology is connecting people instantly across vast distances.",
        "This is because social media platforms allow communication with anyone worldwide.",
        "For example, families can video call relatives abroad daily and share special moments.",
        "As a result, maintaining relationships across distances becomes much easier."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages, technology can reduce meaningful face-to-face interaction.",
        "The key disadvantage of smartphones is that people often stare at screens instead of talking.",
        "For instance, families frequently sit together in restaurants without actually conversing.",
        "Consequently, genuine social skills may decline over time."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Nevertheless, technology greatly benefits long-distance relationships and friendships.",
        "This is because couples and friends separated by distance can stay intimately connected through regular video calls and messaging.",
        "For example, this maintains bonds that letters never could achieve."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, technology has both significant benefits and drawbacks.",
        "On balance, it enhances communication when used responsibly alongside real-world interaction."
      ]
    }
  ],
  "gap-year": [
    {
      "label": "Introduction",
      "sentences": [
        "Over the past few years, gap years have become increasingly popular among young people before university.",
        "It is widely recognised that taking time off from education can have both positive and negative effects.",
        "Hence, it is vital to analyse the advantages and disadvantages carefully."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of gap years is gaining valuable life experience and independence.",
        "This is because travelling and volunteering abroad develop maturity and practical skills.",
        "For example, students who work overseas learn to solve problems independently.",
        "As a result, they often perform better when they return to education."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages, gap years also present significant challenges.",
        "The key disadvantage of taking time off is potentially losing academic momentum and motivation.",
        "A major drawback is that study habits can deteriorate considerably after a year away.",
        "Consequently, some students struggle to return to education."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Furthermore, financial considerations are extremely significant for many families.",
        "This is because travelling and accommodation require substantial savings.",
        "For instance, expenses can reach thousands of pounds.",
        "However, working during a gap year can help fund university studies later."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, gap years have both benefits and drawbacks.",
        "On balance, they benefit motivated students who plan carefully and remain committed."
      ]
    }
  ],
  "online-shopping": [
    {
      "label": "Introduction",
      "sentences": [
        "In recent times, online shopping has grown enormously in popularity worldwide.",
        "There is growing recognition that it has both positive and negative effects on consumers and communities.",
        "Therefore, it is vital to analyse the benefits and drawbacks of buying products online."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of online shopping is its unmatched convenience and accessibility.",
        "This is because customers can browse and purchase products anytime from home.",
        "For example, busy professionals can order items late at night after work.",
        "As a result, shopping becomes far more efficient.",
        "Furthermore, online prices are often considerably lower."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages, online shopping seriously harms local businesses.",
        "The key disadvantage is that independent shops lose customers to large online retailers.",
        "A major drawback is that many high street stores have been forced to close permanently.",
        "Consequently, communities lose their unique character and local services."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Moreover, customers cannot try products before buying them online.",
        "For instance, clothes often fit differently than expected from photographs.",
        "As a result, returns cause considerable inconvenience and frustration for shoppers."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, both shopping methods have clear advantages.",
        "On balance, combining online convenience with supporting local shops would be ideal."
      ]
    }
  ],
  "childhood-obesity": [
    {
      "label": "Introduction",
      "sentences": [
        "These days, childhood obesity has become an increasingly serious problem in many countries.",
        "It is widely recognised that this crisis affects children's health and future wellbeing significantly.",
        "Therefore, it is vital to identify the main problems and discuss effective solutions."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "Firstly, unhealthy eating habits are a major cause of childhood obesity.",
        "This is because many children consume excessive amounts of sugary snacks and fast food daily.",
        "For example, many eat crisps and burgers regularly instead of nutritious meals.",
        "As a result, they consume far more calories than their bodies actually need."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Secondly, lack of physical exercise contributes significantly to rising obesity rates.",
        "This is because children spend hours on screens instead of playing outdoors actively.",
        "For instance, many prefer video games to sports or cycling.",
        "Consequently, fitness levels have declined sharply among young people."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "However, school education offers an effective solution to address this crisis.",
        "This is because schools can teach nutrition and provide healthy meals in canteens.",
        "For example, banning vending machines and increasing PE lessons would help considerably.",
        "By taking these steps, schools could reduce obesity."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, childhood obesity can be addressed through determined action.",
        "Overall, combining healthier diets, more exercise and school programmes will protect children's health."
      ]
    }
  ],
  "social-media-addiction": [
    {
      "label": "Introduction",
      "sentences": [
        "In recent years, social media addiction has become a significant concern among young people.",
        "It is widely acknowledged that excessive use has led to serious consequences for mental health.",
        "Hence, it is vital to examine the main causes and their resulting effects."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "One of the main causes of addiction is constant notifications from social media apps.",
        "This is because platforms are deliberately designed to send endless alerts about likes and messages.",
        "For example, each notification triggers dopamine release in the brain.",
        "As a result, users feel compelled to check their phones compulsively throughout the day."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Another important cause is social comparison with others online.",
        "This happens because people constantly see idealised images of others' seemingly perfect lives.",
        "For instance, teenagers compare themselves to influencers and celebrities.",
        "Consequently, feelings of inadequacy and low self-esteem develop rapidly."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "The effects on mental health are particularly serious and widespread.",
        "As a consequence, many young people experience anxiety, depression and loneliness.",
        "For example, constant comparison significantly damages self-confidence.",
        "Furthermore, addiction affects sleep quality and academic performance negatively."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "To sum up, social media addiction causes serious problems for individuals.",
        "Overall, understanding these causes is essential for addressing this growing issue effectively."
      ]
    }
  ],
  "family-size": [
    {
      "label": "Introduction",
      "sentences": [
        "Few people would deny that family structure significantly affects children's development and wellbeing.",
        "There is growing recognition that both large and small families have distinct advantages and disadvantages.",
        "Therefore, it is vital to analyse the benefits and drawbacks of each."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of large families is that children learn valuable social skills from siblings.",
        "This is because having brothers and sisters teaches sharing, cooperation and patience naturally.",
        "For example, older siblings often help and guide younger ones.",
        "As a result, children become less selfish and more sociable throughout life."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages to large families, they face considerably higher costs.",
        "The key disadvantage is that parents must share limited financial resources among more children.",
        "A major drawback is that significant financial pressure affects the entire family's quality of life.",
        "Consequently, individual opportunities for each child may be limited."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Furthermore, small families can provide more individual attention to each child.",
        "This is because parents have more time for each child's emotional and educational needs.",
        "For instance, children receive more help with homework and personal problems."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, both family sizes have significant benefits and challenges.",
        "On balance, the best size depends on each family's particular circumstances and values."
      ]
    }
  ],
  "work-from-home": [
    {
      "label": "Introduction",
      "sentences": [
        "Nowadays, working from home has become increasingly common in many professions.",
        "There is considerable debate about whether remote work is actually better than traditional office work.",
        "Therefore, it is important to examine arguments on both sides of this discussion."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "One strong argument in favour of remote work is saving valuable commuting time.",
        "This is because travelling to offices is eliminated entirely when working from home.",
        "For example, workers can save up to two hours daily that would otherwise be wasted.",
        "As a result, they experience significantly less stress and physical fatigue."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, working from home offers much greater comfort and flexibility.",
        "This is because people can create personalised workspaces that suit their individual preferences.",
        "For instance, employees can control temperature, lighting and noise levels.",
        "Consequently, productivity and job satisfaction often improve considerably."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "On the other hand, remote work significantly reduces social interaction with colleagues.",
        "Critics argue that isolation can damage both wellbeing and effective teamwork.",
        "For example, office workers build friendships and collaborate more easily face-to-face."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I believe working from home offers significant advantages overall.",
        "On balance, the benefits outweigh drawbacks when social needs are properly addressed."
      ]
    }
  ],
  "fashion-industry": [
    {
      "label": "Introduction",
      "sentences": [
        "The fashion industry has a significant and growing influence on modern society.",
        "Because of this, there is considerable debate about whether its effects are positive or negative.",
        "I firmly believe the fashion industry creates several serious problems for people."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "To begin with, pressure to look fashionable damages people's confidence and self-image.",
        "This is because advertisements constantly promote unrealistic beauty standards.",
        "For example, many teenagers feel inadequate trying desperately to follow the latest trends.",
        "As a result, self-esteem and body image suffer considerably among young people."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, fashionable clothing is often extremely expensive for ordinary families.",
        "This is because designer brands charge premium prices for trendy items each season.",
        "For instance, families feel pressured to buy expensive branded products unnecessarily.",
        "Consequently, this creates unnecessary financial stress and debt."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Moreover, fast fashion damages the environment very significantly.",
        "This is because cheap, disposable clothing creates enormous amounts of waste globally.",
        "For example, millions of tonnes of unwanted clothes end up in landfills annually.",
        "Therefore, the environmental cost is absolutely devastating for our planet."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I firmly believe the fashion industry has damaging negative effects.",
        "Overall, it creates pressure, encourages overspending and harms the environment badly."
      ]
    }
  ],
  "learning-languages": [
    {
      "label": "Introduction",
      "sentences": [
        "Learning a foreign language is becoming increasingly important in today's globalised and connected world.",
        "Because of this, many people question whether language learning offers benefits beyond passing exams.",
        "I firmly believe there are many valuable reasons to learn languages throughout life."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "To begin with, learning a language can bring genuine pleasure and enjoyment.",
        "This is because discovering new words and expressions is intellectually stimulating and exciting.",
        "For example, speaking another language while travelling creates wonderful, memorable experiences.",
        "As a result, language learning becomes personally meaningful and rewarding."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, language learning represents a rewarding personal challenge.",
        "This is because mastering a completely new skill builds confidence and self-esteem significantly.",
        "For instance, successfully completing a language course creates genuine pride and achievement.",
        "Consequently, motivation to continue learning and improving grows naturally."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Moreover, foreign language skills create excellent career opportunities in the modern workplace.",
        "This is because international companies increasingly need multilingual employees for global business.",
        "For example, speaking additional languages often leads to better jobs and higher salaries.",
        "Therefore, language skills have real, practical professional value."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I strongly believe there are many reasons to learn languages beyond exams.",
        "Overall, language learning provides pleasure, personal challenge and career advancement."
      ]
    }
  ],
  "learning-history": [
    {
      "label": "Introduction",
      "sentences": [
        "Learning history is an essential component of education systems worldwide.",
        "Because of this, there is considerable debate about whether national history should be compulsory for all students.",
        "I firmly believe that everyone should study their own country's history thoroughly."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "Firstly, history teaches us invaluable lessons from past events and mistakes.",
        "This is because understanding previous events helps societies avoid repeating serious errors.",
        "For example, learning about past wars teaches younger generations the importance of peace and diplomacy.",
        "As a result, students become more informed and responsible citizens."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Secondly, focusing only on the future is simply insufficient for understanding the present.",
        "This is because history provides essential context for interpreting current events and decisions.",
        "For instance, political situations become much clearer when historical background is properly understood.",
        "Consequently, people can make better-informed choices about important issues."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Furthermore, national history strongly strengthens people's sense of identity and belonging.",
        "This is because understanding our collective past creates meaningful connection to our cultural roots.",
        "For example, knowing about significant national events builds genuine community pride and unity."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I strongly believe national history education is essential for everyone.",
        "Overall, it provides vital lessons, important context and strengthens national identity."
      ]
    }
  ],
  "sports-money": [
    {
      "label": "Introduction",
      "sentences": [
        "In modern society, famous athletes earn extraordinarily high salaries exceeding millions annually.",
        "Because of this, many people question whether such enormous payments are actually justified.",
        "I believe that many professional sports stars are paid excessively."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "Firstly, athletes certainly deserve fair payment for the entertainment they provide to millions.",
        "This is because major sporting events attract enormous global audiences and generate huge revenues.",
        "For example, football matches and Olympic events are watched by billions of viewers worldwide.",
        "As a result, athletes become extremely valuable entertainers in the modern world."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, many professional athletes work incredibly hard to achieve excellence.",
        "This is because they train intensively for many years, often sacrificing normal social lives.",
        "For instance, Olympic athletes typically dedicate several hours daily to rigorous preparation.",
        "Consequently, their dedication and sacrifice certainly deserve recognition and reward."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "However, sponsorship and endorsement deals push athlete earnings unreasonably high.",
        "This is because some stars earn millions simply for appearing in advertisements.",
        "For example, certain athletes earn more from endorsements than from actually playing their sport."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, athletes work hard and entertain millions of fans genuinely.",
        "However, excessive sponsorship earnings show they are often significantly overpaid.",
        "Overall, salaries should be more reasonably balanced."
      ]
    }
  ],
  "self-employment": [
    {
      "label": "Introduction",
      "sentences": [
        "In recent times, self-employment has become an increasingly popular career choice for many people.",
        "It is widely recognised that both working independently and for employers have distinct advantages.",
        "Therefore, it is vital to analyse the benefits and drawbacks of each option carefully."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of self-employment is independence and personal freedom.",
        "This is because people can choose their own working hours, projects and clients freely.",
        "For example, freelancers work when they feel most productive and creative.",
        "As a result, they often feel more motivated and satisfied with their careers."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages, traditional employment offers much greater security.",
        "The key disadvantage of self-employment is unpredictable and irregular income throughout the year.",
        "A major drawback is that freelancers lack guaranteed salaries, paid holidays and employment benefits.",
        "Consequently, financial planning becomes considerably more difficult and stressful."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Furthermore, work-life balance differs significantly between both working options.",
        "This is because self-employed people often struggle to separate work time from personal leisure.",
        "For instance, they may feel pressured to work constantly without proper breaks or boundaries."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, both employment options have significant merits and challenges.",
        "On balance, the best choice depends entirely on individual priorities, personality and circumstances."
      ]
    }
  ],
  "advertising-society": [
    {
      "label": "Introduction",
      "sentences": [
        "Advertising is everywhere in modern society, appearing on television, online and in public spaces.",
        "Because of this constant presence, there is considerable debate about whether it truly benefits society.",
        "I believe that advertising often has more harmful than positive effects overall."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "Firstly, advertising does keep consumers informed about available products and services.",
        "This is because companies use advertisements to communicate new offerings and special deals.",
        "For example, customers learn about useful innovations and discounts through advertising campaigns.",
        "As a result, making informed shopping decisions becomes somewhat easier for consumers."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, advertising creates healthy competition between businesses in the marketplace.",
        "This is because companies must constantly improve quality and service to attract customers effectively.",
        "For instance, competing brands often lower prices to win market share.",
        "Consequently, consumers benefit from better products at competitive prices."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "However, advertising frequently manipulates consumers through clever psychological techniques.",
        "This is because marketing deliberately creates artificial needs and desires in people's minds.",
        "For example, people buy unnecessary products due to persuasive and misleading advertisements."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, advertising has both positive and negative aspects for society.",
        "However, manipulation and overconsumption outweigh the informational benefits significantly.",
        "Overall, advertising is not always beneficial for society."
      ]
    }
  ],
  "helping-others": [
    {
      "label": "Introduction",
      "sentences": [
        "Helping others is fundamental to building strong, supportive communities everywhere.",
        "Because of this, many people argue that everyone should contribute regularly to helping others.",
        "I firmly believe that helping others should be an important part of everyone's life."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "Firstly, helping friends and family significantly strengthens personal relationships.",
        "This is because supporting others builds trust, respect and deeper emotional connections.",
        "For example, helping a friend during difficult times brings people much closer together.",
        "As a result, relationships become stronger, more reliable and more meaningful."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "Furthermore, giving back to society is extremely important for community wellbeing.",
        "This is because communities function much better when people actively support each other.",
        "For instance, volunteering improves local services, facilities and quality of life for everyone.",
        "Consequently, society becomes stronger, safer and more united."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Moreover, helping others significantly benefits personal development and happiness.",
        "This is because volunteering builds empathy, confidence and valuable new skills naturally.",
        "For example, people who regularly help others often report increased happiness and life satisfaction.",
        "Therefore, giving benefits both the helper and recipient equally."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, I firmly believe everyone should regularly dedicate time to helping others.",
        "Overall, it strengthens relationships, improves communities and promotes personal growth."
      ]
    }
  ],
  "online-learning": [
    {
      "label": "Introduction",
      "sentences": [
        "In recent times, online learning has become increasingly widespread across all educational levels.",
        "It is widely recognised that both online and traditional classroom learning have significant advantages.",
        "Therefore, it is vital to analyse the benefits and drawbacks of each approach carefully."
      ]
    },
    {
      "label": "Body Paragraph 1",
      "sentences": [
        "The main advantage of online learning is its exceptional flexibility and accessibility.",
        "This is because students can study anytime and anywhere with internet access.",
        "For example, learners can access recorded lessons at times that suit their personal schedules.",
        "As a result, education becomes more accessible to people with busy lives."
      ]
    },
    {
      "label": "Body Paragraph 2",
      "sentences": [
        "While there are many advantages, classrooms provide valuable face-to-face interaction.",
        "The key disadvantage of online learning is significantly limited social contact with teachers and classmates.",
        "A major drawback is that students miss real discussions, friendships and immediate feedback.",
        "Consequently, learning online can feel quite isolating for many students."
      ]
    },
    {
      "label": "Body Paragraph 3",
      "sentences": [
        "Furthermore, online learning requires strong self-discipline and personal motivation.",
        "This is because students must organise themselves effectively without direct teacher supervision.",
        "For instance, many students struggle with procrastination when studying alone at home."
      ]
    },
    {
      "label": "Conclusion",
      "sentences": [
        "In conclusion, both learning methods have significant advantages and challenges.",
        "On balance, combining online flexibility with classroom interaction may prove most effective overall."
      ]
    }
  ]
}
