{
  "general": {
    "introducing_topic": [
      "This essay will examine...",
      "This essay will explore...",
      "This essay will discuss...",
      "This essay will analyze...",
      "The following essay will investigate...",
      "This essay aims to explore...",
      "The purpose of this essay is to examine...",
      "This essay seeks to understand...",
      "The main focus of this essay is...",
      "This essay will address the question of..."
    ],
    
    "announcing_structure": [
      "This essay will first discuss... and then consider...",
      "The following paragraphs will examine...",
      "This essay is divided into three main sections...",
      "After examining..., this essay will then...",
      "The essay will begin by... before moving on to..."
   ],

  "for_and_against": {
    "strong_for_position": [
      "I firmly believe that the advantages outweigh the disadvantages.",
      "In my opinion, the benefits are far more significant than any drawbacks.",
      "I am convinced that this is a positive development overall.",
      "From my perspective, the positives clearly dominate.",
      "While there are some concerns, I believe the advantages are greater.",
      "Despite some drawbacks, the benefits are undeniable.",
      "I strongly feel that the advantages make this worthwhile.",
      "After careful consideration, I believe the benefits are more important.",
      "In my view, the positive aspects far outweigh the negative ones.",
      "I maintain that the advantages justify any potential problems."
    ],
    
    "strong_against_position": [
      "I strongly believe that the disadvantages outweigh any benefits.",
      "In my view, the drawbacks are far more concerning.",
      "I am convinced that this creates more problems than solutions.",
      "From my perspective, the negative impacts are more significant.",
      "Despite some advantages, I believe the disadvantages are greater.",
      "While there are some benefits, the drawbacks cannot be ignored.",
      "I firmly oppose this because the problems are too serious.",
      "After careful thought, I believe the disadvantages are more important.",
      "In my opinion, the negative consequences are too severe.",
      "I maintain that the risks outweigh the rewards."
    ],
    
    "balanced_leaning_positive": [
      "While there are valid arguments on both sides, I lean towards the advantages.",
      "Although both perspectives have merit, I believe the benefits are greater.",
      "Despite some legitimate concerns, I think the advantages prevail.",
      "While acknowledging the drawbacks, I maintain that the benefits are more significant.",
      "Though not without problems, I feel the advantages make this worthwhile.",
      "Both sides present good points, but ultimately the benefits are stronger.",
      "After weighing both sides, I conclude that the advantages are more important.",
      "While respecting opposing views, I believe the positives outweigh the negatives."
    ],
    
    "balanced_leaning_negative": [
      "While there are some benefits, I believe the disadvantages are more serious.",
      "Although advantages exist, I maintain that the drawbacks are more concerning.",
      "Despite some positive aspects, I think the problems are too significant.",
      "While acknowledging some benefits, I believe the disadvantages dominate.",
      "Though there are advantages, I feel the drawbacks are more important.",
      "Both sides have merit, but ultimately the disadvantages are more serious.",
      "After weighing both sides, I conclude that the problems outweigh the benefits.",
      "While respecting different views, I believe the negatives are more significant."
    ],
    
    "truly_balanced": [
      "This issue has both significant advantages and disadvantages that deserve consideration.",
      "Both the benefits and drawbacks are important and must be carefully weighed.",
      "This is a complex issue with valid points on both sides.",
      "The advantages and disadvantages are equally significant in different ways.",
      "Both perspectives offer important insights that cannot be ignored.",
      "This topic presents a genuine dilemma with strong arguments on each side."
    ],
    
    "academic_formal": [
      "Therefore, it is vital we analyse the benefits and drawbacks of this issue.",
      "Consequently, it is imperative that we examine both the advantages and disadvantages.",
      "Hence, it is essential to consider the positive and negative aspects carefully.",
      "Thus, a thorough examination of both sides is necessary."
    ],
    
    "advantages_outweigh": [
      "Despite some concerns, I firmly believe that the advantages outweigh the disadvantages.",
      "While acknowledging certain drawbacks, I would argue that the benefits are more significant.",
      "Although there are some negative aspects, the overall impact is positive.",
      "On balance, the advantages of... clearly exceed any potential problems.",
      "This essay will argue that, despite some issues, the benefits are substantial.",
      "While not without flaws, the advantages make this a worthwhile development.",
      "The positives associated with this clearly outweigh the negatives.",
      "After careful analysis, it is clear the benefits are more important."
    ],
    
    "disadvantages_outweigh": [
      "While there are some benefits, I believe the disadvantages are more significant.",
      "Despite certain advantages, the drawbacks of... outweigh any positive aspects.",
      "Although supporters point to benefits, the negative consequences are more serious.",
      "This essay will argue that the problems caused by... are greater than any advantages.",
      "On balance, the disadvantages clearly outweigh the benefits.",
      "While not completely without merit, the drawbacks are too significant to ignore.",
      "The negatives associated with this clearly outweigh the positives.",
      "After thorough consideration, the problems are more important than the benefits."
    ]
  }
}
