{
  "bands": {
    "band5": {
      "number": 5,
      "title": "Good Performance",
      "color": "#10b981",
      "borderColor": "rgba(16, 185, 129, 0.3)",
      "criteria": [
        "Text is well-organized with clear progression of ideas",
        "Effective use of a variety of cohesive devices",
        "Paragraphing is well managed and supports the message",
        "Linking words are used appropriately and naturally",
        "Very few organizational errors"
      ],
      "example": "Many teenagers spend excessive time on social media. As a result, they often neglect homework and face-to-face communication. This trend has sparked concern among parents and educators. However, when used responsibly, social platforms can enhance learning. For instance, students collaborate on projects through shared documents. Nevertheless, establishing healthy boundaries remains essential for young people's development."
    },
    "band4": {
      "number": 4,
      "title": "Satisfactory Performance",
      "color": "#3b82f6",
      "borderColor": "rgba(59, 130, 246, 0.3)",
      "criteria": [
        "Text is generally well-organized with clear progression",
        "Cohesive devices are used but may be mechanical or repetitive",
        "Paragraphing is usually appropriate though not always ideal",
        "Linking words are present but usage may lack variety",
        "Some organizational weaknesses but message remains clear"
      ],
      "example": "Many teenagers spend a lot of time on social media. Because of this, they don't do homework. This is a problem for parents. But social media can be good too. For example, students can work together online. But teenagers need to be careful with social media."
    },
    "band3": {
      "number": 3,
      "title": "Modest Performance",
      "color": "#f59e0b",
      "borderColor": "rgba(245, 158, 11, 0.3)",
      "criteria": [
        "Text shows basic organization but progression may be unclear",
        "Limited range of cohesive devices, often repetitive",
        "Paragraphing is attempted but sometimes inadequate",
        "Basic linking words used (and, but, because) with limited range",
        "Organizational problems may obscure meaning at times"
      ],
      "example": "Teenagers use social media. They use it a lot. They don't study. Parents worry about this. Social media is bad. But it can be good. Students use it for school. And they talk to friends. Teenagers should be careful."
    }
  },
  "comparison": [
    {
      "aspect": "Cohesive Devices",
      "band5": "Wide range used naturally (however, furthermore, as a result, in contrast, nevertheless)",
      "band4": "Adequate range but may be mechanical (firstly, secondly, also, but, because)",
      "band3": "Basic connectors only (and, but, because, so)"
    },
    {
      "aspect": "Paragraphing",
      "band5": "Clear topic sentences, logical development, smooth transitions between paragraphs",
      "band4": "Generally clear paragraphs, though transitions may be abrupt or mechanical",
      "band3": "Paragraphs attempted but may lack clear topic focus or internal logic"
    },
    {
      "aspect": "Pronoun Reference",
      "band5": "Clear antecedents, varied pronouns (it, this, these, they, such), skillful reference chains",
      "band4": "Generally clear but may overuse 'this' or 'it' without clear antecedents",
      "band3": "Unclear references, repetitive pronouns, ambiguous 'it' or 'this'"
    },
    {
      "aspect": "Substitution",
      "band5": "Elegant variation (students → learners → young people → teenagers)",
      "band4": "Some variation but with repetition of key words",
      "band3": "Frequent repetition, limited vocabulary alternatives"
    },
    {
      "aspect": "Text Flow",
      "band5": "Ideas build logically, reader guided smoothly through argument",
      "band4": "Generally clear progression with occasional jumps or unclear connections",
      "band3": "Choppy or list-like, reader may struggle to follow connections"
    },
    {
      "aspect": "Linking Variety",
      "band5": "Sophisticated connectors showing complex relationships (despite this, whereas, given that)",
      "band4": "Standard connectors used correctly (however, although, therefore)",
      "band3": "Simple connectors repeated frequently (and, but, so, because)"
    },
    {
      "aspect": "Paragraph Structure",
      "band5": "Topic sentence + support + development + concluding statement",
      "band4": "Topic sentence + support, though development may be thin",
      "band3": "Ideas listed without clear topic sentence or development"
    },
    {
      "aspect": "Coherence",
      "band5": "All sentences clearly relate to paragraph topic; logical progression throughout",
      "band4": "Most sentences relate to topic; occasional tangential ideas",
      "band3": "Ideas may jump around; relationship to topic not always clear"
    }
  ],
  "checklist": [
    {
      "category": "Cohesive Devices",
      "items": [
        "I use a variety of linking words (not just 'and', 'but', 'because')",
        "I avoid overusing the same connectors (e.g., not 'however' in every sentence)",
        "My linking words accurately show relationships (contrast, cause-effect, exemplification)",
        "I use advanced linkers naturally (nevertheless, furthermore, consequently)"
      ]
    },
    {
      "category": "Paragraphing",
      "items": [
        "Each paragraph has a clear topic sentence",
        "Ideas within paragraphs connect logically",
        "I use transitional phrases between paragraphs",
        "Paragraph breaks support my message (not random or too frequent)"
      ]
    },
    {
      "category": "Pronoun Reference",
      "items": [
        "Every pronoun has a clear antecedent (reader knows what 'it', 'this', 'they' refers to)",
        "I avoid vague 'this' or 'it' without clarification",
        "I vary my pronouns appropriately",
        "I use demonstratives correctly (this/these for near, that/those for distant ideas)"
      ]
    },
    {
      "category": "Substitution",
      "items": [
        "I avoid repeating the same word multiple times in succession",
        "I use synonyms and paraphrases to create variety",
        "My substitutions maintain clarity (reader still understands what I mean)",
        "I use pronouns and substitution together effectively"
      ]
    },
    {
      "category": "Overall Organisation",
      "items": [
        "My introduction clearly presents my main idea",
        "Body paragraphs develop ideas with examples and explanations",
        "My conclusion summarizes without simply repeating",
        "The whole text flows logically from start to finish",
        "A reader can easily follow my argument without confusion"
      ]
    }
  ],
  "detailedExamples": {
    "cohesiveDevices": {
      "band5Example": {
        "text": "Climate change poses serious threats to coastal communities. Moreover, rising sea levels endanger infrastructure and livelihoods. However, adaptation strategies can mitigate these risks. For instance, the Netherlands has implemented innovative flood defenses. Consequently, Dutch cities remain protected despite being below sea level. Nevertheless, such solutions require substantial investment.",
        "analysis": "Uses six different connectors (moreover, however, for instance, consequently, nevertheless) showing addition, contrast, exemplification, and cause-effect relationships. Natural flow without mechanical repetition."
      },
      "band4Example": {
        "text": "Climate change is a problem for coastal cities. Also, sea levels are rising. But there are solutions. For example, the Netherlands has flood defenses. So Dutch cities are safe. But it costs a lot of money.",
        "analysis": "Uses connectors (also, but, for example, so) but with limited variety. 'But' appears twice. Connections are clear but mechanical."
      },
      "band3Example": {
        "text": "Climate change is bad. And sea levels rise. Cities have problems. But there are solutions. And the Netherlands is good. So cities are safe. But money is needed.",
        "analysis": "Repetitive use of 'and', 'but', 'so'. Limited vocabulary. Choppy sentences. Basic connections only."
      }
    },
    "paragraphing": {
      "band5Example": {
        "text": "Online learning offers flexibility that traditional education cannot match. Students can access materials at any time, review lectures multiple times, and study at their own pace. This autonomy particularly benefits working professionals and parents who must balance education with other responsibilities. Furthermore, the variety of available courses enables learners to pursue specialized interests that local institutions might not offer.\n\nDespite these advantages, online learning presents significant challenges. The lack of face-to-face interaction can lead to feelings of isolation and reduced motivation. Moreover, students must possess strong self-discipline and time management skills to succeed in virtual environments. Without the structure of regular class meetings, many learners struggle to maintain consistent progress.",
        "analysis": "Two clear paragraphs with distinct topics. First paragraph: topic sentence + three supporting points + concluding statement. Second paragraph: clear topic sentence + contrasting focus + two supporting points. Smooth transition using 'Despite these advantages'."
      },
      "band4Example": {
        "text": "Online learning is flexible. Students can study anytime. They can watch lectures again. Working people like this. There are many courses online.\n\nBut online learning has problems. Students feel lonely. They need discipline. Some students can't finish courses.",
        "analysis": "Paragraphs present but development is thin. Topic sentences present but support is list-like rather than developed. Transition is abrupt ('But')."
      },
      "band3Example": {
        "text": "Online learning is good. Students study anytime. Working people study. Many courses online. Students feel lonely. They need discipline. Some students stop. Traditional learning is better.",
        "analysis": "Ideas jump around without clear paragraph structure. No topic sentences. Ideas listed without development or logical grouping."
      }
    }
  },
  "assessmentGuidance": {
    "howToUse": [
      "Read through your essay carefully",
      "Check each item in the appropriate category",
      "Be honest - the goal is improvement, not a perfect score",
      "Focus on areas with unchecked items for your next essay",
      "Aim to check at least 18 items for Band 5 level writing"
    ],
    "scoreInterpretation": {
      "excellent": {
        "range": "18-21 items",
        "level": "Band 5",
        "description": "Excellent organisation with sophisticated cohesive devices and clear structure",
        "nextSteps": "Maintain this level. Focus on expanding vocabulary and grammatical range."
      },
      "good": {
        "range": "14-17 items",
        "level": "Band 4",
        "description": "Good organisation with room for improvement in variety and naturalness",
        "nextSteps": "Work on using a wider range of linking words naturally. Improve paragraph transitions."
      },
      "developing": {
        "range": "10-13 items",
        "level": "Band 3",
        "description": "Basic organisation present but needs significant development",
        "nextSteps": "Focus on clear topic sentences, varied connectors, and clear pronoun references."
      },
      "needsWork": {
        "range": "0-9 items",
        "level": "Below Band 3",
        "description": "Organizational skills need substantial practice",
        "nextSteps": "Start with fundamentals: topic sentences, simple connectors (however, for example), clear pronouns."
      }
    }
  },
  "practiceActivities": [
    {
      "skill": "Cohesive Devices",
      "activity": "Rewrite a paragraph using different linking words to show the same relationships",
      "example": "Original: 'Exercise is healthy. But many people don't exercise. So they have health problems.' → Improved: 'Although exercise benefits health, many people remain sedentary. Consequently, preventable health issues arise.'"
    },
    {
      "skill": "Substitution",
      "activity": "Take a paragraph and identify every repeated noun. Replace with pronouns or synonyms.",
      "example": "Students → learners → they → young people → these individuals"
    },
    {
      "skill": "Pronoun Reference",
      "activity": "Write a paragraph, then circle every pronoun and draw an arrow to its antecedent",
      "example": "Check that every 'it', 'this', 'these', 'they' clearly points to a specific noun"
    },
    {
      "skill": "Paragraphing",
      "activity": "Write a topic sentence, then add exactly three supporting sentences, then a concluding sentence",
      "example": "Topic → Support 1 → Support 2 → Support 3 → Conclusion"
    }
  ]
}
