{
  "examples": [
    {
      "id": "online-shopping",
      "topic": "Online Shopping vs Traditional Stores",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Online shopping",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Online shopping is convenient.",
          "structure": "Subject + Verb + Complement",
          "explanation": "Now we have a complete simple sentence. It has a subject (online shopping), a verb (is), and a complement (convenient). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Online shopping, <span class='addition'>allowing purchases from home</span>, is convenient.",
          "structure": "Subject + Participial Phrase + Verb + Complement",
          "explanation": "Adding a participial phrase (allowing purchases from home) explains HOW online shopping works. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Online shopping, <span class='addition'>which allows purchases from home</span>, is convenient <span class='addition'>because it saves time</span>.",
          "structure": "Subject + Relative Clause + Verb + Complement + Subordinate Clause",
          "explanation": "We've added a relative clause (which allows purchases from home) and a subordinate clause (because it saves time). This creates a complex sentence explaining both method and reason."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Online shopping, <span class='addition'>which allows purchases from home at any hour</span>, is convenient <span class='addition'>because it saves time and provides access to global products</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Complement + Extended Subordinate Clause",
          "explanation": "Now we're building longer clauses. The relative clause includes 'at any hour' (time specification), and the subordinate clause includes parallel benefits (saves time AND provides access)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Online shopping, <span class='addition'>which allows purchases from home at any hour without traveling to physical stores</span>, is convenient <span class='addition'>because it saves time and provides access to global products, particularly for busy professionals who struggle to visit shops during working hours</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with prepositional phrases (without traveling to physical stores), and a subordinate clause with an embedded relative clause and additional specificity (particularly for busy professionals who struggle to visit shops). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "working-from-home",
      "topic": "Remote Work Benefits",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Working from home",
          "structure": "Subject",
          "explanation": "This is just a gerund phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Working from home saves time.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (working from home), a verb (saves), and an object (time). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Working from home, <span class='addition'>eliminating daily commutes</span>, saves time.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (eliminating daily commutes) explains HOW working from home saves time. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Working from home, <span class='addition'>which eliminates daily commutes</span>, saves time <span class='addition'>that employees can spend with family</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "We've added a relative clause (which eliminates daily commutes) and another relative clause (that employees can spend with family). This creates a complex sentence showing both the benefit and its application."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Working from home, <span class='addition'>which eliminates daily commutes to offices in busy city centers</span>, saves time <span class='addition'>that employees can spend with family or pursuing personal interests</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Now we're building longer clauses. The first clause includes location details (to offices in busy city centers), and the second includes alternative uses (family OR personal interests)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Working from home, <span class='addition'>which eliminates daily commutes to offices in busy city centers, despite concerns about isolation and reduced collaboration</span>, saves time <span class='addition'>that employees can spend with family or pursuing personal interests, particularly for parents who need flexible schedules to manage childcare responsibilities</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with prepositional phrases and a concession (despite concerns about isolation), and an extended clause with an embedded relative clause providing specific context (particularly for parents who need flexible schedules). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "social-media-effects",
      "topic": "Social Media and Communication",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Social media platforms",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Social media platforms connect people.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (social media platforms), a verb (connect), and an object (people). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Social media platforms, <span class='addition'>used by billions worldwide</span>, connect people.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (used by billions worldwide) provides context about scale and reach. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Social media platforms, <span class='addition'>which are used by billions of people worldwide</span>, connect people <span class='addition'>who live on different continents</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "We've added a relative clause (which are used by billions of people worldwide) and another relative clause (who live on different continents). This creates a complex sentence showing both the scale and the global reach."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Social media platforms, <span class='addition'>which are used by billions of people worldwide for communication and entertainment</span>, connect people <span class='addition'>who live on different continents and might never meet face-to-face</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Now we're building longer clauses. The first clause includes purposes (for communication and entertainment), and the second emphasizes the distance factor (might never meet face-to-face)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Social media platforms, <span class='addition'>which are used by billions of people worldwide for communication and entertainment, despite growing concerns about privacy and mental health</span>, connect people <span class='addition'>who live on different continents and might never meet face-to-face, enabling families separated by migration to maintain daily contact</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with purposes and a concession (despite growing concerns about privacy and mental health), and an extended clause with distance factor and specific beneficial application (enabling families separated by migration). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "learning-languages",
      "topic": "Foreign Language Benefits",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Learning foreign languages",
          "structure": "Subject",
          "explanation": "This is just a gerund phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Learning foreign languages opens opportunities.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (learning foreign languages), a verb (opens), and an object (opportunities). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Learning foreign languages, <span class='addition'>requiring dedication and practice</span>, opens opportunities.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (requiring dedication and practice) acknowledges the effort needed. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Learning foreign languages, <span class='addition'>which requires dedication and consistent practice</span>, opens opportunities <span class='addition'>in careers and travel</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "We've added a relative clause (which requires dedication and consistent practice) and a prepositional phrase (in careers and travel). This creates a complex sentence showing both the requirements and where the opportunities appear."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Learning foreign languages, <span class='addition'>which requires dedication and consistent practice over many years</span>, opens opportunities <span class='addition'>in careers and travel, allowing people to communicate with diverse cultures</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Now we're building longer clauses. The first clause includes time frame (over many years), and the second adds a purpose clause (allowing people to communicate with diverse cultures)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Learning foreign languages, <span class='addition'>which requires dedication and consistent practice over many years, despite challenges with grammar and pronunciation</span>, opens opportunities <span class='addition'>in careers and travel, allowing people to communicate with diverse cultures and understand different worldviews, particularly valuable in an increasingly globalized job market</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with time frame and concession (despite challenges with grammar and pronunciation), and a subordinate clause with cultural benefits and specific modern relevance (particularly valuable in an increasingly globalized job market). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "childhood-obesity",
      "topic": "Child Health Solutions",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "School education programs",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "School education programs reduce obesity.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (school education programs), a verb (reduce), and an object (obesity). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "School education programs, <span class='addition'>teaching healthy eating habits</span>, reduce obesity.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (teaching healthy eating habits) explains HOW the programs work. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "School education programs, <span class='addition'>which teach children healthy eating habits</span>, reduce obesity <span class='addition'>by promoting nutritious food choices</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "We've added a relative clause (which teach children healthy eating habits) and a prepositional phrase (by promoting nutritious food choices). This creates a complex sentence showing both the target audience and the method."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "School education programs, <span class='addition'>which teach children healthy eating habits and the importance of physical activity</span>, reduce obesity <span class='addition'>by promoting nutritious food choices and regular exercise in daily routines</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Now we're building longer clauses. The first clause includes parallel education content (healthy eating AND physical activity), and the second includes detailed methods (nutritious choices AND regular exercise)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "School education programs, <span class='addition'>which teach children healthy eating habits and the importance of physical activity from an early age</span>, reduce obesity <span class='addition'>by promoting nutritious food choices and regular exercise in daily routines, helping students develop lifelong healthy behaviors that protect against serious illnesses like diabetes and heart disease</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with educational content and timing (from an early age), and a subordinate clause with methods, long-term benefits (lifelong healthy behaviors), and specific health protection (against diabetes and heart disease). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "gap-year-benefits",
      "topic": "Gap Year Before University",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Taking a gap year",
          "structure": "Subject",
          "explanation": "This is just a gerund phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Taking a gap year builds maturity.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (taking a gap year), a verb (builds), and an object (maturity). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Taking a gap year, <span class='addition'>working or traveling abroad</span>, builds maturity.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (working or traveling abroad) specifies WHAT students do during the gap year. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Taking a gap year, <span class='addition'>which involves working or traveling in foreign countries</span>, builds maturity <span class='addition'>that helps students succeed at university</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "We've added a relative clause (which involves working or traveling in foreign countries) and another relative clause (that helps students succeed at university). This creates a complex sentence showing both the activities and the benefit's application."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Taking a gap year, <span class='addition'>which involves working or traveling in foreign countries to gain independence</span>, builds maturity <span class='addition'>that helps students succeed at university by improving time management and self-discipline</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Now we're building longer clauses. The first clause includes purpose (to gain independence), and the second includes specific skills developed (time management and self-discipline)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Taking a gap year, <span class='addition'>which involves working or traveling in foreign countries to gain independence, despite parents' concerns about delaying education</span>, builds maturity <span class='addition'>that helps students succeed at university by improving time management and self-discipline, particularly benefiting those who feel unprepared for the academic demands of higher education</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with activities, purpose, and concession (despite parents' concerns), and an extended clause with specific skills, application, and ideal candidates (particularly benefiting those who feel unprepared). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "renewable-energy",
      "topic": "Environmental Solutions",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Renewable energy",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Renewable energy reduces pollution.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (renewable energy), a verb (reduces), and an object (pollution). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Renewable energy, <span class='addition'>like solar and wind power</span>, reduces pollution.",
          "structure": "Subject + Appositive Phrase + Verb + Object",
          "explanation": "Adding an appositive phrase (like solar and wind power) gives concrete examples of renewable energy types. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Renewable energy, <span class='addition'>which includes solar and wind power</span>, reduces pollution <span class='addition'>by eliminating harmful emissions</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "We've added a relative clause (which includes solar and wind power) and a prepositional phrase (by eliminating harmful emissions). This creates a complex sentence showing both the types and the mechanism."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Renewable energy, <span class='addition'>which includes solar and wind power that generate electricity cleanly</span>, reduces pollution <span class='addition'>by eliminating harmful emissions from fossil fuels like coal and gas</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Now we're building longer clauses. The first clause includes how renewables work (that generate electricity cleanly), and the second specifies what they replace (fossil fuels like coal and gas)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Renewable energy, <span class='addition'>which includes solar and wind power that generate electricity cleanly without producing greenhouse gases</span>, reduces pollution <span class='addition'>by eliminating harmful emissions from fossil fuels like coal and gas, helping countries meet international climate targets set by agreements such as the Paris Accord</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with generation method and environmental benefit (without producing greenhouse gases), and a subordinate clause with specific pollutants eliminated and global policy context (international climate targets from Paris Accord). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "advertising-children",
      "topic": "Marketing to Young People",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Advertisements aimed at children",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Advertisements aimed at children create pressure.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (advertisements aimed at children), a verb (create), and an object (pressure). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Advertisements aimed at children, <span class='addition'>promoting toys and snacks</span>, create pressure.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (promoting toys and snacks) specifies WHAT types of products are advertised. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Advertisements aimed at children, <span class='addition'>which promote expensive toys and unhealthy snacks</span>, create pressure <span class='addition'>on parents to spend money</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "We've added a relative clause with judgment (which promote expensive toys and unhealthy snacks) and a prepositional phrase (on parents to spend money). This creates a complex sentence identifying WHO feels the pressure."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Advertisements aimed at children, <span class='addition'>which promote expensive toys and unhealthy snacks during television programs</span>, create pressure <span class='addition'>on parents to spend money they cannot afford on unnecessary products</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Now we're building longer clauses. The first clause includes context (during television programs), and the second emphasizes financial strain (money they cannot afford on unnecessary products)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Advertisements aimed at children, <span class='addition'>which promote expensive toys and unhealthy snacks during television programs, using colorful animations and catchy jingles</span>, create pressure <span class='addition'>on parents to spend money they cannot afford on unnecessary products, contributing to family debt and childhood obesity problems in many developed countries</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with products, placement, and persuasive techniques (colorful animations and catchy jingles), and a subordinate clause with financial pressure and broader social consequences (family debt and childhood obesity). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "athlete-salaries",
      "topic": "Sports and Money",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Professional athletes",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Professional athletes earn high salaries.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (professional athletes), a verb (earn), and an object (high salaries). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Professional athletes, <span class='addition'>entertaining millions of fans</span>, earn high salaries.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Adding a participial phrase (entertaining millions of fans) provides justification for the high pay. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Professional athletes, <span class='addition'>who entertain millions of fans worldwide</span>, earn high salaries <span class='addition'>that reflect their popularity</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "We've added a relative clause showing scope (who entertain millions of fans worldwide) and another clause (that reflect their popularity). This creates a complex sentence explaining the salary logic."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Professional athletes, <span class='addition'>who entertain millions of fans worldwide through televised competitions</span>, earn high salaries <span class='addition'>that reflect their popularity and the revenue they generate for sponsors</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Now we're building longer clauses. The first clause includes delivery method (through televised competitions), and the second includes additional income source (revenue they generate for sponsors)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Professional athletes, <span class='addition'>who entertain millions of fans worldwide through televised competitions, despite relatively short career spans of 10-15 years</span>, earn high salaries <span class='addition'>that reflect their popularity and the revenue they generate for sponsors and broadcasters, though critics argue teachers and nurses deserve comparable compensation for their social contributions</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with global reach and career limitation (despite short career spans), and a subordinate clause with income justifications, revenue sources, and counterargument (critics argue teachers and nurses deserve comparable compensation). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "family-size",
      "topic": "Large vs Small Families",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Large families",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Large families teach social skills.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (large families), a verb (teach), and an object (social skills). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Large families, <span class='addition'>with multiple siblings</span>, teach social skills.",
          "structure": "Subject + Prepositional Phrase + Verb + Object",
          "explanation": "Adding a prepositional phrase (with multiple siblings) clarifies what makes a family 'large'. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Large families, <span class='addition'>where children grow up with several siblings</span>, teach social skills <span class='addition'>like sharing and cooperation</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Appositive Phrase",
          "explanation": "We've added a relative clause (where children grow up with several siblings) and an appositive (like sharing and cooperation). This creates a complex sentence specifying WHICH social skills."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Large families, <span class='addition'>where children grow up with several siblings in shared living spaces</span>, teach social skills <span class='addition'>like sharing and cooperation that prepare children for adult relationships</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Appositive",
          "explanation": "Now we're building longer clauses. The first clause includes context (in shared living spaces), and the second includes long-term benefit (that prepare children for adult relationships)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Large families, <span class='addition'>where children grow up with several siblings in shared living spaces, despite financial challenges of supporting more dependents</span>, teach social skills <span class='addition'>like sharing and cooperation that prepare children for adult relationships, making them more empathetic and adaptable in professional environments where teamwork is essential</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with living situation and realistic challenge (despite financial challenges), and an extended clause with specific skills, relationship preparation, and professional application (empathetic and adaptable in professional environments). Notice how each addition provides specific, relevant detail."
        }
      ]
    }
  ]
}
