{
  "examples": [
    {
      "id": "online-shopping",
      "topic": "Online Shopping vs Traditional Stores",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Online shopping",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Online shopping is convenient.",
          "structure": "Subject + Verb + Complement",
          "explanation": "Now we have a complete simple sentence. It has a subject (online shopping), a verb (is), and a complement (convenient). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Online shopping, <span class='part-addition'>allowing purchases from home</span>, is convenient.",
          "structure": "Subject + Participial Phrase + Verb + Complement",
          "explanation": "Adding a participial phrase (allowing purchases from home) explains HOW online shopping works. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Online shopping, <span class='part-addition'>which allows purchases from home</span>, is convenient <span class='part-addition'>because it saves time</span>.",
          "structure": "Subject + Relative Clause + Verb + Complement + Subordinate Clause",
          "explanation": "We've added a relative clause (which allows purchases from home) and a subordinate clause (because it saves time). This creates a complex sentence explaining both method and reason."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Online shopping, <span class='part-addition'>which allows purchases from home at any hour</span>, is convenient <span class='part-addition'>because it saves time and provides access to global products</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Complement + Extended Subordinate Clause",
          "explanation": "Now we're building longer clauses. The relative clause includes 'at any hour' (prepositional phrase), and the subordinate clause includes parallel benefits (saves time AND provides access)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Online shopping, <span class='part-addition'>which allows purchases from home at any hour without traveling to physical stores</span>, is convenient <span class='part-addition'>because it saves time and provides access to global products, particularly for busy professionals who struggle to visit shops during working hours</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with prepositional phrases, and a subordinate clause with an embedded relative clause (particularly for busy professionals who struggle to visit shops). Each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "working-from-home",
      "topic": "Remote Work Benefits",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Working from home",
          "structure": "Subject",
          "explanation": "Just a gerund phrase. The reader is left wondering: what about working from home?"
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Working from home saves time.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence with subject-verb-object structure. It makes a clear statement."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Working from home, <span class='part-addition'>eliminating daily commutes</span>, saves time.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "A participial phrase (eliminating daily commutes) explains HOW working from home saves time. This makes the sentence more concrete and informative."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Working from home, <span class='part-addition'>which eliminates daily commutes</span>, saves time <span class='part-addition'>that employees can spend with family</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "A relative clause (which eliminates daily commutes) explains the method, and another relative clause (that employees can spend with family) shows the benefit of saved time."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Working from home, <span class='part-addition'>which eliminates daily commutes to offices in busy city centers</span>, saves time <span class='part-addition'>that employees can spend with family or pursuing personal interests</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Extended the first clause with location details (to offices in busy city centers), and expanded the benefit with alternatives (family OR personal interests)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Working from home, <span class='part-addition'>which eliminates daily commutes to offices in busy city centers, despite concerns about isolation and reduced collaboration</span>, saves time <span class='part-addition'>that employees can spend with family or pursuing personal interests, particularly for parents who need flexible schedules to manage childcare responsibilities</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Fully complex sentence acknowledging counterarguments (despite concerns about isolation) while maintaining the main argument. The second clause includes embedded details (particularly for parents who need flexible schedules) for specific context."
        }
      ]
    },
    {
      "id": "social-media-effects",
      "topic": "Social Media and Communication",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Social media platforms",
          "structure": "Subject",
          "explanation": "Incomplete - just a noun phrase without a verb or complete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Social media platforms connect people.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple declarative sentence making a clear claim about social media's function."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Social media platforms, <span class='part-addition'>used by billions worldwide</span>, connect people.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (used by billions worldwide) provides context about scale and reach. Shows passive construction."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Social media platforms, <span class='part-addition'>which are used by billions of people worldwide</span>, connect people <span class='part-addition'>who live on different continents</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "Two relative clauses: one modifying the subject (which are used...) and one modifying the object (who live...). Shows global reach."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Social media platforms, <span class='part-addition'>which are used by billions of people worldwide for communication and entertainment</span>, connect people <span class='part-addition'>who live on different continents and might never meet face-to-face</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Extended both clauses: added purposes (for communication and entertainment) and emphasized distance (might never meet face-to-face)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Social media platforms, <span class='part-addition'>which are used by billions of people worldwide for communication and entertainment, despite growing concerns about privacy and mental health</span>, connect people <span class='part-addition'>who live on different continents and might never meet face-to-face, enabling families separated by migration to maintain daily contact</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete nuanced sentence with: scale and purposes, concession acknowledging concerns (despite growing concerns), main function, distance factor, and specific beneficial use case (enabling families separated by migration). This presents a balanced perspective."
        }
      ]
    },
    {
      "id": "learning-languages",
      "topic": "Foreign Language Benefits",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Learning foreign languages",
          "structure": "Subject",
          "explanation": "Just a subject without predicate - incomplete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Learning foreign languages opens opportunities.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence stating a key benefit of language learning."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Learning foreign languages, <span class='part-addition'>requiring dedication and practice</span>, opens opportunities.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (requiring dedication and practice) acknowledges the effort needed - provides realistic context."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Learning foreign languages, <span class='part-addition'>which requires dedication and consistent practice</span>, opens opportunities <span class='part-addition'>in careers and travel</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause explains requirements, and prepositional phrase (in careers and travel) specifies WHERE opportunities appear."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Learning foreign languages, <span class='part-addition'>which requires dedication and consistent practice over many years</span>, opens opportunities <span class='part-addition'>in careers and travel, allowing people to communicate with diverse cultures</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Phrase",
          "explanation": "Added time frame (over many years) and expanded benefits with purpose clause (allowing people to communicate with diverse cultures)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Learning foreign languages, <span class='part-addition'>which requires dedication and consistent practice over many years, despite challenges with grammar and pronunciation</span>, opens opportunities <span class='part-addition'>in careers and travel, allowing people to communicate with diverse cultures and understand different worldviews, particularly valuable in an increasingly globalized job market</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete perspective with: effort requirements, honest acknowledgment of difficulties (despite challenges with grammar and pronunciation), practical benefits, cultural advantages, and specific modern relevance (particularly valuable in an increasingly globalized job market)."
        }
      ]
    },
    {
      "id": "childhood-obesity",
      "topic": "Child Health Solutions",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "School education programs",
          "structure": "Subject",
          "explanation": "Noun phrase only - not a complete sentence."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "School education programs reduce obesity.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence stating a solution to a problem."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "School education programs, <span class='part-addition'>teaching healthy eating habits</span>, reduce obesity.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (teaching healthy eating habits) explains HOW the programs work - identifies the mechanism."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "School education programs, <span class='part-addition'>which teach children healthy eating habits</span>, reduce obesity <span class='part-addition'>by promoting nutritious food choices</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause (which teach children healthy eating habits) and prepositional phrase (by promoting nutritious food choices) showing both target audience and method."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "School education programs, <span class='part-addition'>which teach children healthy eating habits and the importance of physical activity</span>, reduce obesity <span class='part-addition'>by promoting nutritious food choices and regular exercise in daily routines</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Expanded education content (healthy eating AND physical activity) and detailed methods (nutritious choices AND regular exercise)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "School education programs, <span class='part-addition'>which teach children healthy eating habits and the importance of physical activity from an early age</span>, reduce obesity <span class='part-addition'>by promoting nutritious food choices and regular exercise in daily routines, helping students develop lifelong healthy behaviors that protect against serious illnesses like diabetes and heart disease</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive sentence with: educational content, timing emphasis (from an early age), immediate methods, long-term benefits (lifelong healthy behaviors), and serious health protection (against diabetes and heart disease). This shows both immediate and future value."
        }
      ]
    },
    {
      "id": "gap-year-benefits",
      "topic": "Gap Year Before University",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Taking a gap year",
          "structure": "Subject",
          "explanation": "Incomplete - missing verb and predicate."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Taking a gap year builds maturity.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence with gerund subject showing a key benefit."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Taking a gap year, <span class='part-addition'>working or traveling abroad</span>, builds maturity.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (working or traveling abroad) specifies WHAT students do during the gap year."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Taking a gap year, <span class='part-addition'>which involves working or traveling in foreign countries</span>, builds maturity <span class='part-addition'>that helps students succeed at university</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "Relative clause details activities (which involves working or traveling) and second clause (that helps students succeed) shows the benefit's application."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Taking a gap year, <span class='part-addition'>which involves working or traveling in foreign countries to gain independence</span>, builds maturity <span class='part-addition'>that helps students succeed at university by improving time management and self-discipline</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Added purpose (to gain independence) and specific skills developed (time management and self-discipline)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Taking a gap year, <span class='part-addition'>which involves working or traveling in foreign countries to gain independence, despite parents' concerns about delaying education</span>, builds maturity <span class='part-addition'>that helps students succeed at university by improving time management and self-discipline, particularly benefiting those who feel unprepared for the academic demands of higher education</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete balanced argument with: activities and purpose, acknowledgment of opposition (despite parents' concerns), main benefit, specific skills gained, and identification of ideal candidates (those who feel unprepared). This presents a nuanced, fair perspective."
        }
      ]
    },
    {
      "id": "environmental-pollution",
      "topic": "Pollution Solutions",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Renewable energy",
          "structure": "Subject",
          "explanation": "Just a topic - not a complete sentence."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Renewable energy reduces pollution.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence stating the environmental benefit clearly."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Renewable energy, <span class='part-addition'>like solar and wind power</span>, reduces pollution.",
          "structure": "Subject + Appositive Phrase + Verb + Object",
          "explanation": "Appositive phrase (like solar and wind power) gives concrete examples of renewable energy types."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Renewable energy, <span class='part-addition'>which includes solar and wind power</span>, reduces pollution <span class='part-addition'>by eliminating harmful emissions</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause lists types and prepositional phrase (by eliminating harmful emissions) explains HOW it reduces pollution."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Renewable energy, <span class='part-addition'>which includes solar and wind power that generate electricity cleanly</span>, reduces pollution <span class='part-addition'>by eliminating harmful emissions from fossil fuels like coal and gas</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Extended how renewables work (that generate electricity cleanly) and specified what they replace (fossil fuels like coal and gas)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Renewable energy, <span class='part-addition'>which includes solar and wind power that generate electricity cleanly without producing greenhouse gases</span>, reduces pollution <span class='part-addition'>by eliminating harmful emissions from fossil fuels like coal and gas, helping countries meet international climate targets set by agreements such as the Paris Accord</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive solution with: technology types, clean generation method (without producing greenhouse gases), specific pollutants eliminated, and global policy context (international climate targets from Paris Accord). Shows both local and global impact."
        }
      ]
    },
    {
      "id": "advertising-children",
      "topic": "Advertising to Children",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Advertisements aimed at children",
          "structure": "Subject",
          "explanation": "Incomplete thought - just a noun phrase without a predicate."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Advertisements aimed at children create pressure.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence identifying a key concern about child-targeted marketing."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Advertisements aimed at children, <span class='part-addition'>promoting toys and snacks</span>, create pressure.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (promoting toys and snacks) specifies WHAT types of products are advertised to children."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Advertisements aimed at children, <span class='part-addition'>which promote expensive toys and unhealthy snacks</span>, create pressure <span class='part-addition'>on parents to spend money</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause adds judgment (expensive, unhealthy) and prepositional phrase (on parents to spend money) identifies WHO feels the pressure."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Advertisements aimed at children, <span class='part-addition'>which promote expensive toys and unhealthy snacks during television programs</span>, create pressure <span class='part-addition'>on parents to spend money they cannot afford on unnecessary products</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Added context (during television programs) and emphasized financial strain (money they cannot afford on unnecessary products)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Advertisements aimed at children, <span class='part-addition'>which promote expensive toys and unhealthy snacks during television programs, using colorful animations and catchy jingles</span>, create pressure <span class='part-addition'>on parents to spend money they cannot afford on unnecessary products, contributing to family debt and childhood obesity problems in many developed countries</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete critical analysis with: product types, placement, persuasive techniques (colorful animations and catchy jingles), financial pressure, and broader social consequences (family debt and childhood obesity in developed countries). Shows individual and societal impact."
        }
      ]
    },
    {
      "id": "sports-money",
      "topic": "Athlete Salaries",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Professional athletes",
          "structure": "Subject",
          "explanation": "Just a subject - needs a verb to form a sentence."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Professional athletes earn high salaries.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete sentence stating a fact about athlete compensation."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Professional athletes, <span class='part-addition'>entertaining millions of fans</span>, earn high salaries.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (entertaining millions of fans) provides justification for the high pay."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Professional athletes, <span class='part-addition'>who entertain millions of fans worldwide</span>, earn high salaries <span class='part-addition'>that reflect their popularity</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "Relative clause shows scope (worldwide) and second clause (that reflect their popularity) explains the salary logic."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Professional athletes, <span class='part-addition'>who entertain millions of fans worldwide through televised competitions</span>, earn high salaries <span class='part-addition'>that reflect their popularity and the revenue they generate for sponsors</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Added delivery method (through televised competitions) and additional income source (revenue they generate for sponsors)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Professional athletes, <span class='part-addition'>who entertain millions of fans worldwide through televised competitions, despite relatively short career spans of 10-15 years</span>, earn high salaries <span class='part-addition'>that reflect their popularity and the revenue they generate for sponsors and broadcasters, though critics argue teachers and nurses deserve comparable compensation for their social contributions</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Balanced perspective with: global reach, career limitation acknowledgment (despite short career spans), income justifications, revenue sources (sponsors and broadcasters), and counterargument (critics argue teachers and nurses deserve comparable compensation). Presents both sides fairly."
        }
      ]
    },
    {
      "id": "family-size",
      "topic": "Large vs Small Families",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Large families",
          "structure": "Subject",
          "explanation": "Incomplete - needs a verb and complete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Large families teach social skills.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence identifying a key advantage of large families."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Large families, <span class='part-addition'>with multiple siblings</span>, teach social skills.",
          "structure": "Subject + Prepositional Phrase + Verb + Object",
          "explanation": "Prepositional phrase (with multiple siblings) clarifies what makes a family 'large'."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Large families, <span class='part-addition'>where children grow up with several siblings</span>, teach social skills <span class='part-addition'>like sharing and cooperation</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Appositive Phrase",
          "explanation": "Relative clause (where children grow up) and appositive (like sharing and cooperation) specifying WHICH social skills."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Large families, <span class='part-addition'>where children grow up with several siblings in shared living spaces</span>, teach social skills <span class='part-addition'>like sharing and cooperation that prepare children for adult relationships</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Appositive",
          "explanation": "Added context (in shared living spaces) and long-term benefit (that prepare children for adult relationships)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Large families, <span class='part-addition'>where children grow up with several siblings in shared living spaces, despite financial challenges of supporting more dependents</span>, teach social skills <span class='part-addition'>like sharing and cooperation that prepare children for adult relationships, making them more empathetic and adaptable in professional environments where teamwork is essential</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete analysis with: living situation, realistic challenge acknowledgment (despite financial challenges), specific skills, relationship preparation, and professional application (empathetic and adaptable in professional environments). Shows both immediate and career-long benefits."
        }
      ]
    }
  ]
}
