{
  "examples": [
    {
      "id": "policy-effectiveness",
      "topic": "Policy Effectiveness",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "The new policy",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "The new policy is effective.",
          "structure": "Subject + Verb + Complement",
          "explanation": "Now we have a complete simple sentence. It has a subject (the new policy), a verb (is), and a complement (effective). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "The new policy, <span class='highlight'>introduced last year</span>, is effective.",
          "structure": "Subject + Participial Phrase + Verb + Complement",
          "explanation": "Adding a participial phrase (introduced last year) gives context about when the policy started. The phrase is set off by commas because it's extra information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "The new policy, <span class='highlight'>which was introduced last year</span>, is effective <span class='highlight'>because it addresses the core problems</span>.",
          "structure": "Subject + Relative Clause + Verb + Complement + Subordinate Clause",
          "explanation": "We've added a relative clause (which was introduced last year) and a subordinate clause (because it addresses the core problems). This creates a complex sentence with multiple clauses."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "The new policy, <span class='highlight'>which was introduced last year by the government</span>, is effective <span class='highlight'>because it addresses the core problems that citizens have been facing for decades</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Complement + Extended Subordinate Clause",
          "explanation": "Now we're building longer clauses. The relative clause includes 'by the government' (prepositional phrase), and the subordinate clause includes 'that citizens have been facing for decades' (embedded relative clause)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "The new policy, <span class='highlight'>which was introduced last year by the government in response to public pressure</span>, is effective <span class='highlight'>because it addresses the core problems that citizens have been facing for decades, particularly in rural areas where resources are limited</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "This is a fully developed complex sentence. It includes: a main clause, an extended relative clause with prepositional phrases (in response to public pressure), and a subordinate clause with an embedded relative clause and additional prepositional phrases (in rural areas where resources are limited). Notice how each addition provides specific, relevant detail."
        }
      ]
    },
    {
      "id": "environmental-conservation",
      "topic": "Environmental Conservation",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Renewable energy sources",
          "structure": "Subject",
          "explanation": "Just a noun phrase. The reader is left wondering: what about renewable energy sources?"
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Renewable energy sources are essential.",
          "structure": "Subject + Verb + Complement",
          "explanation": "Complete simple sentence with subject-verb-complement structure. It makes a clear statement."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Renewable energy sources, <span class='highlight'>such as solar and wind power</span>, are essential.",
          "structure": "Subject + Appositive Phrase + Verb + Complement",
          "explanation": "An appositive phrase (such as solar and wind power) gives specific examples. This makes the sentence more concrete and informative."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Renewable energy sources, <span class='highlight'>such as solar and wind power</span>, are essential <span class='highlight'>if we want to combat climate change</span>.",
          "structure": "Subject + Appositive + Verb + Complement + Conditional Clause",
          "explanation": "A conditional clause (if we want to combat climate change) adds purpose and reason. It shows the consequence or goal."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Renewable energy sources, <span class='highlight'>such as solar and wind power, which are becoming increasingly affordable</span>, are essential <span class='highlight'>if we want to combat climate change and reduce our dependence on fossil fuels</span>.",
          "structure": "Subject + Appositive + Relative Clause + Verb + Complement + Extended Conditional Clause",
          "explanation": "Added a relative clause (which are becoming increasingly affordable) within the appositive, and extended the conditional clause with parallel structure (combat climate change AND reduce dependence)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Renewable energy sources, <span class='highlight'>such as solar and wind power, which are becoming increasingly affordable thanks to technological advances</span>, are essential <span class='highlight'>if we want to combat climate change and reduce our dependence on fossil fuels, particularly in developing nations where energy demand is rising rapidly</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Fully developed sentence with: main clause, appositive with embedded relative clause and prepositional phrase (thanks to technological advances), and extended conditional clause with additional detail (particularly in developing nations where energy demand is rising rapidly). Each clause adds specific, relevant information."
        }
      ]
    },
    {
      "id": "educational-technology",
      "topic": "Educational Technology",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Online learning platforms",
          "structure": "Subject",
          "explanation": "Incomplete - just a noun phrase without a verb or complete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Online learning platforms offer flexibility.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence. Subject (online learning platforms) + verb (offer) + object (flexibility)."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Online learning platforms, <span class='highlight'>used by millions of students worldwide</span>, offer flexibility.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (used by millions of students worldwide) provides context about scale and reach. Shows passive construction."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Online learning platforms, <span class='highlight'>which are used by millions of students worldwide</span>, offer flexibility <span class='highlight'>that traditional classrooms cannot match</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "Two relative clauses: one modifying the subject (which are used...) and one modifying the object (that traditional classrooms cannot match). Creates comparison."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Online learning platforms, <span class='highlight'>which are used by millions of students worldwide in various subjects ranging from mathematics to languages</span>, offer flexibility <span class='highlight'>that traditional classrooms cannot match, especially for working professionals and parents</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Extended both relative clauses: added subject variety (ranging from mathematics to languages) and beneficiary detail (especially for working professionals and parents)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Online learning platforms, <span class='highlight'>which are used by millions of students worldwide in various subjects ranging from mathematics to languages, despite concerns about screen time and isolation</span>, offer flexibility <span class='highlight'>that traditional classrooms cannot match, especially for working professionals and parents who need to balance education with other responsibilities</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Fully complex sentence acknowledging counterarguments (despite concerns about screen time and isolation) while maintaining the main argument. The second relative clause includes embedded clause (who need to balance education with other responsibilities) for specific detail."
        }
      ]
    },
    {
      "id": "social-media-impact",
      "topic": "Social Media Impact",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Social media platforms",
          "structure": "Subject",
          "explanation": "Just a subject without predicate - incomplete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Social media platforms influence public opinion.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple declarative sentence making a clear claim."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Social media platforms, <span class='highlight'>through algorithms and targeted content</span>, influence public opinion.",
          "structure": "Subject + Prepositional Phrase + Verb + Object",
          "explanation": "Prepositional phrase (through algorithms and targeted content) explains the mechanism - HOW they influence opinion."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Social media platforms, <span class='highlight'>through algorithms that prioritize engagement over accuracy</span>, influence public opinion <span class='highlight'>in ways that can undermine democratic discourse</span>.",
          "structure": "Subject + Extended Prepositional Phrase + Verb + Object + Prepositional Phrase with Relative Clause",
          "explanation": "Added relative clause within prepositional phrase (that prioritize engagement over accuracy) and consequence clause (in ways that can undermine democratic discourse)."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Social media platforms, <span class='highlight'>through algorithms that prioritize engagement over accuracy and create filter bubbles</span>, influence public opinion <span class='highlight'>in ways that can undermine democratic discourse by reinforcing existing biases and limiting exposure to diverse viewpoints</span>.",
          "structure": "Subject + Extended Prepositional Phrase + Verb + Object + Extended Consequence Clause",
          "explanation": "Extended mechanism (create filter bubbles) and expanded consequence with specific effects (by reinforcing existing biases and limiting exposure to diverse viewpoints)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Social media platforms, <span class='highlight'>through algorithms that prioritize engagement over accuracy and create filter bubbles, despite claims by tech companies that they promote free expression</span>, influence public opinion <span class='highlight'>in ways that can undermine democratic discourse by reinforcing existing biases and limiting exposure to diverse viewpoints, particularly during election campaigns when misinformation spreads rapidly</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete argument with: mechanism (algorithms), concession (despite claims by tech companies), main claim (influence public opinion), consequence (undermine democratic discourse), specific effects (reinforcing biases, limiting exposure), and context (particularly during election campaigns when misinformation spreads rapidly). This sentence presents a nuanced, well-supported argument."
        }
      ]
    },
    {
      "id": "urban-planning",
      "topic": "Urban Planning",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Modern cities",
          "structure": "Subject",
          "explanation": "Noun phrase only - not a complete sentence."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Modern cities face infrastructure challenges.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence stating a problem."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Modern cities, <span class='highlight'>with growing populations</span>, face infrastructure challenges.",
          "structure": "Subject + Prepositional Phrase + Verb + Object",
          "explanation": "Prepositional phrase (with growing populations) explains why the challenges exist - identifies the cause."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Modern cities, <span class='highlight'>whose populations are growing rapidly</span>, face infrastructure challenges <span class='highlight'>that require innovative solutions</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Relative Clause",
          "explanation": "Possessive relative clause (whose populations are growing rapidly) and second relative clause (that require innovative solutions) showing both cause and implication."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Modern cities, <span class='highlight'>whose populations are growing rapidly due to urbanization and economic opportunities</span>, face infrastructure challenges <span class='highlight'>that require innovative solutions combining sustainable design with smart technology</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Relative Clause",
          "explanation": "Expanded causes (due to urbanization and economic opportunities) and detailed solutions (combining sustainable design with smart technology)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Modern cities, <span class='highlight'>whose populations are growing rapidly due to urbanization and economic opportunities, particularly in developing nations where rural-to-urban migration is accelerating</span>, face infrastructure challenges <span class='highlight'>that require innovative solutions combining sustainable design with smart technology, despite limited budgets and competing priorities in areas such as education and healthcare</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Full complexity with: possessive relative clause, specific context (particularly in developing nations where rural-to-urban migration is accelerating), main claim, solution requirements, and realistic constraints (despite limited budgets and competing priorities in areas such as education and healthcare). This presents the issue comprehensively."
        }
      ]
    },
    {
      "id": "workplace-automation",
      "topic": "Workplace Automation",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Artificial intelligence systems",
          "structure": "Subject",
          "explanation": "Incomplete - missing verb and predicate."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Artificial intelligence systems are transforming workplaces.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence with progressive verb (are transforming) showing ongoing action."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Artificial intelligence systems, <span class='highlight'>now widely deployed across industries</span>, are transforming workplaces.",
          "structure": "Subject + Adverbial Phrase + Verb + Object",
          "explanation": "Adverbial phrase (now widely deployed across industries) provides timing and scope information."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Artificial intelligence systems, <span class='highlight'>which are now widely deployed across industries from manufacturing to finance</span>, are transforming workplaces <span class='highlight'>in both positive and concerning ways</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause with specific examples (from manufacturing to finance) and balanced assessment (in both positive and concerning ways)."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Artificial intelligence systems, <span class='highlight'>which are now widely deployed across industries from manufacturing to finance, automating tasks that were once performed exclusively by humans</span>, are transforming workplaces <span class='highlight'>in both positive and concerning ways, creating efficiency gains while raising questions about job security</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Assessment Phrase",
          "explanation": "Added specific function (automating tasks that were once performed exclusively by humans) and balanced consequences (creating efficiency gains while raising questions about job security)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Artificial intelligence systems, <span class='highlight'>which are now widely deployed across industries from manufacturing to finance, automating tasks that were once performed exclusively by humans and learning from vast datasets in real-time</span>, are transforming workplaces <span class='highlight'>in both positive and concerning ways, creating efficiency gains while raising questions about job security, particularly for workers in routine roles who may lack the skills needed for emerging positions</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive sentence with: subject, extended relative clause describing capabilities (learning from vast datasets in real-time), main predicate, balanced assessment, and specific vulnerable population (particularly for workers in routine roles who may lack the skills needed for emerging positions). This acknowledges both opportunities and challenges."
        }
      ]
    },
    {
      "id": "global-healthcare",
      "topic": "Global Healthcare Access",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Telemedicine services",
          "structure": "Subject",
          "explanation": "Incomplete thought - just a noun phrase without a predicate."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Telemedicine services improve healthcare access.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple, complete sentence making a direct statement about telemedicine's benefit."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Telemedicine services, <span class='highlight'>connecting patients with doctors remotely</span>, improve healthcare access.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (connecting patients with doctors remotely) explains HOW telemedicine works."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Telemedicine services, <span class='highlight'>which connect patients with doctors through video consultations</span>, improve healthcare access <span class='highlight'>for people living in remote areas</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause adds specific method (video consultations) and prepositional phrase identifies beneficiaries (people in remote areas)."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Telemedicine services, <span class='highlight'>which connect patients with doctors through video consultations and mobile health apps</span>, improve healthcare access <span class='highlight'>for people living in remote areas where medical facilities are scarce or non-existent</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Extended the methods (adding mobile health apps) and specified the severity of the problem (where medical facilities are scarce or non-existent)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Telemedicine services, <span class='highlight'>which connect patients with doctors through video consultations and mobile health apps, despite challenges related to internet connectivity and digital literacy</span>, improve healthcare access <span class='highlight'>for people living in remote areas where medical facilities are scarce or non-existent, particularly benefiting elderly patients and those with chronic conditions who require regular monitoring</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete analysis including: methods, challenges (despite challenges related to internet connectivity and digital literacy), main benefit, context (remote areas), and specific beneficiaries (elderly patients and those with chronic conditions who require regular monitoring)."
        }
      ]
    },
    {
      "id": "cultural-preservation",
      "topic": "Cultural Heritage",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Indigenous languages",
          "structure": "Subject",
          "explanation": "Just a subject - no complete thought expressed."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Indigenous languages are disappearing.",
          "structure": "Subject + Verb",
          "explanation": "Complete simple sentence with an intransitive verb showing a concerning trend."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Indigenous languages, <span class='highlight'>spoken by small communities worldwide</span>, are disappearing.",
          "structure": "Subject + Participial Phrase + Verb",
          "explanation": "Participial phrase (spoken by small communities worldwide) provides context about who uses these languages."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Indigenous languages, <span class='highlight'>which are spoken by increasingly small communities</span>, are disappearing <span class='highlight'>as younger generations adopt dominant languages</span>.",
          "structure": "Subject + Relative Clause + Verb + Adverbial Clause",
          "explanation": "Relative clause shows the declining speaker base, while adverbial clause (as younger generations adopt dominant languages) explains WHY this is happening."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Indigenous languages, <span class='highlight'>which are spoken by increasingly small communities in regions ranging from the Amazon to the Arctic</span>, are disappearing <span class='highlight'>as younger generations adopt dominant languages for education and employment opportunities</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Extended Adverbial Clause",
          "explanation": "Added geographic scope (from the Amazon to the Arctic) and specific reasons for language shift (for education and employment opportunities)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Indigenous languages, <span class='highlight'>which are spoken by increasingly small communities in regions ranging from the Amazon to the Arctic, despite efforts by linguists and cultural organizations to document and preserve them</span>, are disappearing <span class='highlight'>as younger generations adopt dominant languages for education and employment opportunities, resulting in the loss of unique worldviews and traditional knowledge systems that have been passed down for millennia</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive sentence with: geographic context, concession acknowledging preservation efforts (despite efforts by linguists and cultural organizations), main problem, immediate cause (language adoption), and profound consequence (resulting in the loss of unique worldviews and traditional knowledge systems that have been passed down for millennia)."
        }
      ]
    },
    {
      "id": "space-exploration",
      "topic": "Space Exploration",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Private space companies",
          "structure": "Subject",
          "explanation": "Incomplete - needs a verb to form a sentence."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Private space companies are revolutionizing space travel.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete sentence with progressive verb (are revolutionizing) showing ongoing change."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Private space companies, <span class='highlight'>developing reusable rockets</span>, are revolutionizing space travel.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (developing reusable rockets) shows their key innovation."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Private space companies, <span class='highlight'>which have developed reusable rocket technology</span>, are revolutionizing space travel <span class='highlight'>by dramatically reducing launch costs</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause specifies the achievement and prepositional phrase (by dramatically reducing launch costs) explains the impact."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Private space companies, <span class='highlight'>which have developed reusable rocket technology and autonomous spacecraft systems</span>, are revolutionizing space travel <span class='highlight'>by dramatically reducing launch costs and making commercial spaceflight economically viable</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Added technologies (autonomous spacecraft systems) and expanded impacts (making commercial spaceflight economically viable)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Private space companies, <span class='highlight'>which have developed reusable rocket technology and autonomous spacecraft systems, building on decades of government-funded research</span>, are revolutionizing space travel <span class='highlight'>by dramatically reducing launch costs and making commercial spaceflight economically viable, opening new possibilities for satellite deployment, space tourism, and even planetary colonization in the coming decades</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete perspective including: innovations, acknowledgment of foundation (building on decades of government-funded research), main impact, immediate effects (reducing costs, enabling commercial viability), and future possibilities (satellite deployment, space tourism, and planetary colonization)."
        }
      ]
    },
    {
      "id": "ocean-conservation",
      "topic": "Marine Ecosystems",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Coral reefs",
          "structure": "Subject",
          "explanation": "Incomplete thought - just a noun phrase."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Coral reefs support marine biodiversity.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence stating the ecological role of coral reefs."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Coral reefs, <span class='highlight'>covering less than 1% of the ocean floor</span>, support marine biodiversity.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (covering less than 1% of the ocean floor) emphasizes their small size relative to their importance."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Coral reefs, <span class='highlight'>which cover less than 1% of the ocean floor</span>, support marine biodiversity <span class='highlight'>by providing habitat for approximately 25% of all marine species</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause states the coverage, and prepositional phrase (by providing habitat for approximately 25% of all marine species) quantifies their ecological importance."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Coral reefs, <span class='highlight'>which cover less than 1% of the ocean floor yet contain the highest biodiversity of any marine ecosystem</span>, support marine biodiversity <span class='highlight'>by providing habitat for approximately 25% of all marine species and serving as crucial nurseries for fish populations</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Extended relative clause adds comparative context (highest biodiversity) and prepositional phrase includes additional function (serving as crucial nurseries)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Coral reefs, <span class='highlight'>which cover less than 1% of the ocean floor yet contain the highest biodiversity of any marine ecosystem, despite facing severe threats from ocean acidification and rising temperatures</span>, support marine biodiversity <span class='highlight'>by providing habitat for approximately 25% of all marine species and serving as crucial nurseries for fish populations, while also protecting coastlines from erosion and supporting the livelihoods of millions of people who depend on fishing and tourism</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive sentence addressing: scale and uniqueness, threats (despite facing severe threats from ocean acidification and rising temperatures), ecological functions (habitat and nurseries), and human benefits (protecting coastlines, supporting livelihoods through fishing and tourism)."
        }
      ]
    },
    {
      "id": "food-security",
      "topic": "Agricultural Innovation",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Vertical farming",
          "structure": "Subject",
          "explanation": "Just a topic - not a complete sentence."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Vertical farming maximizes crop yields.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence stating the main benefit of vertical farming."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Vertical farming, <span class='highlight'>growing crops in stacked layers indoors</span>, maximizes crop yields.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (growing crops in stacked layers indoors) explains what vertical farming is."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Vertical farming, <span class='highlight'>which grows crops in stacked layers using controlled environments</span>, maximizes crop yields <span class='highlight'>while using significantly less land than traditional agriculture</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Adverbial Clause",
          "explanation": "Relative clause details the method (controlled environments) and adverbial clause (while using significantly less land) introduces a key advantage."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Vertical farming, <span class='highlight'>which grows crops in stacked layers using controlled environments with LED lighting and hydroponic systems</span>, maximizes crop yields <span class='highlight'>while using significantly less land and water than traditional agriculture, producing food year-round regardless of weather conditions</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Adverbial Clause",
          "explanation": "Extended technologies (LED lighting and hydroponic systems) and added benefits (less water usage, year-round production, weather independence)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Vertical farming, <span class='highlight'>which grows crops in stacked layers using controlled environments with LED lighting and hydroponic systems, despite high initial investment costs and energy requirements</span>, maximizes crop yields <span class='highlight'>while using significantly less land and water than traditional agriculture, producing food year-round regardless of weather conditions and reducing the need for pesticides and long-distance transportation in urban areas where fresh produce is often scarce</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete analysis with: technical details, challenges (despite high initial investment costs and energy requirements), resource efficiency, production advantages, and urban food security benefits (reducing pesticides and transportation needs where fresh produce is scarce)."
        }
      ]
    },
    {
      "id": "mental-health",
      "topic": "Mental Health Awareness",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Mindfulness practices",
          "structure": "Subject",
          "explanation": "Incomplete - lacks a verb and complete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Mindfulness practices reduce stress.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence stating a key benefit of mindfulness."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Mindfulness practices, <span class='highlight'>including meditation and breathing exercises</span>, reduce stress.",
          "structure": "Subject + Appositive Phrase + Verb + Object",
          "explanation": "Appositive phrase (including meditation and breathing exercises) provides specific examples of mindfulness practices."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Mindfulness practices, <span class='highlight'>which include meditation and breathing exercises</span>, reduce stress <span class='highlight'>by helping individuals focus on the present moment</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause lists examples and prepositional phrase (by helping individuals focus on the present moment) explains the mechanism."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Mindfulness practices, <span class='highlight'>which include meditation, breathing exercises, and body scan techniques taught in clinical settings</span>, reduce stress <span class='highlight'>by helping individuals focus on the present moment rather than worrying about the past or future</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Extended practices list (body scan techniques taught in clinical settings) and fuller explanation of mechanism (rather than worrying about the past or future)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Mindfulness practices, <span class='highlight'>which include meditation, breathing exercises, and body scan techniques taught in clinical settings, supported by extensive neuroscientific research</span>, reduce stress <span class='highlight'>by helping individuals focus on the present moment rather than worrying about the past or future, leading to measurable improvements in anxiety disorders, depression, and overall emotional regulation in patients who practice regularly</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive sentence with: specific practices, scientific validation (supported by extensive neuroscientific research), mechanism, comparative focus (present vs. past/future), and documented benefits (improvements in anxiety disorders, depression, and emotional regulation in regular practitioners)."
        }
      ]
    },
    {
      "id": "cybersecurity",
      "topic": "Digital Security",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Two-factor authentication",
          "structure": "Subject",
          "explanation": "Just a subject - needs a predicate to be complete."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Two-factor authentication protects accounts.",
          "structure": "Subject + Verb + Object",
          "explanation": "Complete simple sentence stating the security benefit."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Two-factor authentication, <span class='highlight'>requiring both a password and a verification code</span>, protects accounts.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (requiring both a password and a verification code) explains how two-factor authentication works."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Two-factor authentication, <span class='highlight'>which requires both a password and a verification code sent to a mobile device</span>, protects accounts <span class='highlight'>from unauthorized access even if passwords are compromised</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause specifies the delivery method (sent to a mobile device) and prepositional phrase (from unauthorized access) explains the protection scenario."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Two-factor authentication, <span class='highlight'>which requires both a password and a verification code sent to a mobile device or generated by an authenticator app</span>, protects accounts <span class='highlight'>from unauthorized access even if passwords are compromised through phishing attacks or data breaches</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Added alternative method (authenticator app) and specific threat vectors (phishing attacks or data breaches)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Two-factor authentication, <span class='highlight'>which requires both a password and a verification code sent to a mobile device or generated by an authenticator app, although it adds a few seconds to the login process</span>, protects accounts <span class='highlight'>from unauthorized access even if passwords are compromised through phishing attacks or data breaches, making it an essential security measure for banking, email, and social media accounts where personal and financial information is at risk</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete security analysis with: authentication methods, minor inconvenience acknowledgment (although it adds a few seconds), threat protection, specific attack types, and critical applications (banking, email, social media where personal and financial information is at risk)."
        }
      ]
    },
    {
      "id": "sustainable-fashion",
      "topic": "Ethical Fashion",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Fast fashion",
          "structure": "Subject",
          "explanation": "Incomplete - just a noun phrase without a verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Fast fashion harms the environment.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence making a direct claim about environmental impact."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Fast fashion, <span class='highlight'>producing cheap clothing at rapid speeds</span>, harms the environment.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (producing cheap clothing at rapid speeds) defines what fast fashion is."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Fast fashion, <span class='highlight'>which produces cheap clothing at rapid speeds to match constantly changing trends</span>, harms the environment <span class='highlight'>through excessive water consumption and chemical pollution</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Prepositional Phrase",
          "explanation": "Relative clause adds motivation (to match constantly changing trends) and prepositional phrase specifies environmental harms."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Fast fashion, <span class='highlight'>which produces cheap clothing at rapid speeds to match constantly changing trends promoted by social media influencers</span>, harms the environment <span class='highlight'>through excessive water consumption, chemical pollution, and the generation of millions of tons of textile waste annually</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Prepositional Phrase",
          "explanation": "Added trend driver (promoted by social media influencers) and expanded environmental impacts (textile waste with quantification)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Fast fashion, <span class='highlight'>which produces cheap clothing at rapid speeds to match constantly changing trends promoted by social media influencers, despite growing consumer awareness of its negative impacts</span>, harms the environment <span class='highlight'>through excessive water consumption, chemical pollution, and the generation of millions of tons of textile waste annually, while also exploiting workers in developing countries who often labor under dangerous conditions for minimal wages</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Comprehensive critique including: production model, trend drivers, consumer awareness acknowledgment (despite growing consumer awareness), environmental damage with specific impacts, and human cost (exploiting workers in developing countries under dangerous conditions for minimal wages)."
        }
      ]
    },
    {
      "id": "renewable-transportation",
      "topic": "Electric Vehicles",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Electric vehicles",
          "structure": "Subject",
          "explanation": "Just a subject - not a complete thought."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Electric vehicles reduce carbon emissions.",
          "structure": "Subject + Verb + Object",
          "explanation": "Simple sentence stating the primary environmental benefit."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "Electric vehicles, <span class='highlight'>powered by rechargeable batteries</span>, reduce carbon emissions.",
          "structure": "Subject + Participial Phrase + Verb + Object",
          "explanation": "Participial phrase (powered by rechargeable batteries) explains the technology behind electric vehicles."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "Electric vehicles, <span class='highlight'>which are powered by rechargeable lithium-ion batteries</span>, reduce carbon emissions <span class='highlight'>when compared to traditional gasoline-powered cars</span>.",
          "structure": "Subject + Relative Clause + Verb + Object + Adverbial Clause",
          "explanation": "Relative clause specifies battery type (lithium-ion) and adverbial clause (when compared to traditional gasoline-powered cars) provides context for the comparison."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "Electric vehicles, <span class='highlight'>which are powered by rechargeable lithium-ion batteries that can be charged at home or public stations</span>, reduce carbon emissions <span class='highlight'>when compared to traditional gasoline-powered cars, especially in regions where electricity is generated from renewable sources</span>.",
          "structure": "Subject + Extended Relative Clause + Verb + Object + Extended Adverbial Clause",
          "explanation": "Added charging infrastructure (can be charged at home or public stations) and important qualification about energy source (especially in regions where electricity is generated from renewable sources)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Electric vehicles, <span class='highlight'>which are powered by rechargeable lithium-ion batteries that can be charged at home or public stations, despite concerns about battery production and disposal</span>, reduce carbon emissions <span class='highlight'>when compared to traditional gasoline-powered cars, especially in regions where electricity is generated from renewable sources, making them a crucial component of strategies to combat urban air pollution and achieve climate goals set by international agreements</span>.",
          "structure": "Multi-Clause Complex Sentence",
          "explanation": "Complete perspective with: technology and infrastructure, honest acknowledgment of challenges (despite concerns about battery production and disposal), comparative benefit, energy source qualification, and broader context (crucial component of strategies for urban air pollution and climate goals from international agreements)."
        }
      ]
    }
  ]
}
