{
  "examples": [
    {
      "id": "conditional-climate-action",
      "topic": "Climate Change and Individual Action",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Climate action",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Climate action makes a difference.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (climate action), a verb (makes), and an object (a difference). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "<span class='addition'>If people reduce waste</span>, climate action makes a difference.",
          "structure": "First Conditional + Main Clause",
          "explanation": "Adding a first conditional clause (if people reduce waste) shows a real future possibility. The if-clause uses present simple, and the main clause states a likely result. This is used for realistic future situations."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "<span class='addition'>If governments invested in renewable energy</span>, climate action <span class='addition'>would make a significant</span> difference.",
          "structure": "Second Conditional: If + Past Simple, Would + Infinitive",
          "explanation": "We've changed to second conditional (if governments invested...would make) to express a hypothetical or unlikely present/future situation. This shows what we wish would happen but probably won't."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "<span class='addition'>If nations had acted earlier</span>, climate action <span class='addition'>would have made a more significant</span> difference<span class='addition'>, though it is not too late to prevent further damage</span>.",
          "structure": "Third Conditional + Concessive Clause",
          "explanation": "Third conditional (if...had acted...would have made) expresses regret about the past - what didn't happen. The concessive clause (though it is not too late) balances the regret with hope for current action."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "<span class='addition'>If nations had acted earlier</span>, climate action <span class='addition'>would have made a more significant</span> difference; <span class='addition'>however, provided that governments implement bold policies now, we can still prevent the worst consequences that scientists warn about</span>.",
          "structure": "Mixed Conditionals + Alternative Conditional Form + Relative Clause",
          "explanation": "This combines third conditional (past regret), alternative conditional form (provided that = if), and a relative clause (that scientists warn about). It shows complex cause-effect relationships across different time frames, demonstrating how conditionals can express nuanced arguments about past actions and future possibilities."
        }
      ]
    },
    {
      "id": "passive-voice-research",
      "topic": "Scientific Discoveries",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "The vaccine",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Scientists developed the vaccine.",
          "structure": "Subject + Verb + Object (Active Voice)",
          "explanation": "Now we have a complete simple sentence. It has a subject (scientists), a verb (developed), and an object (the vaccine). This is active voice - the focus is on WHO did the action."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "The vaccine <span class='addition'>was developed by scientists</span>.",
          "structure": "Passive Voice: Subject + Be + Past Participle",
          "explanation": "Now in passive voice: the vaccine (subject) receives the action. This shifts focus to WHAT was done rather than WHO did it. Passive voice is common in scientific writing where the action and result matter more than the agent."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "The vaccine was developed <span class='addition'>by scientists after years of research</span>.",
          "structure": "Passive + Prepositional Phrases",
          "explanation": "We've added 'by scientists' (agent) and 'after years of research' (time context). The passive voice allows us to emphasize the vaccine and the lengthy process involved in its development."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "<span class='addition'>It is believed that</span> the vaccine was developed after years of research <span class='addition'>involving thousands of participants</span>.",
          "structure": "Impersonal Passive + Participle Phrase",
          "explanation": "Impersonal passive 'it is believed that' reports information without stating who believes it - very formal and common in academic writing. We've added a present participle (involving) to expand detail economically."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "The vaccine <span class='addition'>is believed to have been developed</span> after years of research involving thousands of participants, <span class='addition'>and it has been proven to reduce infection rates by 90%, according to data published in peer-reviewed journals</span>.",
          "structure": "Personal Passive + Perfect Infinitive + Additional Passive + View Structure",
          "explanation": "This advanced structure uses 'is believed to have been developed' (passive reporting with perfect infinitive showing earlier time). We've also added another passive (has been proven), a view structure (according to data), and a past participle (published). This demonstrates how multiple passive and reporting structures layer in academic writing."
        }
      ]
    },
    {
      "id": "noun-clauses-education",
      "topic": "Educational Policy",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Student success",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Student success depends on funding.",
          "structure": "Subject + Verb + Prepositional Phrase",
          "explanation": "Now we have a complete simple sentence. It has a subject (student success), a verb (depends on), and an object within a prepositional phrase (funding). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "<span class='addition'>Whether schools receive adequate funding</span> affects student success.",
          "structure": "Noun Clause as Subject + Verb + Object",
          "explanation": "A noun clause (whether schools receive adequate funding) now functions as the subject of the sentence. Noun clauses can replace single-word nouns - here the whole clause acts as one unit functioning as the subject."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "<span class='addition'>What teachers need most is support, and</span> whether schools receive adequate funding affects student success.",
          "structure": "Noun Clause as Subject + Compound Sentence",
          "explanation": "We've added another noun clause 'what teachers need most' as the subject of a new clause. The compound structure (connected with 'and') shows two related ideas, both using noun clauses as subjects."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "What teachers need most is support; however, <span class='addition'>the fact that many schools lack resources means that</span> student success remains limited <span class='addition'>in disadvantaged areas</span>.",
          "structure": "Noun Clauses + Appositive + Result Clause",
          "explanation": "This uses 'what teachers need' as a noun clause subject, plus 'the fact that' (appositive noun clause introducing information), and 'means that' to show consequence. We've also added location specificity (in disadvantaged areas)."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "What teachers need most is support; however, <span class='addition'>the fact that many schools lack resources, despite government promises to increase investment,</span> means that student success remains limited in disadvantaged areas, <span class='addition'>particularly affecting children whose families cannot afford private tutoring</span>.",
          "structure": "Multiple Noun Clauses + Concessive Clause + Relative Clause",
          "explanation": "This complex sentence uses: (1) 'what' noun clause as subject, (2) 'that' noun clause as appositive, (3) concessive clause (despite promises) embedded within, (4) 'that' noun clause as object (means that...), and (5) relative clause (whose families...) identifying affected groups. It shows how noun clauses integrate with other structures to build sophisticated arguments."
        }
      ]
    },
    {
      "id": "participle-clauses-technology",
      "topic": "Technology and Privacy",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Smart devices",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Smart devices collect data.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (smart devices), a verb (collect), and an object (data). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "<span class='addition'>Collecting personal information constantly</span>, smart devices raise privacy concerns.",
          "structure": "Present Participle Clause + Main Clause",
          "explanation": "The present participle 'collecting' creates a clause that shows simultaneous action. It answers HOW smart devices raise concerns. This structure makes writing more economical than using two separate clauses."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "<span class='addition'>Designed to be convenient</span>, smart devices collect data constantly, <span class='addition'>raising serious privacy concerns</span>.",
          "structure": "Past Participle Clause + Main Clause + Present Participle Clause",
          "explanation": "Two participle clauses: 'designed to be convenient' (past participle with passive meaning) shows purpose/characteristic, while 'raising serious privacy concerns' (present participle) shows result. Participles allow multiple ideas in one sentence."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "<span class='addition'>Though convenient</span>, smart devices, <span class='addition'>having been designed to collect data constantly</span>, raise serious privacy concerns <span class='addition'>that many users fail to recognize</span>.",
          "structure": "Verbless Clause + Perfect Participle Clause + Relative Clause",
          "explanation": "This uses: (1) verbless clause 'though convenient' (= though they are convenient), (2) perfect participle 'having been designed' to show prior action and passive meaning, and (3) relative clause 'that many users fail to recognize' for additional information."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "<span class='addition'>Though convenient for users</span>, smart devices, <span class='addition'>having been designed to collect data constantly without explicit consent, using colorful interfaces and persuasive notifications</span>, raise serious privacy concerns that many users fail to recognize, <span class='addition'>particularly vulnerable populations like children and the elderly who may not understand how their information is being used</span>.",
          "structure": "Verbless Clause + Perfect Participle + Present Participles + Relative Clauses + Passive Voice",
          "explanation": "This sophisticated sentence combines: (1) verbless concessive clause, (2) perfect passive participle showing earlier design intent, (3) present participles (using) adding method details, (4) relative clause, (5) embedded relative clause identifying vulnerable groups, and (6) passive construction (is being used). Notice how participle and verbless clauses create information density typical of analytical writing."
        }
      ]
    },
    {
      "id": "adverbial-clauses-healthcare",
      "topic": "Healthcare Access",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Healthcare costs",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Healthcare costs are rising.",
          "structure": "Subject + Verb",
          "explanation": "Now we have a complete simple sentence. It has a subject (healthcare costs) and a verb phrase (are rising). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "<span class='addition'>Because medical technology is expensive</span>, healthcare costs are rising.",
          "structure": "Adverbial Clause of Reason + Main Clause",
          "explanation": "The adverbial clause 'because medical technology is expensive' explains WHY costs are rising. Adverbial clauses of reason answer 'why' questions and can begin or end sentences."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "<span class='addition'>Although governments try to control expenses</span>, healthcare costs are rising <span class='addition'>so rapidly that many families cannot afford treatment</span>.",
          "structure": "Concessive Clause + Main Clause + Result Clause",
          "explanation": "Two adverbial clauses: (1) 'although governments try' shows concession (contrast - despite efforts), and (2) 'so rapidly that...' shows result/consequence. This creates a more nuanced argument acknowledging efforts while highlighting problems."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "<span class='addition'>Since healthcare costs have been rising for decades, and although</span> governments try to control expenses, many families cannot afford treatment <span class='addition'>unless they have comprehensive insurance, which itself has become prohibitively expensive</span>.",
          "structure": "Time Clause + Concessive Clause + Conditional Clause + Relative Clause",
          "explanation": "Multiple adverbial clauses: (1) 'since' (time/reason showing duration), (2) 'although' (concession), (3) 'unless' (negative condition - meaning 'if they don't have'), plus a relative clause adding related information about insurance costs."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "<span class='addition'>Ever since healthcare costs began rising in the 1980s, and despite governments' attempts to control expenses through various regulatory measures</span>, many families cannot afford treatment unless they have comprehensive insurance, <span class='addition'>with the result that people often delay seeking medical help until conditions become critical, thereby increasing both human suffering and ultimate treatment costs</span>.",
          "structure": "Extended Time Clause + Concessive Clause + Conditional Clause + Result Structure + Participle",
          "explanation": "This advanced sentence layers multiple adverbial relationships: (1) time clause with specific historical reference, (2) concessive clause with embedded prepositional phrase (through regulatory measures), (3) conditional clause, (4) result structure using 'with the result that', and (5) present participle 'thereby increasing' showing further consequence. It demonstrates how adverbial clauses create complex logical connections between ideas in academic and analytical writing."
        }
      ]
    },
    {
      "id": "reported-speech-journalism",
      "topic": "News Reporting",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "The minister's statement",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "The minister said, 'We will increase funding.'",
          "structure": "Direct Speech",
          "explanation": "Now we have a complete sentence with direct speech. The exact words are quoted. This is simple and clear but can become awkward when reporting multiple statements or integrating quotes into longer texts."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "The minister said <span class='addition'>that they would increase funding</span>.",
          "structure": "Reported Speech with Tense Backshift",
          "explanation": "Reported speech (indirect speech): 'will' becomes 'would', 'we' becomes 'they'. The tense shifts back because we're reporting words spoken in the past. The word 'that' is optional but often included in formal writing."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "The minister <span class='addition'>announced</span> that they would increase funding, <span class='addition'>adding that the changes would take effect next year</span>.",
          "structure": "Reported Speech + Additional Reporting Verb + Second Statement",
          "explanation": "Multiple reporting verbs (announced, adding) create variety and precision. Both statements use backshift: 'will increase' → 'would increase'. The second clause uses a present participle (adding) to introduce additional speech economically."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "The minister announced that they would increase funding <span class='addition'>significantly</span>, adding that the changes would take effect <span class='addition'>next year, though critics questioned whether the government had allocated sufficient resources to implement the reforms effectively</span>.",
          "structure": "Reported Statements + Reported Question + Past Perfect",
          "explanation": "This includes: (1) reported statement with adverb placement (significantly), (2) additional reported statement, (3) reported question using 'whether' (note: no subject-verb inversion in reported questions), and (4) past perfect (had allocated) showing time before the criticism was made."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "The minister announced that they would increase funding significantly, adding that the changes, <span class='addition'>which she described as 'transformative,'</span> would take effect <span class='addition'>the following year; however, opposition members immediately questioned whether the government had allocated sufficient resources to implement the reforms effectively, with one MP stating that previous promises had failed to materialize</span>.",
          "structure": "Complex Reported Speech with Mixed Direct/Indirect + Multiple Time Shifts",
          "explanation": "This sophisticated structure includes: (1) reported speech with time expression change (next year → the following year), (2) embedded direct quote within reported speech ('transformative'), (3) relative clause within reported speech, (4) reported question with past perfect, (5) additional reported statement with past perfect (had failed) showing sequence of past events, and (6) adverbial positioning (immediately) for emphasis. This mirrors professional journalism style where multiple sources and timelines must be integrated smoothly."
        }
      ]
    },
    {
      "id": "complex-noun-phrases-economics",
      "topic": "Economic Policy",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Interest rates",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Interest rates affect inflation.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (interest rates), a verb (affect), and an object (inflation). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "<span class='addition'>Changes in</span> interest rates <span class='addition'>may</span> affect inflation.",
          "structure": "Nominalization + Modal Verb",
          "explanation": "We've nominalized 'interest rates change' into 'changes in interest rates' - turning a verb concept into a noun phrase. The modal 'may' adds uncertainty/possibility. Nominalization is common in formal writing as it creates more abstract, academic tone."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "<span class='addition'>Sudden</span> changes in interest rates <span class='addition'>imposed by central banks might significantly</span> affect inflation rates <span class='addition'>in developing economies</span>.",
          "structure": "Extended Noun Phrase with Modifiers + Modal + Adverb",
          "explanation": "The noun phrase now has: (1) pre-modifier 'sudden', (2) post-modifier 'imposed by central banks' (past participle showing passive), and (3) the object also has post-modifier 'in developing economies'. Modal 'might' shows weaker possibility; adverb 'significantly' intensifies the verb."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "<span class='addition'>The decision by major central banks to raise</span> interest rates <span class='addition'>rapidly, despite warnings from economists about potential risks, could significantly</span> affect inflation rates in developing economies <span class='addition'>that rely heavily on foreign investment</span>.",
          "structure": "Highly Complex Noun Phrase + Concessive Clause + Modal + Relative Clause",
          "explanation": "The subject is now a dense noun phrase: 'the decision' modified by (1) 'by major central banks' (prepositional phrase showing agent), (2) 'to raise interest rates rapidly' (infinitive of content/purpose), and (3) 'despite warnings...' (concessive clause embedded in subject). The modal 'could' hedges the claim. The object includes a relative clause specifying which economies."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "<span class='addition'>The controversial</span> decision by major central banks to raise interest rates rapidly <span class='addition'>in response to inflationary pressures</span>, despite warnings from <span class='addition'>leading</span> economists about potential risks <span class='addition'>to economic stability</span>, could significantly affect inflation rates in developing economies that rely heavily on foreign investment, <span class='addition'>potentially triggering capital flight and currency devaluation in countries whose governments lack adequate foreign reserves to defend their monetary policy</span>.",
          "structure": "Maximum Noun Phrase Complexity + Multiple Embeddings + Participle + Relative Clauses",
          "explanation": "This demonstrates maximum noun phrase complexity with multiple layers: (1) 'the decision' as head noun, (2) pre-modifier 'controversial' (evaluative adjective), (3) post-modifier 'by major central banks', (4) infinitive phrase 'to raise...', (5) prepositional phrase 'in response to...', (6) embedded concessive clause with its own modifiers, (7) modal hedging 'could', (8) adverb 'significantly', (9) extended object with relative clause, (10) present participle 'potentially triggering' showing possible result, and (11) additional relative clause with 'whose' showing possession. This structure is typical of academic, policy, and economic writing where multiple qualifications, conditions, and specifications must be precisely expressed."
        }
      ]
    },
    {
      "id": "cleft-emphasis-social-issues",
      "topic": "Social Inequality",
      "steps": [
        {
          "level": 1,
          "status": "incomplete",
          "text": "Education inequality",
          "structure": "Subject",
          "explanation": "This is just a noun phrase - an incomplete thought that leaves the reader waiting. It's not a sentence because there's no verb."
        },
        {
          "level": 2,
          "status": "complete",
          "text": "Education inequality creates social problems.",
          "structure": "Subject + Verb + Object",
          "explanation": "Now we have a complete simple sentence. It has a subject (education inequality), a verb (creates), and an object (social problems). This is grammatically complete."
        },
        {
          "level": 3,
          "status": "enhanced",
          "text": "<span class='addition'>It is</span> education inequality <span class='addition'>that creates the most serious</span> social problems.",
          "structure": "It-Cleft for Emphasis",
          "explanation": "An 'it-cleft' sentence emphasizes 'education inequality' by placing it in focus position after 'it is'. This structure answers 'WHAT creates social problems?' with strong emphasis. The structure is: It + be + focus + that/who-clause."
        },
        {
          "level": 4,
          "status": "complex",
          "text": "<span class='addition'>What creates the most serious social problems is</span> education inequality, <span class='addition'>not lack of economic growth</span>.",
          "structure": "Wh-Cleft (Pseudo-cleft) + Contrast",
          "explanation": "A 'wh-cleft' (or pseudo-cleft) uses 'what' to front information for emphasis. The structure is: What-clause + be + focus. The explicit contrast with 'not lack of economic growth' makes the emphasis even stronger, rejecting an alternative explanation."
        },
        {
          "level": 5,
          "status": "advanced",
          "text": "<span class='addition'>Not only does</span> education inequality create social problems, <span class='addition'>but it also perpetuates cycles of poverty across generations</span>.",
          "structure": "Negative Inversion: Not only + Auxiliary + Subject",
          "explanation": "After negative adverbs (not only, never, rarely, seldom), we invert subject and auxiliary for emphasis. Notice: 'Not only does education inequality create' (inverted) not 'education inequality does create' (normal order). The 'but also' structure adds a second, often more serious, consequence."
        },
        {
          "level": 6,
          "status": "mastery",
          "text": "Not only does education inequality create <span class='addition'>immediate</span> social problems, but it also perpetuates cycles of poverty across generations; <span class='addition'>it is this intergenerational effect that most concerns policymakers, for only by addressing systemic barriers can societies hope to achieve genuine equality of opportunity</span>.",
          "structure": "Negative Inversion + It-Cleft + Inversion after 'Only'",
          "explanation": "This combines three emphasis structures: (1) negative inversion with 'not only...but also', (2) it-cleft 'it is this...that' to emphasize which specific aspect concerns policymakers, and (3) inversion after 'only' ('only by addressing...can societies' not 'societies can'). The formal conjunction 'for' introduces the reason. This demonstrates how multiple emphasis structures can work together in sophisticated academic or persuasive writing to guide readers' attention to key arguments."
        }
      ]
    }
  ]
}
