{
  "samples": [
    {
      "id": 1,
      "topic": "Environmental damage from human activities",
      "steps": [
        {
          "step": 1,
          "text": "One serious problem with modern industry is that it produces huge amounts of waste.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One serious problem with modern industry is that it produces huge amounts of waste. This happens because factories process materials on a very large scale.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One serious problem with modern industry is that it produces huge amounts of waste. This happens because factories process materials on a very large scale. For example, clothing manufacturers throw away tons of fabric every single day.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One serious problem with modern industry is that it produces huge amounts of waste. This happens because factories process materials on a very large scale. For example, clothing manufacturers throw away tons of fabric every single day. As a result, landfills keep growing and pollution increases in rivers and seas.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 2,
      "topic": "Technology improving quality of life",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, advances in communication technology have made staying in touch much easier.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, advances in communication technology have made staying in touch much easier. This means that families who live far apart can now video call each other instantly.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "From my point of view, advances in communication technology have made staying in touch much easier. This means that families who live far apart can now video call each other instantly. For instance, grandparents can watch their grandchildren grow up even when they live in different countries.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, advances in communication technology have made staying in touch much easier. This means that families who live far apart can now video call each other instantly. For instance, grandparents can watch their grandchildren grow up even when they live in different countries. Therefore, family relationships can stay strong despite the distance.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 3,
      "topic": "Rich countries and Third World problems",
      "steps": [
        {
          "step": 1,
          "text": "One important point is that wealthy nations often benefit from natural resources taken from poorer countries.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One important point is that wealthy nations often benefit from natural resources taken from poorer countries. This is because multinational companies extract minerals and oil without paying fair prices to local communities.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One important point is that wealthy nations often benefit from natural resources taken from poorer countries. This is because multinational companies extract minerals and oil without paying fair prices to local communities. For example, some African nations remain poor despite having enormous diamond reserves.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One important point is that wealthy nations often benefit from natural resources taken from poorer countries. This is because multinational companies extract minerals and oil without paying fair prices to local communities. For example, some African nations remain poor despite having enormous diamond reserves. Consequently, this creates a situation where the rich get richer while poor countries struggle to develop.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 4,
      "topic": "National responsibility for citizen wellbeing",
      "steps": [
        {
          "step": 1,
          "text": "A further point to consider is that governments should guarantee free healthcare for all citizens.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "A further point to consider is that governments should guarantee free healthcare for all citizens. This means that everyone can receive medical treatment regardless of how much money they earn.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "A further point to consider is that governments should guarantee free healthcare for all citizens. This means that everyone can receive medical treatment regardless of how much money they earn. Given that health is a basic human right, no one should suffer simply because they cannot afford doctors or medicines.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 4,
          "text": "A further point to consider is that governments should guarantee free healthcare for all citizens. This means that everyone can receive medical treatment regardless of how much money they earn. Given that health is a basic human right, no one should suffer simply because they cannot afford doctors or medicines. As a result, societies with free healthcare tend to be healthier and more productive overall.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 5,
      "topic": "Cultural identity under threat",
      "steps": [
        {
          "step": 1,
          "text": "Another key idea is that international fast food chains are replacing traditional local restaurants in many countries.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "Another key idea is that international fast food chains are replacing traditional local restaurants in many countries. This happens because these global brands can offer cheaper prices through mass production.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "Another key idea is that international fast food chains are replacing traditional local restaurants in many countries. This happens because these global brands can offer cheaper prices through mass production. For instance, small family-run cafés struggle to compete with large burger chains that appear on every street corner.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "Another key idea is that international fast food chains are replacing traditional local restaurants in many countries. This happens because these global brands can offer cheaper prices through mass production. For instance, small family-run cafés struggle to compete with large burger chains that appear on every street corner. Consequently, unique local food traditions risk disappearing completely from city centres.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 6,
      "topic": "Global communications impact",
      "steps": [
        {
          "step": 1,
          "text": "It is also worth mentioning that the spread of English has connected people across different continents.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "It is also worth mentioning that the spread of English has connected people across different continents. This helps international business and tourism flow more smoothly than ever before.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "It is also worth mentioning that the spread of English has connected people across different continents. This helps international business and tourism flow more smoothly than ever before. For example, a Japanese businessperson can easily communicate with Brazilian partners using English as their common language.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "It is also worth mentioning that the spread of English has connected people across different continents. This helps international business and tourism flow more smoothly than ever before. For example, a Japanese businessperson can easily communicate with Brazilian partners using English as their common language. Therefore, global cooperation has become much more practical and efficient.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 7,
      "topic": "Work and workplace changes",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, having a good relationship with colleagues makes work much more enjoyable.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, having a good relationship with colleagues makes work much more enjoyable. This is because people spend many hours each day with their work team.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "From my point of view, having a good relationship with colleagues makes work much more enjoyable. This is because people spend many hours each day with their work team. For instance, employees who get along well with their colleagues look forward to coming to the office each morning.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, having a good relationship with colleagues makes work much more enjoyable. This is because people spend many hours each day with their work team. For instance, employees who get along well with their colleagues look forward to coming to the office each morning. As a result, friendly workplaces tend to have lower staff turnover and higher productivity.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 8,
      "topic": "Young people and job market obstacles",
      "steps": [
        {
          "step": 1,
          "text": "One major concern is that many young people struggle to find decent jobs despite having good qualifications.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One major concern is that many young people struggle to find decent jobs despite having good qualifications. This happens because employers often demand several years of work experience.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One major concern is that many young people struggle to find decent jobs despite having good qualifications. This happens because employers often demand several years of work experience. For example, university graduates frequently face the frustrating situation where they cannot get a job without experience, but cannot gain experience without a job.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One major concern is that many young people struggle to find decent jobs despite having good qualifications. This happens because employers often demand several years of work experience. For example, university graduates frequently face the frustrating situation where they cannot get a job without experience, but cannot gain experience without a job. Consequently, many talented young workers end up accepting low-paid positions far below their skill level.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 9,
      "topic": "Travel and tourism benefits",
      "steps": [
        {
          "step": 1,
          "text": "One clear advantage is that tourism brings significant income to local communities.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One clear advantage is that tourism brings significant income to local communities. This means that small businesses such as hotels, restaurants and shops can thrive in tourist areas.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "One clear advantage is that tourism brings significant income to local communities. This means that small businesses such as hotels, restaurants and shops can thrive in tourist areas. For instance, coastal villages in Greece depend almost entirely on summer visitors for their annual income.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One clear advantage is that tourism brings significant income to local communities. This means that small businesses such as hotels, restaurants and shops can thrive in tourist areas. For instance, coastal villages in Greece depend almost entirely on summer visitors for their annual income. Therefore, tourism creates jobs and helps entire regions maintain their economies.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 10,
      "topic": "Tourism drawbacks",
      "steps": [
        {
          "step": 1,
          "text": "One possible disadvantage is that mass tourism can damage local environments and cultures.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One possible disadvantage is that mass tourism can damage local environments and cultures. This occurs because large numbers of visitors create pollution and put pressure on natural resources.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One possible disadvantage is that mass tourism can damage local environments and cultures. This occurs because large numbers of visitors create pollution and put pressure on natural resources. For example, popular beaches in Thailand now suffer from severe plastic pollution left behind by tourists.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One possible disadvantage is that mass tourism can damage local environments and cultures. This occurs because large numbers of visitors create pollution and put pressure on natural resources. For example, popular beaches in Thailand now suffer from severe plastic pollution left behind by tourists. As a result, some beautiful natural sites are becoming spoiled and may never fully recover.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 11,
      "topic": "Fitness and appearance concerns",
      "steps": [
        {
          "step": 1,
          "text": "Another key idea is that social media puts enormous pressure on young people to look perfect.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "Another key idea is that social media puts enormous pressure on young people to look perfect. This happens because teenagers constantly see edited photos of celebrities and influencers online.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "Another key idea is that social media puts enormous pressure on young people to look perfect. This happens because teenagers constantly see edited photos of celebrities and influencers online. For instance, many young people spend hours trying different filters to make themselves look thinner or more attractive before posting pictures.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "Another key idea is that social media puts enormous pressure on young people to look perfect. This happens because teenagers constantly see edited photos of celebrities and influencers online. For instance, many young people spend hours trying different filters to make themselves look thinner or more attractive before posting pictures. Consequently, this creates unrealistic beauty standards that can harm teenagers' self-confidence and mental health.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 12,
      "topic": "Modern health challenges",
      "steps": [
        {
          "step": 1,
          "text": "One serious problem with modern living is that people sit down for far too many hours each day.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One serious problem with modern living is that people sit down for far too many hours each day. This is because most office jobs require employees to work at computers for eight hours or more.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One serious problem with modern living is that people sit down for far too many hours each day. This is because most office jobs require employees to work at computers for eight hours or more. For example, office workers typically sit during their commute, throughout their working day, and again in the evening watching television.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One serious problem with modern living is that people sit down for far too many hours each day. This is because most office jobs require employees to work at computers for eight hours or more. For example, office workers typically sit during their commute, throughout their working day, and again in the evening watching television. As a result, rates of heart disease and obesity continue to rise dramatically in developed countries.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 13,
      "topic": "Foreign language learning importance",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, learning foreign languages opens up many career opportunities.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, learning foreign languages opens up many career opportunities. This helps job seekers stand out in competitive international markets.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "From my point of view, learning foreign languages opens up many career opportunities. This helps job seekers stand out in competitive international markets. For instance, companies often prefer to hire employees who can communicate with overseas clients in their own language.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, learning foreign languages opens up many career opportunities. This helps job seekers stand out in competitive international markets. For instance, companies often prefer to hire employees who can communicate with overseas clients in their own language. Therefore, bilingual workers frequently earn higher salaries and advance more quickly in their careers.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 14,
      "topic": "Education and learning methods",
      "steps": [
        {
          "step": 1,
          "text": "A further point to consider is that students learn best when they can explore subjects at their own pace.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "A further point to consider is that students learn best when they can explore subjects at their own pace. This is because everyone has different learning speeds and styles.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "A further point to consider is that students learn best when they can explore subjects at their own pace. This is because everyone has different learning speeds and styles. For example, some students need extra time to understand mathematics, while others might race ahead with reading.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "A further point to consider is that students learn best when they can explore subjects at their own pace. This is because everyone has different learning speeds and styles. For example, some students need extra time to understand mathematics, while others might race ahead with reading. Consequently, flexible learning approaches help all students reach their full potential instead of struggling to keep up.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 15,
      "topic": "Career choices and employment",
      "steps": [
        {
          "step": 1,
          "text": "One important point is that young people need proper guidance when choosing their future careers.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One important point is that young people need proper guidance when choosing their future careers. This means they should receive advice from teachers, parents and career counsellors.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "One important point is that young people need proper guidance when choosing their future careers. This means they should receive advice from teachers, parents and career counsellors. For instance, school careers advisors can explain which qualifications lead to different professions and what working conditions to expect.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One important point is that young people need proper guidance when choosing their future careers. This means they should receive advice from teachers, parents and career counsellors. For instance, school careers advisors can explain which qualifications lead to different professions and what working conditions to expect. As a result, teenagers can make more informed decisions and avoid choosing unsuitable career paths.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 16,
      "topic": "Fashion and teenage responsibility",
      "steps": [
        {
          "step": 1,
          "text": "Another key idea is that teenagers today face increasing pressure to keep up with fashion trends.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "Another key idea is that teenagers today face increasing pressure to keep up with fashion trends. This happens because social media influencers constantly promote new styles and clothing brands.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "Another key idea is that teenagers today face increasing pressure to keep up with fashion trends. This happens because social media influencers constantly promote new styles and clothing brands. For example, young people often feel they need to buy new outfits every month to avoid wearing the same clothes in photos.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "Another key idea is that teenagers today face increasing pressure to keep up with fashion trends. This happens because social media influencers constantly promote new styles and clothing brands. For example, young people often feel they need to buy new outfits every month to avoid wearing the same clothes in photos. Consequently, this leads to unnecessary spending and contributes to environmental damage from fast fashion waste.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 17,
      "topic": "Criminal justice and young offenders",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, young offenders should receive education and support rather than harsh punishment.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, young offenders should receive education and support rather than harsh punishment. This is because teenagers who commit crimes often come from difficult backgrounds with limited opportunities.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "From my point of view, young offenders should receive education and support rather than harsh punishment. This is because teenagers who commit crimes often come from difficult backgrounds with limited opportunities. For instance, young people who receive counselling and job training are far less likely to re-offend than those simply locked up in youth detention centres.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, young offenders should receive education and support rather than harsh punishment. This is because teenagers who commit crimes often come from difficult backgrounds with limited opportunities. For instance, young people who receive counselling and job training are far less likely to re-offend than those simply locked up in youth detention centres. Therefore, investing in rehabilitation programmes creates safer communities and gives young people a real chance to change their lives.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 18,
      "topic": "Sport and competition",
      "steps": [
        {
          "step": 1,
          "text": "One possible disadvantage is that professional sport has become too focused on money rather than sporting excellence.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One possible disadvantage is that professional sport has become too focused on money rather than sporting excellence. This occurs because huge amounts of sponsorship money flow into popular sports like football.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One possible disadvantage is that professional sport has become too focused on money rather than sporting excellence. This occurs because huge amounts of sponsorship money flow into popular sports like football. For example, top footballers now earn millions of pounds each year while athletes in less popular sports struggle to make a living.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One possible disadvantage is that professional sport has become too focused on money rather than sporting excellence. This occurs because huge amounts of sponsorship money flow into popular sports like football. For example, top footballers now earn millions of pounds each year while athletes in less popular sports struggle to make a living. As a result, many talented young people choose sports based on potential earnings rather than genuine passion or ability.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 19,
      "topic": "Fame and celebrity culture",
      "steps": [
        {
          "step": 1,
          "text": "It is also worth mentioning that modern celebrity culture encourages people to seek fame rather than develop genuine talent.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "It is also worth mentioning that modern celebrity culture encourages people to seek fame rather than develop genuine talent. This happens because reality television shows make ordinary people famous overnight without requiring any special skills.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "It is also worth mentioning that modern celebrity culture encourages people to seek fame rather than develop genuine talent. This happens because reality television shows make ordinary people famous overnight without requiring any special skills. For instance, social media influencers can become millionaires simply by posting videos of their daily lives.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "It is also worth mentioning that modern celebrity culture encourages people to seek fame rather than develop genuine talent. This happens because reality television shows make ordinary people famous overnight without requiring any special skills. For instance, social media influencers can become millionaires simply by posting videos of their daily lives. Consequently, many young people now dream of becoming internet famous instead of pursuing meaningful careers.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 20,
      "topic": "Personal health responsibility",
      "steps": [
        {
          "step": 1,
          "text": "A further point to consider is that individuals should take more responsibility for their own health.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "A further point to consider is that individuals should take more responsibility for their own health. This means making conscious choices about diet, exercise and lifestyle habits.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "A further point to consider is that individuals should take more responsibility for their own health. This means making conscious choices about diet, exercise and lifestyle habits. For example, people who regularly check their blood pressure and maintain a balanced diet reduce their risk of serious illness later in life.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "A further point to consider is that individuals should take more responsibility for their own health. This means making conscious choices about diet, exercise and lifestyle habits. For example, people who regularly check their blood pressure and maintain a balanced diet reduce their risk of serious illness later in life. Therefore, taking personal responsibility creates healthier populations and reduces pressure on healthcare systems.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 21,
      "topic": "Mood and wellbeing factors",
      "steps": [
        {
          "step": 1,
          "text": "One important point is that spending time outdoors significantly improves people's mood and mental health.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One important point is that spending time outdoors significantly improves people's mood and mental health. This is because natural sunlight helps the body produce vitamins that affect emotions.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One important point is that spending time outdoors significantly improves people's mood and mental health. This is because natural sunlight helps the body produce vitamins that affect emotions. For instance, people who walk in parks or gardens regularly report feeling calmer and more positive than those who stay indoors all day.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One important point is that spending time outdoors significantly improves people's mood and mental health. This is because natural sunlight helps the body produce vitamins that affect emotions. For instance, people who walk in parks or gardens regularly report feeling calmer and more positive than those who stay indoors all day. As a result, doctors now recommend outdoor activities as a natural treatment for stress and mild depression.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 22,
      "topic": "Happiness in modern society",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, material possessions do not guarantee happiness in life.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, material possessions do not guarantee happiness in life. This is because strong relationships and meaningful experiences matter far more than owning expensive things.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "From my point of view, material possessions do not guarantee happiness in life. This is because strong relationships and meaningful experiences matter far more than owning expensive things. For example, spending quality time with family creates lasting happiness, whereas the excitement of buying a new phone fades within weeks.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, material possessions do not guarantee happiness in life. This is because strong relationships and meaningful experiences matter far more than owning expensive things. For example, spending quality time with family creates lasting happiness, whereas the excitement of buying a new phone fades within weeks. Therefore, people should invest more energy in building relationships rather than accumulating possessions.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 23,
      "topic": "Social status and modern life",
      "steps": [
        {
          "step": 1,
          "text": "Another key idea is that social media has made people far too concerned about their status and image.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "Another key idea is that social media has made people far too concerned about their status and image. This happens because users constantly compare their lives with carefully edited versions of other people's experiences.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "Another key idea is that social media has made people far too concerned about their status and image. This happens because users constantly compare their lives with carefully edited versions of other people's experiences. For instance, teenagers often feel inadequate when they see classmates posting photos from expensive holidays or wearing designer clothes.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "Another key idea is that social media has made people far too concerned about their status and image. This happens because users constantly compare their lives with carefully edited versions of other people's experiences. For instance, teenagers often feel inadequate when they see classmates posting photos from expensive holidays or wearing designer clothes. Consequently, this creates unnecessary stress and damages self-esteem among young people.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 24,
      "topic": "Generational differences",
      "steps": [
        {
          "step": 1,
          "text": "One clear advantage is that previous generations often had simpler and less stressful lives.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One clear advantage is that previous generations often had simpler and less stressful lives. This was because people had fewer material expectations and stronger community connections.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One clear advantage is that previous generations often had simpler and less stressful lives. This was because people had fewer material expectations and stronger community connections. For example, grandparents often describe childhoods where entertainment came from playing outdoors with neighbours rather than expensive gadgets.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One clear advantage is that previous generations often had simpler and less stressful lives. This was because people had fewer material expectations and stronger community connections. For example, grandparents often describe childhoods where entertainment came from playing outdoors with neighbours rather than expensive gadgets. Therefore, many older people remember feeling more content with less, whereas modern life creates constant pressure to have more.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 25,
      "topic": "Future workplace predictions",
      "steps": [
        {
          "step": 1,
          "text": "It is also worth mentioning that robots and artificial intelligence will transform the workplace dramatically over the next few decades.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "It is also worth mentioning that robots and artificial intelligence will transform the workplace dramatically over the next few decades. This means that many routine jobs currently done by humans will disappear completely.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "It is also worth mentioning that robots and artificial intelligence will transform the workplace dramatically over the next few decades. This means that many routine jobs currently done by humans will disappear completely. For instance, self-driving vehicles may soon replace taxi drivers and delivery workers.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "It is also worth mentioning that robots and artificial intelligence will transform the workplace dramatically over the next few decades. This means that many routine jobs currently done by humans will disappear completely. For instance, self-driving vehicles may soon replace taxi drivers and delivery workers. Consequently, workers will need to retrain regularly and focus on skills that machines cannot easily replicate.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 26,
      "topic": "Fair pay and employment",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, entertainers and athletes receive far too much money compared to essential workers.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, entertainers and athletes receive far too much money compared to essential workers. This seems unfair because nurses, teachers and emergency workers provide vital services to society.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "From my point of view, entertainers and athletes receive far too much money compared to essential workers. This seems unfair because nurses, teachers and emergency workers provide vital services to society. For example, a professional footballer might earn more in a single week than a nurse earns in an entire year.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, entertainers and athletes receive far too much money compared to essential workers. This seems unfair because nurses, teachers and emergency workers provide vital services to society. For example, a professional footballer might earn more in a single week than a nurse earns in an entire year. Therefore, society should value and reward people based on their contribution to others' wellbeing rather than their entertainment value.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 27,
      "topic": "Fashion and self-expression",
      "steps": [
        {
          "step": 1,
          "text": "Another key idea is that clothing allows people to express their personality and individuality.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "Another key idea is that clothing allows people to express their personality and individuality. This helps people communicate who they are without saying a single word.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "Another key idea is that clothing allows people to express their personality and individuality. This helps people communicate who they are without saying a single word. For instance, creative people often wear bright colours and unusual styles, while those in professional roles choose more formal outfits.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "Another key idea is that clothing allows people to express their personality and individuality. This helps people communicate who they are without saying a single word. For instance, creative people often wear bright colours and unusual styles, while those in professional roles choose more formal outfits. As a result, fashion gives everyone the freedom to show their identity and feel comfortable in their own skin.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 28,
      "topic": "Modern life demands",
      "steps": [
        {
          "step": 1,
          "text": "One serious problem with modern life is that people feel constantly pressured to meet unrealistic standards.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "One serious problem with modern life is that people feel constantly pressured to meet unrealistic standards. This occurs because social media creates the illusion that everyone else is living perfect lives.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "One serious problem with modern life is that people feel constantly pressured to meet unrealistic standards. This occurs because social media creates the illusion that everyone else is living perfect lives. For example, young people compare themselves to influencers who appear to have flawless appearances, exciting careers and ideal relationships.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "One serious problem with modern life is that people feel constantly pressured to meet unrealistic standards. This occurs because social media creates the illusion that everyone else is living perfect lives. For example, young people compare themselves to influencers who appear to have flawless appearances, exciting careers and ideal relationships. Consequently, many individuals struggle with anxiety and feelings of inadequacy when their real lives do not match these impossible expectations.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 29,
      "topic": "Tradition and cultural change",
      "steps": [
        {
          "step": 1,
          "text": "A further point to consider is that traditional customs help connect younger generations with their cultural heritage.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "A further point to consider is that traditional customs help connect younger generations with their cultural heritage. This means that festivals and ceremonies pass down important values and stories from the past.",
          "type": "explain",
          "label": "EXPLANATION"
        },
        {
          "step": 3,
          "text": "A further point to consider is that traditional customs help connect younger generations with their cultural heritage. This means that festivals and ceremonies pass down important values and stories from the past. For instance, family gatherings during cultural celebrations teach children about their ancestors' lives and beliefs.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "A further point to consider is that traditional customs help connect younger generations with their cultural heritage. This means that festivals and ceremonies pass down important values and stories from the past. For instance, family gatherings during cultural celebrations teach children about their ancestors' lives and beliefs. Therefore, maintaining traditions helps preserve cultural identity and creates a stronger sense of belonging within communities.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    },
    {
      "id": 30,
      "topic": "Technology and relationships",
      "steps": [
        {
          "step": 1,
          "text": "From my point of view, technology has both strengthened and weakened human relationships in different ways.",
          "type": "topic",
          "label": "TOPIC SENTENCE"
        },
        {
          "step": 2,
          "text": "From my point of view, technology has both strengthened and weakened human relationships in different ways. This is because digital communication makes staying in touch easier but can also replace meaningful face-to-face contact.",
          "type": "reason",
          "label": "REASON"
        },
        {
          "step": 3,
          "text": "From my point of view, technology has both strengthened and weakened human relationships in different ways. This is because digital communication makes staying in touch easier but can also replace meaningful face-to-face contact. For example, families can video call relatives abroad but might ignore each other at the dinner table while checking their phones.",
          "type": "example",
          "label": "EXAMPLE"
        },
        {
          "step": 4,
          "text": "From my point of view, technology has both strengthened and weakened human relationships in different ways. This is because digital communication makes staying in touch easier but can also replace meaningful face-to-face contact. For example, families can video call relatives abroad but might ignore each other at the dinner table while checking their phones. Therefore, people must use technology wisely to maintain genuine connections rather than letting devices dominate their relationships.",
          "type": "result",
          "label": "RESULT"
        }
      ]
    }
  ]
}
