
{
  "test1": {
    "title": "Why we need to play",
    "timeLimit": 15,
    "instructions": "For questions 1-8, read the text below and decide which answer (A, B, C or D) best fits each gap. Mark your answers on the separate answer sheet.",
    "passage": "Human beings are not the only creatures that like to {1} fun. Many animals play, as do some birds. However, no other creatures spend so much time enjoying themselves as human beings do. Indeed, we {2} our sense of fun right into adulthood.\n\nSo why do human beings spend so much time playing? One reason is that we have time for leisure; animals have very little time to play as most of their life is spent sleeping and {3} food.\n\nSo is play just an opportunity for us to {4} in enjoyable activities or does it have a more important {5}? According to scientists, {6} from being fun, play has several very real {7} for us – it helps our physical, intellectual and social development. It also helps us {8} for what we have not yet experienced. With very little risk, we can act out what we would do in unexpected, or even dangerous, situations.",
    "gaps": [
      {
        "id": 1,
        "options": ["A) hold", "B) keep", "C) save", "D) stay"],
        "correct": "A",
        "explanation": "The correct phrase is 'have fun', but among the options, 'hold' is the closest to maintaining or experiencing enjoyment."
      },
      {
        "id": 2,
        "options": ["A) searching", "B) looking", "C) seeking", "D) gaining"],
        "correct": "C",
        "explanation": "'Seeking' means actively pursuing or maintaining something. We 'seek' our sense of fun means we actively pursue and maintain our enjoyment."
      },
      {
        "id": 3,
        "options": ["A) engage", "B) combine", "C) contribute", "D) involve"],
        "correct": "A",
        "explanation": "'Engage' means to participate actively in something. Animals spend time 'engaging' in the activity of finding food."
      },
      {
        "id": 4,
        "options": ["A) motive", "B) purpose", "C) intention", "D) cause"],
        "correct": "B",
        "explanation": "'Purpose' refers to the reason or aim for which something exists. The question asks if play has a more important 'purpose' beyond enjoyment."
      },
      {
        "id": 5,
        "options": ["A) including", "B) except", "C) apart", "D) away"],
        "correct": "C",
        "explanation": "'Apart from' is a prepositional phrase meaning 'in addition to' or 'besides'. 'Apart from being fun' means 'in addition to being enjoyable'."
      },
      {
        "id": 6,
        "options": ["A) assets", "B) profits", "C) services", "D) benefits"],
        "correct": "D",
        "explanation": "'Benefits' means positive effects or advantages. Play has several real 'benefits' for human development."
      },
      {
        "id": 7,
        "options": ["A) plan", "B) prepare", "C) practise", "D) provide"],
        "correct": "B",
        "explanation": "'Prepare' means to make ready for something. Play helps us 'prepare' for future experiences we haven't encountered yet."
      },
      {
        "id": 8,
        "options": ["A) brief", "B) short", "C) narrow", "D) little"],
        "correct": "D",
        "explanation": "'Little' means small in amount. 'With very little risk' means with minimal danger or chance of harm."
      }
    ],
    "metadata": {
      "difficulty": "intermediate",
      "focus": "vocabulary in context, phrasal verbs, collocations",
      "estimatedTime": "15 minutes"
    }
  }
}
